{"input":{"cteatedAt":"2021-02-18T12:30:32.239Z","url":"http://www.openmobilealliance.org/release/NGSI/V1_0-20090918-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/NGSI/V1_0-20090918-C/OMA-ERELD-NGSI-V1_0-20090918-C.pdf","file":"OMA-ERELD-NGSI-V1_0-20090918-C.pdf","status":"Candidate","version":"V1.0","date":"2009-09-18","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of NGSI according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/NGSI/V1_0-20090918-C/OMA-ERP-NGSI-V1_0-20090918-C.zip","file":"OMA-ERP-NGSI-V1_0-20090918-C.zip","status":"Candidate","version":"V1.0","date":"2009-09-18","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/NGSI/V1_0-20090918-C/OMA-RD-NGSI-V1_0-20090918-C.pdf","file":"OMA-RD-NGSI-V1_0-20090918-C.pdf","status":"Candidate","version":"V1.0","date":"2009-09-18","contentMediaType":"application/pdf","description":"This document defines the requirements for the OMA Next Generation Service Interfaces (NGSI) v.1.0. The aim of the OMA NGSI RD v1.0 is to address requirements for:  •Extensions of existing interfaces for personal communication services, including  oRich multimedia services support like advanced multimedia conferences, content sharing and content delivery, as well as conference member management and advanced call handling schemes like:  \u0001Extensions to third party call control and call notifications including Media enhancements (e.g. CMR), behavior which is based on configuration (e.g. simple forking, Find Me Service), control on display/restrict calling line identification,  \u0001Enhancement to the conference experience (including manipulation of group list, multimedia streaming control).  oAccess to Service Provider Media/data storages,  oFederation and management of identities within/across domains,  Sophisticated Media control (e.g. support for Media control scripts, providing multimedia guidance) •Context and Personalization with focus on multimedia services:  oUse of context and preference information to enrich user experience in Communication Services, Call handling and multimedia services,  oUser-driven manipulation of multimedia experience. Applications/enablers which make use of network functionality offered through the NGSI interface are out of scope of this document. Charging aspects (included in the NGSI Work Item) are addressed inside the OMA PSA v1.0 [OMA PSA], which is complementary with respect to NGSI."}]}}