{"input":{"cteatedAt":"2021-02-18T13:19:10.529Z","url":"http://www.openmobilealliance.org/release/SmaC/V1_0-20130813-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SmaC/V1_0-20130813-A/OMA-RD-SmaC-V1_0-20130813-A.pdf","file":"OMA-RD-SmaC-V1_0-20130813-A.pdf","status":"Approved","version":"V1.0","date":"2013-08-13","contentMediaType":"application/pdf","description":"This document defines the requirements for OMA Small Cells Network API V1.0. Small Cells are low-power wireless access points that work in licensed and/or unlicensed spectrum, enabling Mobile Operators and Service Providers to increase their networks’ capacity and quality in a sustainable way. Moreover, Small Cells offer peculiar capabilities that can be exposed, through convenient APIs, to Application Developers, in order to enhance Apps with new functionalities. Such Small Cells’ capabilities include fine-grained indoor localization methods, Terminals’ context-awareness and their seamless integration in Digital Home environments, enablement of Application-driven QoS, resource management and call control; those capabilities are intended to be exposed to authorized Applications – the authorization mechanism requirements are also in-scope."},{"url":"http://www.openmobilealliance.org/release/SmaC/V1_0-20130813-A/OMA-RRELD-SmaC-V1_0-20130813-A.pdf","file":"OMA-RRELD-SmaC-V1_0-20130813-A.pdf","status":"Approved","version":"V1.0","date":"2013-08-13","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of Small Cells Capabilities Exposure 1.0 according to OMA Release process and the Reference Release document baseline listed in section 5. The scope of this release is to define the requirements for Small Cells Capabilities Exposure 1.0."},{"url":"http://www.openmobilealliance.org/release/SmaC/V1_0-20130813-A/OMA-RRP-SmaC-V1_0-20130813-A.zip","file":"OMA-RRP-SmaC-V1_0-20130813-A.zip","status":"Approved","version":"V1.0","date":"2013-08-13","contentMediaType":"application/zip"}]}}