{"input":{"cteatedAt":"2021-02-18T13:02:29.896Z","url":"http://www.openmobilealliance.org/release/REST_NetAPI_RichComms/V1_0-20130416-H/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/REST_NetAPI_RichComms/V1_0-20130416-H/OMA-ERELD-REST_NetAPI_RCSProfile-V1_0-20130416-H.pdf","file":"OMA-ERELD-REST_NetAPI_RCSProfile-V1_0-20130416-H.pdf","status":"Historic","version":"V1.0","date":"2013-04-16","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of the RESTful Network API for Rich Communications version 1.0 according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/REST_NetAPI_RichComms/V1_0-20130416-H/OMA-ERP-REST_NetAPI_RCSProfile-V1_0-20130416-H.zip","file":"OMA-ERP-REST_NetAPI_RCSProfile-V1_0-20130416-H.zip","status":"Historic","version":"V1.0","date":"2013-04-16","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/REST_NetAPI_RichComms/V1_0-20130416-H/OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-H.pdf","file":"OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-H.pdf","status":"Historic","version":"V1.0","date":"2013-04-16","contentMediaType":"application/pdf","description":"This document defines the requirements for OMA RESTful Network APIs in order to expose RCS features to 3rd party developers, more specifically the web 2.0 community hence to create the functional APIs according to the GSMA RCS requirements for the UNI/Long Tail APIs.  OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                             Page                                                                                             6(19)                                                                                              2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] 2.  References 2.1     Normative     References     [RFC2119] “Key words for use in RFCs to Indicate Requirement Levels”, S. Bradner, March 1997, URL:http://www.ietf.org/rfc/rfc2119.txt [RCSREQ] “Rich Communication Suite - RCS API Detailed Requirements 1.1, 17 October 2011”, GSMA Association, 2011, URL:http://www.gsma.com/rcs/wp-content/uploads/2012/03/rcsapirequirementsv11.pdf. 2.2     Informative     References [OMADICT] “Dictionary for OMA Specifications”, Version 2.9, Open Mobile Alliance™, OMA-ORG-Dictionary-V2_9, URL:http://www.openmobilealliance.org/ OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                             Page                                                                                             7(19)                                                                                              2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] 3.  Terminology  and  Conventions  3.1     Conventions     The key words “MUST”, “MUST NOT”, “REQUIRED”, “SHALL”, “SHALL NOT”, “SHOULD”, “SHOULD NOT”, “RECOMMENDED”, “MAY”, and “OPTIONAL” in this document are to be interpreted as described in [RFC2119]. All sections and appendixes, except “Scope” and “Introduction”, are normative, unless they are explicitly indicated to be informative. 3.2     Abbreviations     API Application Programming Interface OMA Open Mobile Alliance RCS Rich Communication Suite REST Representational State Transfer UNI User-to-Network Interface OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                             Page                                                                                             8(19)                                                                                              2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] 4.  Introduction  (Informative)  In order to fully leverage on the GSMA RCS benefits and to support today’s demand for innovative service creation and lightweight UNI interfaces; a set of UNI/long tail APIs targeting the RCS feature set is needed.  4.1     Version     1.0     The RC APIs RD V1.0 captures the functional requirements scoping the set of APIs exposing the GSMA RCS features.  OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                             Page                                                                                             9(19)                                                                                              2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] 5. APIs for Rich Communications release description  (Informative) The RC- APIs V1.0 addresses a crucial field of open service creation based on the rich data.  5.1     End-to-end Service Description The RC- APIs V1.0 addresses the end-to-end service described in [RCSREQ].   OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           10(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] 6.  Requirements  (Normative)  This section captures the requirements for the RC-APIs enabler. The main share of the requirements originates from the GSM Association’s RCS API (Rich Communication Suite) requirements, which are accessible in document [RCSREQ].  The OMA RC-APIs enabler covers these requirements, but is intended to provide a more generic approach to Rich Communication APIs. To model that, this document imports the applicable requirements from [RCSREQ], and defines additional requirements. 6.1     High-Level Functional Requirements This section contains the High Level requirements for the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCHLF-001 This requirement maps to the requirement UNI-HLF-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCHLF-002 This requirement maps to the requirement UNI-HLF-002 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCHLF-003 This requirement maps to the requirement UNI-HLF-003 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCHLF-004 This requirement maps to the requirement UNI-HLF-004 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCHLF-005 This requirement maps to the requirement UNI-HLF-005 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCHLF-006 This requirement maps to the requirement UNI-HLF-006 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCHLF-008 This requirement maps to the requirement UNI-HLF-008 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCHLF-009 This requirement maps to the requirement UNI-HLF-009 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 1: High-Level Functional Requirements - from GSMA RCS In addition, the following requirements apply:   Label Description Release RCAPI-HLF-001 The RC APIs SHOULD reuse existing OMA RESTful Network APIs when they provide similar functionality. RC-APIs 1.0 Table 2: High-Level Functional Requirements 6.1.1   Common notification channel This section contains the requirements for common notification channel functionality of the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCNTF-001 This requirement maps to the requirement UNI-NTF-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNTF-002 This requirement maps to the requirement UNI-NTF-002 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           11(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] RCAPI-RCNTF-003 This requirement maps to the requirement UNI-NTF-003 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNTF-004 This requirement maps to the requirement UNI-NTF-004 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNTF-005 This requirement maps to the requirement UNI-NTF-005 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNTF-006 This requirement maps to the requirement UNI-NTF-006 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNTF-007 This requirement maps to the requirement UNI-NTF-007 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNTF-008 This requirement maps to the requirement UNI-NTF-008 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNTF-009 This requirement maps to the requirement UNI-NTF-009 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 3: Common Notification Channel Functional Requirements – from GSMA RCS  In addition, the following requirements apply:  Label Description Release RCAPI-NTF-001 The RC-APIs MAY support   push technology as an alternative transport for delivering notifications through common notification channel. RC-APIs 1.0 Table 4: Common Notification Channel Functional Requirements 6.1.2      Messaging      This section contains the requirements for the Messaging functionality of the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RC MSG-001 This requirement maps to the requirement UNI-MSG-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RC MSG-002 This requirement maps to the requirement UNI-MSG-002 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RC MSG-003 This requirement maps to the requirement UNI-MSG-003 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 5: Messaging Functional Requirements – from GSMA RCS 6.1.3      Chat      6.1.3.1     Originating     side This section contains the requirements for the originating side of a chat session of the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCCHAT-001 This requirement maps to the requirement UNI-CHT-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-002 This requirement maps to the requirement UNI-CHT-002 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           12(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] RCAPI-RCCHAT-003 This requirement maps to the requirement UNI-CHT-003 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-004 This requirement maps to the requirement UNI-CHT-004 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-005 This requirement maps to the requirement UNI-CHT-005 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-006 This requirement maps to the requirement UNI-CHT-006 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 6: Chat Functional Requirements (originating side) – from GSMA RCS 6.1.3.2     Terminating     side This section contains the requirements for the terminating side of a chat session of the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCCHAT-007 This requirement maps to the requirement UNI-CHT-007 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-008 This requirement maps to the requirement UNI-CHT-008 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-010 This requirement maps to the requirement UNI-CHT-010 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-011 This requirement maps to the requirement UNI-CHT-011 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-012 This requirement maps to the requirement UNI-CHT-012 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 7: Chat Functional Requirements (terminating side) – from GSMA RCS 6.1.3.3     Group     Chat This section contains the requirements for group chat of the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCCHAT-013 This requirement maps to the requirement UNI-CHT-013 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-014 This requirement maps to the requirement UNI-CHT-014 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-015 This requirement maps to the requirement UNI-CHT-015 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-016 This requirement maps to the requirement UNI-CHT-016 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-017 This requirement maps to the requirement UNI-CHT-017 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 8: Chat Functional Requirements (group chat) – from GSMA RCS 6.1.3.4     Media This section contains the requirements for media chat of the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:  OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           13(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I]  Label Description Release RCAPI-RCCHAT-018 This requirement maps to the requirement UNI-CHT-018 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-019 This requirement maps to the requirement UNI-CHT-019 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-020 This requirement maps to the requirement UNI-CHT-020 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCHAT-021 This requirement maps to the requirement UNI-CHT-021 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 9: Chat Functional Requirements (media) – from GSMA RCS 6.1.4      Call      6.1.4.1 Call Functionality available to originating side This section contains the requirements for the call session and call progress notifications on behalf of the originating side (“calling participant”, “A-Party”) functionality of the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCCALL-001 This requirement maps to the requirement UNI-CLL-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCALL-002 This requirement maps to the requirement UNI-CLL-002 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 10: Call Functional Requirements (originating side) – from GSMA RCS 6.1.4.2 Call Functionality available to originating side and terminating side This section contains the requirements for functionality of the RC-APIs enabler, to allow an application to receive call progress notifications and to terminate a call session on behalf of the call participants (“calling participant”, “A-Party” as well as “called participant”, “B-Party”). The term “user” below therefore subsumes both “A-party” as well as “B-party” The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCCALL-003 This requirement maps to the requirement UNI-CLL-003 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCALL-004 This requirement maps to the requirement UNI-CLL-004 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCALL-005 This requirement maps to the requirement UNI-CLL-005 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCALL-006 This requirement maps to the requirement UNI-CLL-006 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCALL-007 This requirement maps to the requirement UNI-CLL-007 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCALL-008 This requirement maps to the requirement UNI-CLL-008 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           14(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] RCAPI-RCCALL-009 This requirement maps to the requirement UNI-CLL-009 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCCALL-010 This requirement maps to the requirement UNI-CLL-010 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 11: Call Functional Requirements (originating and terminating side) – from GSMA RCS 6.1.4.3     Media     Out of scope 6.1.5      Presence      This section contains the requirements for the Presence functionality of the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCPRS-001 This requirement maps to the requirement UNI-PRS-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-002 This requirement maps to the requirement UNI-PRS-002 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-003 This requirement maps to the requirement UNI-PRS-003 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-004 This requirement maps to the requirement UNI-PRS-004 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-005 This requirement maps to the requirement UNI-PRS-005 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-006 This requirement maps to the requirement UNI-PRS-006 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-007 This requirement maps to the requirement UNI-PRS-007 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-008 This requirement maps to the requirement UNI-PRS-008 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-009 This requirement maps to the requirement UNI-PRS-009 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-010 This requirement maps to the requirement UNI-PRS-010 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-011 This requirement maps to the requirement UNI-PRS-011 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-012 This requirement maps to the requirement UNI-PRS-012 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-013 This requirement maps to the requirement UNI-PRS-013 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-014 This requirement maps to the requirement UNI-PRS-014 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCPRS-015 This requirement maps to the requirement UNI-PRS-015 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 12: Presence Functional Requirements – from GSMA RCS OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           15(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] 6.1.6      File      Transfer      This section contains the requirements for the File Transfer functionality of the RC-APIs enabler. 6.1.6.1     Originating     side The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCFT-001 This requirement maps to the requirement UNI-FLT-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCFT-002 This requirement maps to the requirement UNI-FLT-002 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCFT-003 This requirement maps to the requirement UNI-FLT-003 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCFT-004 This requirement maps to the requirement UNI-FLT-004 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 13: File Transfer Functional Requirements (originating side) – from GSMA RCS 6.1.6.2     Terminating     side     The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCFT-005 This requirement maps to the requirement UNI-FLT-005 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCFT-006 This requirement maps to the requirement UNI-FLT-006 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCFT-007 This requirement maps to the requirement UNI-FLT-007 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCFT-008 This requirement maps to the requirement UNI-FLT-008 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCFT-009 This requirement maps to the requirement UNI-FLT-009 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCFT-010 This requirement maps to the requirement UNI-FLT-010 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 14: File Transfer Functional Requirements (terminating side) – from GSMA RCS 6.1.7      Image      Share      This section contains the requirements for the Image Share functionality of the RC-APIs enabler. 6.1.7.1 Image Share functionality available to originating side The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCIS-001 This requirement maps to the requirement UNI-ISH-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCIS-002 This requirement maps to the requirement UNI-ISH-004 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           16(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] RCAPI-RCIS-003 This requirement maps to the requirement UNI-ISH-005 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCIS-004 This requirement maps to the requirement UNI-ISH-006 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 15: Image Share Functional Requirements (originating side) – from GSMA RCS 6.1.7.2 Image Share functionality available to terminating side  The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCIS-005 This requirement maps to the requirement UNI-ISH-007 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCIS-006 VOID                                                                                                                                 VOID                                                                                                                                 RCAPI-RCIS-007 This requirement maps to the requirement UNI-ISH-009 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCIS-008 This requirement maps to the requirement UNI-ISH-010 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCIS-009 This requirement maps to the requirement UNI-ISH-011 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCIS-010 This requirement maps to the requirement UNI-ISH-012 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 16: Image Share Functional Requirements (terminating side) – from GSMA RCS 6.1.8      Video      Share      This section contains the requirements for the Video Share functionality of the RC-APIs enabler. 6.1.8.1 Video Share functionalities available to originating side The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCVS-001 This requirement maps to the requirement UNI-VSH-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCVS-001b This requirement maps to the requirement UNI-VSH-001b from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCVS-002 VOID                                                                                                                                 VOID                                                                                                                                 RCAPI-RCVS-003 VOID                                                                                                                                 VOID                                                                                                                                 RCAPI-RCVS-004 This requirement maps to the requirement UNI-VSH-004 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCVS-005 This requirement maps to the requirement UNI-VSH-005 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCVS-006 This requirement maps to the requirement UNI-VSH-006 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 17: Video Share Functional Requirements (originating side) – from GSMA RCS OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           17(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] 6.1.8.2 Video Share functionalities available to terminating side The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCVS-007 This requirement maps to the requirement UNI-VSH-007 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCVS-008 VOID                                                                                                                                 VOID                                                                                                                                 RCAPI-RCVS-009 This requirement maps to the requirement UNI-VSH-009 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCVS-009b This requirement maps to the requirement UNI-VSH-009b from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCVS-010 This requirement maps to the requirement UNI-VSH-010 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCVS-011 This requirement maps to the requirement UNI-VSH-011 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 18: Video Share Functional Requirements (terminating side) – from GSMA RCS 6.1.8.3 Video Share Media Out of scope. 6.1.9      Network      Address      Book      This section contains the requirements for the Network Address Book functionality of the RC-APIs enabler. The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCNAB-001 This requirement maps to the requirement UNI-NAB-001 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNAB-002 This requirement maps to the requirement UNI-NAB-002 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNAB-003 This requirement maps to the requirement UNI-NAB-003 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNAB-004 This requirement maps to the requirement UNI-NAB-004 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNAB-005 This requirement maps to the requirement UNI-NAB-005 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 RCAPI-RCNAB-006 This requirement maps to the requirement UNI-NAB-006 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 19: Network Address Book Functional Requirements – from GSMA RCS  6.1.10    Security    It is expected to be possible for a service provider to deploy developer security mechanisms and engagement/registration processes aimed to individual developers. Developer security mechanisms are out of the scope of this document, and therefore out-of-scope for RC-APIs. 6.1.10.1   Authentication   Application authentication and User authentication are out of scope. OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           18(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] 6.1.10.2   Authorization   The following requirements from [RCSREQ] apply to this enabler:   Label Description Release RCAPI-RCHLFAutho-001 This requirement maps to the requirement UNI-HLF-007 from GSMA RCS document [RCSREQ]. RC-APIs 1.0 Table 20: High-Level Functional Requirements – Authorization Items – from GSMA RCS 6.1.10.3   Data   Integrity   Data Integrity is out of scope. 6.1.10.4   Confidentiality   Confidentiality is out of scope. 6.1.11    Charging    Events    Charging events are out of scope. 6.1.12    Administration and Configuration Administration and configuration are out of scope. 6.1.13    Usability    Usability is out of scope. 6.1.14    Interoperability    Not applicable. 6.1.15    Privacy    Privacy is out of scope. 6.2     Overall     System     Requirements     Overall system requirements are out of scope.  OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A                                                                                           Page                                                                                           19(19)                                                                                            2013 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20130101-I] Appendix A. Change History (Informative) A.1    Approved Version History Reference Date Description OMA-RD-REST_NetAPI_RCSProfile-V1_0-20130416-A 16 Apr 2013 Status changed to Approved by TP TP Ref # OMA-TP-2013-0103-INP_RC_APIs_V1_0_ERP_for_Final_Approval"},{"url":"http://www.openmobilealliance.org/release/REST_NetAPI_RichComms/V1_0-20130416-H/OMA-TS-REST_NetAPI_RCSProfile-V1_0-20130416-H.pdf","file":"OMA-TS-REST_NetAPI_RCSProfile-V1_0-20130416-H.pdf","status":"Historic","version":"V1.0","date":"2013-04-16","contentMediaType":"application/pdf","description":"This specification provides the RCS profile of RESTful Network APIs.  The RCS profile of RESTful Network APIs specifies a subset of the existing OMA RESTful Network APIs. This specification contains tables with information on what operations are mandated in the profile that MUST be implemented in order to claim conformance with the profile.  The GSMA RCS project is addressing deployment and operational considerations for 3rd party applications, and is re-using a subset of the OMA RESTful Network APIs for this. It aims to reduce the effort and time needed to create applications and content that is portable across mobile operators."}]}}