{"input":{"cteatedAt":"2021-02-18T12:33:36.035Z","url":"http://www.openmobilealliance.org/release/OSE/V1_0-20070313-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/OSE/V1_0-20070313-C/OMA-AD-Service_Environment-V1_0_4-20070201-A.pdf","file":"OMA-AD-Service_Environment-V1_0_4-20070201-A.pdf","status":"Approved","version":"V1.0.4","date":"2007-02-01","contentMediaType":"application/pdf","description":"This document describes the OMA Service Environment (OSE), which is a flexible and extensible architecture that offers support to a diverse group of application developers and Service Providers. The primary intention of the OSE is to promote common architectural principles, across the whole of OMA, for how OMA Enablers are specified and how they interact with one another whilst ensuring architecture integrity, scalability and interoperability, all of which strive to reduce Architecture silo design and hence reduce integration and deployment complexities. This document includes the following information: •A high-level description of the OMA Service Environment including its concepts and entities; •A migration path between existing and future enabler activities within the OMA; •A description of how OMA enablers interact with one another, for example, to support the creation and delivery of widely accessible coherent end-user services."},{"url":"http://www.openmobilealliance.org/release/OSE/V1_0-20070313-C/OMA-RD-Architecture-V1_0_2-20070202-A.pdf","file":"OMA-RD-Architecture-V1_0_2-20070202-A.pdf","status":"Approved","version":"V1.0.2","date":"2007-02-02","contentMediaType":"application/pdf","description":"This document describes the requirements on the OMA Service Environment [Error! Reference source not found.]. The requirements in this document have been gathered from a number of different sources, and amalgamated to a common format. They have not always been designed from use cases formally designed according to the template in this document."},{"url":"http://www.openmobilealliance.org/release/OSE/V1_0-20070313-C/OMA-RRELD-OSE-V1_0-20070313-C.pdf","file":"OMA-RRELD-OSE-V1_0-20070313-C.pdf","status":"Candidate","version":"V1.0","date":"2007-03-13","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of OMA Service Environment (OSE) V1.0 according to OMA Release process and the Reference Release document baseline listed in section 6."},{"url":"http://www.openmobilealliance.org/release/OSE/V1_0-20070313-C/OMA-RRP-OSE-V1_0-20070313-C.zip","file":"OMA-RRP-OSE-V1_0-20070313-C.zip","status":"Candidate","version":"V1.0","date":"2007-03-13","contentMediaType":"application/zip"}]}}