{"input":{"cteatedAt":"2021-02-17T22:15:22.160Z","url":"http://www.openmobilealliance.org/release/IMF/V1_0-20050202-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/IMF/V1_0-20050202-C/OMA-RD-Identity_Management_Framework-V1_0-20050202-C.pdf","file":"OMA-RD-Identity_Management_Framework-V1_0-20050202-C.pdf","status":"Candidate","version":"V1.0","date":"2005-02-02","contentMediaType":"application/pdf","description":"The intention of this Requirements Document is to tie together all existing efforts relating to Identity within the OMA in order to create a single Identity Management (IdM) enabler to be used by all OMA enablers. This document sets requirements for all technical working groups of OMA, and all Identity Management related functions should be satisfied according to the resulting enabler. The benefits of a single Identity Management enabler for all OMA enablers are: -Management and use of Identity or personal information is easier for all stakeholders: End Users, mobile operators, enterprises and Service Providers; -End Users do not have the burden of having to understand different service-specific Identity solutions; -The same Identities and personal information can be utilised by multiple services; -Privacy protection can be enabled more easily using a common Identity Management enabler; -The OMA will not be seen to publish specifications with disparate, conflicting Identity Management solutions; -Identity needs are the same (or very similar) for all enablers and so, by creating a single Identity Management enabler, duplication of work is kept to a minimum; -New enablers with Identity requirements will be able to benefit from the existing Identity Management enabler; -Greater interoperability between enablers; -Improved time to market for those enablers that use the Identity Management enabler. There are also additional benefits if existing, standardised Authentication / Authorisation methods can be re-used in an Identity Management enabler. One such example is mobile operator subscription-based Identity: -Mobile operators already have an excellent trust relationship with millions of End Users due to their high level of security; -Mobile operators can offer services of their own, or third party services, with improved Authentication and privacy protection by using IDP and Identity Broker models; -Mobile operators can offer content Service Providers simple, event-based billing services suitable for low-value transactions. Therefore a key overall requirement for the OMA Identity Management enabler is to enable (at least) the use of existing mobile operator Identity solutions for Authentication and End User Authorisation (e.g. the use of SIM Smart Cards, R-UIM Smart Cards and IS41 software solutions, depending on prioritisation). This Requirements Document includes in its scope the following types of Identities: •End User Identity: relating to the provisioning of and access to End User Identity information and related Attributes in the mobile operator, Service Provider, enterprise infrastructures and in the Device. This includes the management (e.g. conflict resolution) of several simultaneous Identities (for one End User) that enable multiple End User profiles, such as employee and a private customer profiles. Delegation and sharing of authority is also included in scope in order to enable the role of an intermediary Agent (e.g. for some enterprise situations). •Provider Identity: for Authentication and to support delegation of authority. •Device Identity: to enable topics such as digital rights management, for example. •Application / Service Identity: to identify enterprise applications, for example, or enable the use of Identity Containers. It should be noted that all OMA work is contribution driven, so it is always necessary to prioritise topics in terms of which are specified within the initial phase of work, and which are listed as requirements for a future specification phase."}]}}