{"input":{"cteatedAt":"2021-02-17T21:43:59.467Z","url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20071211-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20071211-C/OMA-RD-CBCS-V1_0-20071211-C.pdf","file":"OMA-RD-CBCS-V1_0-20071211-C.pdf","status":"Candidate","version":"V1.0","date":"2007-12-11","contentMediaType":"application/pdf","description":"The Categorization Based Content Screening (CBCS) Enabler specifies the interfaces between actors so as to apply Content Screening to content based on content categorization and Screening Rules.   The CBCS Enabler shall be applicable to any content delivery Enabler or protocol and intentionally does not restrict the definition of “content”, which allows the Enabler to apply Content Screening to practically any information communicated by/to a User.  The following functions are considered to be in scopefor the CBCS Enabler specification: •Blocking of any kind of content considered “undesirable” for a certain CBCS User according to the Screening Criteria used, including illegal content, unsolicited content, malicious content and inappropriate content. •Customer-facing warnings: these are words or symbols that are actually part of the content presented to CBCS Users such as a symbol in the corner of the screen, an announcement before a programme starts or a form of words on screen. •Screening of previously categorized content: in this case the Content Category is defined by content meta-data that is either encoded as part of the content format, or can be requested from an external source. •Screening of not previously categorized content. •Screening of content from Content Providers with whom the CBCS Service Provider has a trusted relationship, and of content from Content Providers with whom the CBCS Service Provider does not have a trusted relationship. •Screening of content sent from a Content Provider to a CBCS User, from a CBCS User to another User, or from a CBCS User to a server (including the screening of subscriptions to content and screening of service requests) The following items have been considered to be out of scopefor the CBCS Enabler specification: •The definition or standardization of specific content categorization schemes. •The definition or standarization of the rules used to categorize content. •The mechanisms by which the Content Screening Authority can communicate Screening Rules to the CBCS Service Provider •The specification or standardization of specific Screening Criteria. •The specification or standardization of algorithms or methods for the syntactic or semantic analysis of content. •Deployment policies for CBCS Service Providers, including which categorization schemes to apply and how, how to define permissions for CBCS Subscribers and CBCS Users, etc."}]}}