{"input":{"cteatedAt":"2021-02-17T21:44:31.712Z","url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20111206-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20111206-A/OMA-AD-CBCS-V1_0-20111206-A.pdf","file":"OMA-AD-CBCS-V1_0-20111206-A.pdf","status":"Approved","version":"V1.0","date":"2011-12-06","contentMediaType":"application/pdf","description":"This document provides the architecture for the Categorization Based Content Screening (CBCS) Enabler of OMA.  The objective of the Categorization Based Content Screening (CBCS) Enabler is to apply Screening Rules before delivering Content to the mobile user, using Content categorization.  A Content Category qualifies the type of Content, according to a categorization scheme. The CBCS Enabler can obtain the Content Category for a given piece of Content from a Categorization Entity, or from the Content itself. There are two usage patterns for the CBCS Enabler.  In the first pattern, the CBCS Enabler applies Screening Rules whenever a Resource makes a Content request or reply. In the second pattern, a Resource explicitly solicits Content Screening from the CBCS Enabler. The architecture shown in this document is intended to facilitate the development of specifications for obtaining Content Categories and for defining, managing, evaluating, and enforcing Screening Rules in a way that is scalable and flexible yet independent of any specific implementation scheme.  Note that this Enabler does not specify individual Screening Rules, but rather addresses requirements on how to express Screening Rules.  The specification of categorization schemes, CBCS User interaction (such as customer facing warnings and requests for consent), CBCS User Profile, pattern matching techniques and delegation of management rights also falls out of the scope of the Enabler specification."},{"url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20111206-A/OMA-ERELD-CBCS-V1_0-20111206-A.pdf","file":"OMA-ERELD-CBCS-V1_0-20111206-A.pdf","status":"Approved","version":"V1.0","date":"2011-12-06","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of CBCS (Categorization Based Content Screening) according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20111206-A/OMA-ERP-CBCS-V1_0-20111206-A-pdf.zip","file":"OMA-ERP-CBCS-V1_0-20111206-A-pdf.zip","status":"","version":"","date":"","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20111206-A/OMA-RD-CBCS-V1_0-20111206-A.pdf","file":"OMA-RD-CBCS-V1_0-20111206-A.pdf","status":"Approved","version":"V1.0","date":"2011-12-06","contentMediaType":"application/pdf","description":"The Categorization Based Content Screening (CBCS) Enabler specifies the interfaces between actors so as to apply Content Screening to content based on content categorization and Screening Rules.   The CBCS Enabler shall be applicable to any content delivery Enabler or protocol and intentionally does not restrict the definition of “content”, which allows the Enabler to apply Content Screening to practically any information communicated by/to a User.  The following functions are considered to be in scope for the CBCS Enabler specification:  Blocking of any kind of content considered “undesirable” for a certain CBCS User according to the Screening Criteria used, including illegal content, unsolicited content, malicious content and inappropriate content.  Customer-facing warnings: these are words or symbols that are actually part of the content presented to CBCS Users such as a symbol in the corner of the screen, an announcement before a programme starts or a form of words on screen.  Screening of previously categorized content: in this case the Content Category is defined by content meta-data that is either encoded as part of the content format, or can be requested from an external source.  Screening of not previously categorized content.  Screening of content from Content Providers with whom the CBCS Service Provider has a trusted relationship, and of content from Content Providers with whom the CBCS Service Provider does not have a trusted relationship.  Screening of content sent from a Content Provider to a CBCS User, from a CBCS User to another User, or from a CBCS User to a server (including the screening of subscriptions to content and screening of service requests) The following items have been considered to be out of scope for the CBCS Enabler specification:  The definition or standardization of specific content categorization schemes.  The definition or standarization of the rules used to categorize content.  The mechanisms by which the Content Screening Authority can communicate Screening Rules to the CBCS Service Provider  The specification or standardization of specific Screening Criteria.  The specification or standardization of algorithms or methods for the syntactic or semantic analysis of content.  Deployment policies for CBCS Service Providers, including which categorization schemes to apply and how, how to define permissions for CBCS Subscribers and CBCS Users, etc."},{"url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20111206-A/OMA-SUP-XSD_cbcs_pem1InputTemplate-V1_0-20111206-A.txt","file":"OMA-SUP-XSD_cbcs_pem1InputTemplate-V1_0-20111206-A.txt","status":"Approved","version":"V1.0","date":"2011-12-06","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20111206-A/OMA-SUP-XSD_cbcs_pem1OutputTemplate-V1_0-20111206-A.txt","file":"OMA-SUP-XSD_cbcs_pem1OutputTemplate-V1_0-20111206-A.txt","status":"Approved","version":"V1.0","date":"2011-12-06","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/CBCS/V1_0-20111206-A/OMA-TS-CBCS-V1_0-20111206-A.pdf","file":"OMA-TS-CBCS-V1_0-20111206-A.pdf","status":"Approved","version":"V1.0","date":"2011-12-06","contentMediaType":"application/pdf","description":"This document represents the complete Technical Specification of the Categorization Based Content Screening (CBCS) 1.0 Enabler of the Open Mobile Alliance™, and contains specifications of the CBCS.PEM-1, CBCS.PEM-2, CBCS-1, CBCS-2 and CBCS-3 interfaces described in the CBCS Architecture Document [CBCS-AD]. The following items are within the scope of this Technical Specification of the CBCS 1.0 Enabler:  A CBCS template for the PEM-1 interface [PEM1-TS] to create CBCS.PEM-1.  Guidelines for the use of the CBCS.PEM-2 [PEM2-TS] interface and PEL [PEL-TS] in the CBCS Enabler.  The specification of messages to be exchanged over the CBCS-1, CBCS-2 and CBCS-3 interfaces [CBCS-AD].  A mapping of the CBCS-1 and CBCS-3 messages onto ICAP protocol messages [RFC3507].  Guidelines for the use of meta-data standards for Pre-Categorized Content.  The definition of a standard format for Pre-Categorized Content that contains its Content Category (or Content Categories) as meta-data. The following items fall outside the scope of this Technical Specification of the CBCS 1.0 Enabler:  The specification of the messages to be exchanged between the CBCS Enabler and other enablers to enforce Screening Rules when the CBCS Enabler is used in Proxy Usage Pattern [CBCS-AD].  The specification of messages to be exchanged with Other Resources [CBCS-AD].  The specification of the CBCS User Profile.  The specification of specific Screening Rules or Content Categorization Rules.  The standardization of specific Content Categories or categorization schemes.  The specification of specific Content categorization methods and algorithms, and pattern matching techniques.  CBCS User interaction mechanisms (such as customer facing warnings and requests for consent).  Delegation of management rights. This Technical Specification defines the CBCS 1.0 interfaces in Augmented Backus Naur Form (ABNF) [RFC4234], with the exception of the CBCS.PEM-1 and CBCS.PEM-2 interfaces based on PEM-1 [PEM1-TS] and PEM-2 [PEM2-TS] respectively, which are defined as XML Schema."}]}}