{"input":{"cteatedAt":"2021-02-18T12:41:12.842Z","url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-AD-Policy_Evaluation_Enforcement_Management-V1_0-20080805-C.pdf","file":"OMA-AD-Policy_Evaluation_Enforcement_Management-V1_0-20080805-C.pdf","status":"Candidate","version":"V1.0","date":"2008-08-05","contentMediaType":"application/pdf","description":"This document provides the architecture for the Policy Evaluation, Enforcement and Management (PEEM) enabler of OMA. The PEEM enabler evaluates and/or enforces policies. Policies are applied to requests to, or responses from resources or, when explicitly called by a resource. The architecture shown in this document is intended to facilitate the development of specifications for defining, managing, evaluating, and enforcing policies in a way that is scalable and flexible yet independent of any specific implementation scheme. Additionally, the architecture enables reuse by other enablers so that their requirements are satisfied. Note also that this enabler does not specify individual policies, but rather addresses requirements on how to express policies."},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-ERELD-PEEM-V1_0-20090715-C.pdf","file":"OMA-ERELD-PEEM-V1_0-20090715-C.pdf","status":"Candidate","version":"V1.0","date":"2009-07-15","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of PEEM (Policy Evaluation, Endorcement and Management) according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-ERP-PEEM-V1_0-20090715-C.zip","file":"OMA-ERP-PEEM-V1_0-20090715-C.zip","status":"Candidate","version":"V1.0","date":"2009-07-15","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-RD-Policy_Evaluation_Enforcement_Management-V1_0-20080805-C.pdf","file":"OMA-RD-Policy_Evaluation_Enforcement_Management-V1_0-20080805-C.pdf","status":"Candidate","version":"V1.0","date":"2008-08-05","contentMediaType":"application/pdf","description":"This document provides use cases and requirements for policy evaluation, enforcement and management, (PEEM) within OMA.  The PEEM enabler evaluates, (or evaluates and executes) policies. Policies are applied to requests to, or responses from resources or, when explicitly called by a resource. The requirements in this document are intended to facilitate the development of a set of specifications for defining, exposing, managing, evaluating, and executing policies in a way that is scalable and flexible yet independent of any specific implementation scheme.  Tools to translate enabler specific local policies into the language specified by PEEM may be needed but are out of scope of the PEEM specification. Note also that this RD does not specify individual policies, but rather addresses requirements on how to express policies."},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-SUP-WSDL-PEM_1_faults-V1_0-20080805-C.txt","file":"OMA-SUP-WSDL-PEM_1_faults-V1_0-20080805-C.txt","status":"Candidate","version":"V1.0","date":"2008-08-05","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-SUP-WSDL-PEM_1_REQ-V1_0-20080805-C.txt","file":"OMA-SUP-WSDL-PEM_1_REQ-V1_0-20080805-C.txt","status":"Candidate","version":"V1.0","date":"2008-08-05","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-SUP-WSDL-PEM_1_RSP-V1_0-20080805-C.txt","file":"OMA-SUP-WSDL-PEM_1_RSP-V1_0-20080805-C.txt","status":"Candidate","version":"V1.0","date":"2008-08-05","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-SUP-XSD_PEM_1_GenericInputTemplateData-V1_0-20090715-C.txt","file":"OMA-SUP-XSD_PEM_1_GenericInputTemplateData-V1_0-20090715-C.txt","status":"Candidate","version":"V1.0","date":"2009-07-15","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-SUP-XSD_PEM_1_GenericOutputTemplateData-V1_0-20090715-C.txt","file":"OMA-SUP-XSD_PEM_1_GenericOutputTemplateData-V1_0-20090715-C.txt","status":"Candidate","version":"V1.0","date":"2009-07-15","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-TS-PEEM_PEL-V1_0-20080805-C.pdf","file":"OMA-TS-PEEM_PEL-V1_0-20080805-C.pdf","status":"Candidate","version":"V1.0","date":"2008-08-05","contentMediaType":"application/pdf","description":"This document provides the Policy Expression Language (PEL) specification, one of several specifications of the Policy Evaluation,Enforcement and Management (PEEM) enabler.  The PEL specification defines the language in which policies can be expressed. The PEL specification includes the definition of language constructs, and defines multiple language options, for the convenience of resolving particular issues. The PEL specification is loosely coupled to other PEEM specifications and therefore can evolve relatively independent of them (see Introduction section for details). While PEL supports the expression of any policy, specific policies expressed in PEL are out-of-scope for the PEL specification."},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-TS-PEEM_PEM1-V1_0-20090715-C.pdf","file":"OMA-TS-PEEM_PEM1-V1_0-20090715-C.pdf","status":"Candidate","version":"V1.0","date":"2009-07-15","contentMediaType":"application/pdf","description":"This document provides the PEEM enabler specification that defines the PEEM interface for requesting PEEM policy processing (PEM-1). The specification supports any kind of input/output needed by the policy, and in addition it describes generic data formats of the interface, PEEM specific input/output parameters , detailed message flows, and mapping of generic data format and message flows to selected protocols. While this specification fully defines the PEM-1 interface, this interface is extensible in the sense that it may be enhanced to support additional input/output parameters defined in other enablers, which plan to re-use the PEM-1 interface specification for their specific purposes. The PEM-1 interface may also be extended outside the OMA, through vendors’ and/or Service Providers’ customization. Because such extensibility may result in both mandatory and optional parameters, a Service Provider may be expected to store, publish and/or advertise the details of the supported PEM-1 interface, so that entities that request policy processing know what is expected of them; however, mechanisms for storing, publishing and/or advertising the supported PEM-1 specification options are out-of-scope for the PEM-1 specification. Finally, it is also out-of-scope for the PEM-1 specification to define how PEM-1 input parameters are processed by a PEEM enabler implementation, or how PEM-1 output parameters are processed by a resource that requested PEEM policy processing."},{"url":"http://www.openmobilealliance.org/release/PEEM/V1_0-20090715-C/OMA-TS-PEEM_PEM2-V1_0-20081014-C.pdf","file":"OMA-TS-PEEM_PEM2-V1_0-20081014-C.pdf","status":"Candidate","version":"V1.0","date":"2008-10-14","contentMediaType":"application/pdf","description":"This document describes the Policy Management interface (PEM-2) specification, and is part of a group of documents defining the Policy Evaluation, Enforcement and Management (PEEM) enabler specifications. The PEM-2 interface is used by other resources (management requestors) to make a request for policy management, where Policy Management is the act of creating, updating, deleting, and viewing policies. The specification is extensible, in the sense that other operations may be added, if required in support of specific policies defined by other enabler releases. The PEM-2 specification is loosely coupled with the Policy Expression Language (PEL) specification, in the sense that PEM-2 needs to support management operations for policies written using PEL specification. PEM-2 is independent of the PEM-1 specification."}]}}