{"input":{"cteatedAt":"2021-02-18T13:04:58.417Z","url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-AD-SCE-V1_0-20081209-C.pdf","file":"OMA-AD-SCE-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"The scope of this document is to define the architecture for enhancements to the OMA Digital Rights Management (DRM) specifications to enable the secure exchange of DRM -protected content among multiple devices.  These enhancements include the following: o The definition of a centralized domain management function, such that users do not have to manage domains for each source of Rights for a domain o The definition of an Import function that will allow content protected by non-OMA DRM mechanisms to be consumed by OMA DRM devices.  Together with the Export function defined in OMA DRM V2.0, the Import function will make it possible for OMA DRM devices to securely exchange content with non-OMA DRM devices. o The definition of a Move function that will allow Rights to be moved from one DRM Agent to another DRM Agent, either directly between two Devices or via a Rights Issuer. Move can be the complete Rights or a subset of the remaining Rights (Partial Rights). o The concept of Ad Hoc Sharing that allows Users to exchange Rights (and thus use shared Protected Content) in an ad hoc manner (as permitted by the Rights Issuer). o Allow a Device to request from the Rights Issuer the permission to Share Rights, in the case where the User's existing Rights do not explicitly permit Sharing.  2.  References 2.1     Normative References None 2.2     Informative References [DRM-v2] OMA DRM V2 Enabler, Open Mobile Alliance™, OMA-ERP-DRM-V2_0-20060303-A, http://www.openmobilealliance.org/ [DRMARCH-v2.1] “DRM Architecture”, Open Mobile Alliance™, OMA-AD-DRM-V2_1, http://www.openmobilealliance.org/ [SCE-RD] “Secure  Content Exchange Requirements”, Open Mobile Alliance, OMA-RD-SCE-V1_0, http://www.openmobilealliance.org/  [OMNA] “Open Mobile Naming Authority”, Open Mobile Alliance, http://www.openmobilealliance.org/tech/omna/index.htm [OCSP-MP] OMA Online Certificate Status Protocol (profile of [OCSP]) V 1.0, http://www.openmobilealliance.org/"},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-ERELD-SCE-V1_0-20081209-C.pdf","file":"OMA-ERELD-SCE-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Secure Content Exchange 1.0 according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-ERP-SCE-V1_0-20081209-C.zip","file":"OMA-ERP-SCE-V1_0-20081209-C.zip","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-RD-SCE-V1_0-20081209-C.pdf","file":"OMA-RD-SCE-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"The scope of this document is to define use cases and normative requirements for enhancements to the OMA Digital Rights Management (DRM) specifications to enable the secure exchange of DRM content among multiple devices.  These enhancements include the following: • New capabilities that will enable flexible sharing of purchased content in ways that were not possible using Domains as  defined  in  OMA  DRM  V2.0.    These  new  features  include  device-based  creation  and  management  of  content sharing groups; copying and moving of rights between OMA DRM devices; and sharing between devices in ad hoc groups. • The  definition  of  an  Import  function  that  will  allow  content  protected  by  non-OMA  DRM  mechanisms  to  be consumed  by  OMA  DRM  devices.    Together  with  the  Export  function  defined  in  OMA  DRM  V2.0,  the  Import function will make it possible for OMA DRM devices to securely exchange content with non-OMA DRM devices. • Enhancements  to  the  OMA  Digital  Rights  Management  (DRM)  specifications  to  enable  consumption  of  DRM Content contained in an MPEG-2 Transport Stream across a wide variety of user Devices.."},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-SUP-XSD_SCE_DOM-V1_0-20081209-C.xsd","file":"OMA-SUP-XSD_SCE_DOM-V1_0-20081209-C.xsd","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-SUP-XSD_SCE_GEN-V1_0-20081209-C.xsd","file":"OMA-SUP-XSD_SCE_GEN-V1_0-20081209-C.xsd","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-SUP-XSD_SCE_LRM-V1_0-20081209-C.xsd","file":"OMA-SUP-XSD_SCE_LRM-V1_0-20081209-C.xsd","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-SUP-XSD_SCE_REL_DD-V1_0-20081209-C.xsd","file":"OMA-SUP-XSD_SCE_REL_DD-V1_0-20081209-C.xsd","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-SUP-XSD_SCE_REL_EX-V1_0-20081209-C.xsd","file":"OMA-SUP-XSD_SCE_REL_EX-V1_0-20081209-C.xsd","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-SUP-XSD_SCE_REL_ODD-V1_0-20081209-C.xsd","file":"OMA-SUP-XSD_SCE_REL_ODD-V1_0-20081209-C.xsd","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-SUP-XSD_SCE_ROAP-V1_0-20081209-C.xsd","file":"OMA-SUP-XSD_SCE_ROAP-V1_0-20081209-C.xsd","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-TS-SCE_A2A-V1_0-20081209-C.pdf","file":"OMA-TS-SCE_A2A-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks1.  The scope of OMA “Digital Rights Management” (DRM) is to enable the distribution and consumption of digital content in a controlled manner. The content is distributed and consumed on authenticated devices per the usage rights expressed by the content owners. OMA DRM work addresses the various technical aspects of this system by providing appropriate specifications for content formats, protocols, and a rights expression language. A number of DRM specifications have already been defined within the OMA. The latest accepted release of the OMA DRM enabler ([DRM-v2.1], including [DRM-DRM-v2.1], [DRM-DCF-v2.1], [DRM-REL-v2.1]), is referred to within this document as “OMA DRM 2.1”. The scope of this specification is to define the mechanisms and protocols necessary to implement the moving and sharing of content (via the appropriate rights), as required per [SCE-RD]. Specifically, this document specifies the interface SCE-7-A2AP as defined in [SCE-AD] and thus limited to communications between a DRM Requester and a DRM Agent (that has implemented this specification).  1.1     Content vs. Rights The reader should be aware that the terms “content” and “rights” are sometimes used interchangeably. However, it should be clarified that what is really being moved or shared is the rights which control the use of a particular content. In OMA DRM, a particular content is encrypted in a file and can only be rendered if the corresponding rights object is available to the Device. Since the content file is encrypted and hence protected, the movement or transfer of content files ([DRM-DCF-v2.1]) is outside the scope of DRM.                                                                1 Although many of the mechanisms can be applied to wired communication networks, including this specification."},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-TS-SCE_DOM-V1_0-20081209-C.pdf","file":"OMA-TS-SCE_DOM-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks.  The scope of OMA “Digital Rights Management” (DRM) is to enable the distribution and consumption of digital content in a controlled manner. The content is distributed and consumed on authenticated Devices per the usage rights expressed by the content owners. OMA DRM work addresses the various technical aspects of this system by providing appropriate specifications for content formats, protocols, and a rights expression language. A number of DRM specifications have already been defined within the OMA. The latest accepted release of the OMA DRM enabler ([DRM-v2.1], including [DRM-DRM-v2.1], [DRM-DCF-v2.1], [DRM-REL-v2.1]), is referred to within this document as “OMA DRM v2.1”. This specification defines the mechanisms and protocols necessary to implement a central domain management function, as required per [SCE-RD]. More specifically, this specification will specify the interfaces SCE-2-DMP and SCE-3-RDP as defined in [SCE-AD]."},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-TS-SCE_DRM-V1_0-20081209-C.pdf","file":"OMA-TS-SCE_DRM-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks.  The scope of OMA “Digital Rights Management” (DRM) is to enable the distribution and consumption of digital content in a controlled manner. The content is distributed and consumed on authenticated Devices per the usage rights expressed by the content owners. OMA DRM work addresses the various technical aspects of this system by providing appropriate specifications for content formats, protocols, and a rights expression language. A number of DRM specifications have already been defined within the OMA. The latest approved release of the OMA DRM enabler ([DRM-v2.1], including [DRM-DRM-v2.1], [DRM-DCF-v2.1], [DRM-REL-v2.1]), is referred to within this document as “OMA DRM 2.1”. This specification defines the ROAP protocol suite extensions necessary to implement necessary functions, as required per [SCE-RD]. More specifically, this specification will specify the interface SCE-1-ROAP as defined in [SCE-AD]."},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-TS-SCE_GEN-V1_0-20081209-C.pdf","file":"OMA-TS-SCE_GEN-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks.  The scope of OMA “Digital Rights Management” (DRM) is to enable the distribution and consumption of digital content in a controlled manner. The content is distributed and consumed on authenticated devices per the usage rights expressed by the content owners. OMA DRM work addresses the various technical aspects of this system by providing appropriate specifications for content formats, protocols, and a rights expression language. This specification defines the generic mechanisms that are shared by the various specification documents that consititute the SCE enabler."},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-TS-SCE_LRM-V1_0-20081209-C.pdf","file":"OMA-TS-SCE_LRM-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks. The scope of OMA Secure Content Exchange (SCE) is to enhance the OMA Digital Rights Management v2.1  [DRM-DRM-v2.1] specifications to enable the secure exchange of DRM Content among multiple devices. These enhancements include the following: •••• New capabilities that enable flexible sharing of purchased content in ways that were not possible using Domains as defined in OMA DRM v2.1. These new features include Copy and Move of Rights between Devices, Lending and Sharing in an ad hoc manner. •••• Extension of the OMA DRM v2.1 Domain concept to the User Domain concept, which allows different Rights Issuers to generate Rights Objects for the same User Domain. •••• The definition of the Import function allows content protected by Non-OMA DRM mechanisms to be consumed by SCE Devices. Together with the Export function from OMA DRM v2.1, the Import function allows OMA SCE Devices to securely exchange content with Non-OMA DRM devices. •••• Enhancements to the OMA DRM specifications to enable consumption of DRM Content contained in an MPEG-2 Transport Stream across a wide variety of user Devices. This document specifies the Local Rights Manager (LRM), which is used for the conversion of Non-OMA DRM protected content to OMA DRM protected content."},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-TS-SCE_MDCF-V1_0-20081209-C.pdf","file":"OMA-TS-SCE_MDCF-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks.  The scope of OMA “Digital Rights Management” (DRM) is to enable the distribution and consumption of digital content in a controlled manner. The content is distributed and consumed on authenticated Devices per the usage rights expressed by the content owners. OMA DRM work addresses the various technical aspects of this system by providing appropriate specifications for content formats, protocols, and a rights expression language. A number of DRM specifications have already been defined within the OMA. The latest approved release of the OMA DRM enabler ([OMADRM20], including [DRMDRM20], [DRMDCF20], [DRMREL20]), is referred to within this document as “OMA DRM 2.0”. The scope for this specification is to extend the OMA DRM specification to allow for distribution of OMA DRM protected content and associated metadata contained in an MPEG-2 transport stream. For this purpose this specification defines a specific DRM Content Format profile, called MDCF. Release 2 of the “Digital Rights Management” specification [DRM-v2] specifies the DCF and PDCF formats which are both derived from the ISO File Format. The MDCF format is not derived from the ISO File Format, but instead based on MPEG2 Transport Streams.. The delivery of MDCF compliant MPEG-2 transport streams is beyond the scope of the MDCF specification; however, the MDCF format is defined so that an MDCF compliant MPEG-2 transport stream can be delivered conveniently via commonly deployed broadcast methods, such as via a Conditional Access Terminal."},{"url":"http://www.openmobilealliance.org/release/SCE/V1_0-20081209-C/OMA-TS-SCE_REL-V1_0-20081209-C.pdf","file":"OMA-TS-SCE_REL-V1_0-20081209-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-09","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks. The scope of OMA Secure Content Exchange (SCE) is to enhance the OMA Digital Rights Management v2.1 (OMA DRM v2.1) specifications to enable the secure exchange of DRM Content among multiple devices. These enhancements include the following: •••• New capabilities that enable flexible sharing of purchased content in ways that were not possible using Domains as defined in OMA DRM v2.1. These new features include Copy and Move of Rights between Devices, Lending and sharing in an ad hoc manner. •••• Extension of the OMA DRM v2.1 Domain concept to the User Domain concept, which allows different Rights Issuers to generate Rights Objects for the same User Domain. •••• The definition of the Import function allows content protected by non-OMA DRM mechanisms to be consumed by SCE Devices. Together with the Export function from OMA DRM v2.1, the Import function allows OMA SCE Devices to securely exchange content with non-OMA DRM devices. •••• Enhancements to the OMA DRM specifications to enable consumption of DRM Content contained in an MPEG-2 Transport Stream across a wide variety of user Devices. This document extends the OMA DRM v2.1 Rights Expression Language (REL) [DRM-REL-v2.1] for SCE specific purposes. New permissions, such as <move> and <adhoc-share>, and new constraints, such as <userDomain> and <proximity> are specified in this document. Normative text from the OMA DRM v2.1 REL document SHALL apply to SCE."}]}}