{"input":{"cteatedAt":"2021-02-18T12:43:43.605Z","url":"http://www.openmobilealliance.org/release/PoC/v1_0-20050502-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/PoC/v1_0-20050502-C/OMA-AD-PoC-V1_0-20050502-C.pdf","file":"OMA-AD-PoC-V1_0-20050502-C.pdf","status":"Candidate","version":"V1.0","date":"2005-05-02","contentMediaType":"application/pdf","description":"The  scope  of  the  Push  to  talk  over  Cellular  (PoC)  architecture  document  is  to  define  the  architecture  for  the  PoC  service  enabler.  This  architecture  is  based  on  the  requirements  listed  for  the  system  in  the  PoC  requirements  document  [PoC  RD  V1.0].  The architecture of the SIP/IP Core and the underlying access network for PoC is out of scope of this document. When SIP/IP Core  corresponds  to  the  3GPP  IMS  the  architecture  the  3GPP  enablers  for  OMA  PoC  services  are  described  in  [3GPP  TR  23.979]."},{"url":"http://www.openmobilealliance.org/release/PoC/v1_0-20050502-C/OMA-ERELD_POC-V1_0-20050429-C.pdf","file":"OMA-ERELD_POC-V1_0-20050429-C.pdf","status":"Candidate","version":"V1.0","date":"2005-04-29","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Push-to-Talk over Cellular according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/PoC/v1_0-20050502-C/OMA-ERP-PoC-V1_0-20050502-C.zip","file":"OMA-ERP-PoC-V1_0-20050502-C.zip","status":"Candidate","version":"V1.0","date":"2005-05-02","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/PoC/v1_0-20050502-C/OMA-RD-PoC-V1_0-20050329-C.pdf","file":"OMA-RD-PoC-V1_0-20050329-C.pdf","status":"Candidate","version":"V1.0","date":"2005-03-29","contentMediaType":"application/pdf","description":"This Requirement Document (RD) defines the requirements for the Push to Talk over Cellular. This document captures the overall service description, primarily from the service subscriber's and user's points of view, but its scope does not include the details of the human interface itself. The information contained in this RD is applicable to network operators, service providers and terminal and infrastructure manufacturers. This RD contains the core requirements for the Push to Talk over Cellular enabler as specified by OMA. By means of this enabler, together with other OMA service enablers, a service provider SHALL be able to provide a complete service. The term PoC in this document refers to the Push to Talk over Cellular enabler offered via an OMA compatible environment."},{"url":"http://www.openmobilealliance.org/release/PoC/v1_0-20050502-C/OMA-TS-PoC-ControlPlane-V1_0-20050428-C.pdf","file":"OMA-TS-PoC-ControlPlane-V1_0-20050428-C.pdf","status":"Candidate","version":"V1.0","date":"2005-04-28","contentMediaType":"application/pdf","description":"This document defines the Control Plane signaling procedures of the PoC Client and PoC Server for Push to Talk over Cellular (PoC) service. Example detailed signaling flows for the reference points POC-1, POC-2 and IP-1 are also included in this specification. This Control Plane specification is based on the procedures specified in [OMA-PoC-AD] \"High level procedures\"."},{"url":"http://www.openmobilealliance.org/release/PoC/v1_0-20050502-C/OMA-TS-PoC_XDM-V1_0-20050428-C.pdf","file":"OMA-TS-PoC_XDM-V1_0-20050428-C.pdf","status":"Candidate","version":"V1.0","date":"2005-04-28","contentMediaType":"application/pdf","description":"The PoC enabler specific data formats and XCAP application usages are described in this specification."},{"url":"http://www.openmobilealliance.org/release/PoC/v1_0-20050502-C/OMA-TS_PoC-UserPlane-V1_0-20050428-C.pdf","file":"OMA-TS_PoC-UserPlane-V1_0-20050428-C.pdf","status":"Candidate","version":"V1.0","date":"2005-04-28","contentMediaType":"application/pdf","description":"This document describes the User Plane signaling procedures for the Push to Talk over Cellular (PoC) service over the POC-3 and the POC-4 reference points as defined in [OMA-POC-AD]. When necessary, interworking between the Control Plane [OMA-POC-CP]and the User Plane is described in this document. This specification does not specify the underlying SIP / IP Core, its features and functions. However, some parts of the specification may place requirements on the implementation of SIP / IP Core."}]}}