{"input":{"cteatedAt":"2021-02-18T13:18:12.204Z","url":"http://www.openmobilealliance.org/release/SVG/V1_0-20090317-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SVG/V1_0-20090317-A/OMA-ERELD-SVG_Mobile_Domain-V1_0-20090317-A.pdf","file":"OMA-ERELD-SVG_Mobile_Domain-V1_0-20090317-A.pdf","status":"Approved","version":"V1.0","date":"2009-03-17","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Scalable Vector Graphics (SVG) for the Mobile Domain according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/SVG/V1_0-20090317-A/OMA-ERP-SVG_Mobile_Domain-V1_0-20090317-A.zip","file":"OMA-ERP-SVG_Mobile_Domain-V1_0-20090317-A.zip","status":"Approved","version":"V1.0","date":"2009-03-17","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SVG/V1_0-20090317-A/OMA-EVP-SVG-V1_0-20090317-A.pdf","file":"OMA-EVP-SVG-V1_0-20090317-A.pdf","status":"Approved","version":"V1.0","date":"2009-03-17","contentMediaType":"application/pdf","description":"This document details the Validation plan for the SVG 1.0 Enabler Release.  The successful accomplishment of the validation activities will be required for the Enabler to be considered for Approved status.  The validation plan for the SVG1.0 Enabler Release specifications is based on testing expectations in the Enabler Test Requirements (ETR).  While the specific test activities to be performed are described in the Enabler Test Specification (ETS) the test environment is described in this plan.  This test environment details infrastructure, operational and participation requirements identified for the needed testing activities. 1.1     Assumptions     The test programme for SVG 1.0 validation utilizes heavily the W3C SVG Tiny 1.2 test suite. The assumption is that this test suite and the accompanying test harness are publicly available. 1.2     Exclusions     N/A"},{"url":"http://www.openmobilealliance.org/release/SVG/V1_0-20090317-A/OMA-RD-SvgMobileDomain-V1_0-20090317-A.pdf","file":"OMA-RD-SvgMobileDomain-V1_0-20090317-A.pdf","status":"Approved","version":"V1.0","date":"2009-03-17","contentMediaType":"application/pdf","description":"This document contains the requirements for adopting Scalable Vector Graphics (SVG) in the domain of mobile devices.  Detailed use cases are presented along with the resulting functional requirements for the mobile device supporting SVG. In addition, key conformance and interoperability considerations are presented, aimed at those implementing these SVG requirements on a mobile device. The goal of this document is to aid the mobile developer community in creating SVG content which is interoperable across different devices in the mobile space."},{"url":"http://www.openmobilealliance.org/release/SVG/V1_0-20090317-A/OMA-TS-SVG_Mobile-V1_0-20090317-A.pdf","file":"OMA-TS-SVG_Mobile-V1_0-20090317-A.pdf","status":"Approved","version":"V1.0","date":"2009-03-17","contentMediaType":"application/pdf","description":"This section is informative. Scalable Vector Graphics (SVG) is a W3C specification that provides an XML-based way to describe and render 2-Dimensional graphics and graphical applications. There are two mobile profiles of SVG which are targeted towards resource-constrained devices. These are SVG Mobile and SVG Tiny [SVGT]. Of these, SVG Tiny is the specification chosen by OMA to provide 2D graphical applications within the Wireless Applications Environment [WAE]."}]}}