{"input":{"cteatedAt":"2021-02-18T13:09:00.859Z","url":"http://www.openmobilealliance.org/release/SEC_CF/V1_0-20060808-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_0-20060808-C/OMA-RD-SEC_CF-V1_0-20060808-C.pdf","file":"OMA-RD-SEC_CF-V1_0-20060808-C.pdf","status":"Candidate","version":"V1.0","date":"2006-08-08","contentMediaType":"application/pdf","description":"The Security Common Functions (SEC_CF) will provide common security functions for OMA enablers. These functions shall not be specific to any particular application. The SEC_CF architecture will provide a common way to specify security functionality for different enabler deployment scenarios. SEC_CF will be accompanied with several Technical Specifications (TS). While the Architecture Document (AD) intends to describe the high level architecture of the SEC_CF, and to provide architectural guidance for different enabler deployments, details of the security functions will be provided in separate technical specifications.  All these specifications shall be developed such that they can be applicable to any OMA protocols, i.e. they shall not be specific to any specific application. Specifications for protocols will either reference SEC_CF specifications, or include building blocks provided by the SEC_CF, or are designed according to guidelines that are provided by the SEC_CF. This document, the Requirements Description (RD), will identify the requirements for the Security Common Functions. It will describe, in a generic way, for which entities and under which conditions identification, authentication, confidentiality and integrity are to be provided in protocols developed by OMA working groups.  The requirements for the SEC_CF will be developed from use cases as described later in this document. These use cases will, however, be more examples of applications of different security solutions than detailed and explicit application use cases. Security requirements as identified for already specified OMA enablers, such as e.g. Secure User Plane Location (SUPL), will be taken into consideration. Further requirements, however, will be added where necessary. Development of Common Security Functions is an ongoing process as requirements of OMA enablers change. SEC_CF development will be phased into various enabler releases. Details of the defined phases and the relevant requirements can be found in Section 5. The first enabler release of SEC_CF will provide security architectures based on the commonly deployed security architectures in the mobile industry.  This is done in order to ensure maximum re-use of the existing security mechanisms that are already deployed.  Any mechanisms that need further developments such as defining new security protocols or require adaptations to be used by the mobile industry are considered to be addressed in the future releases of SEC CF."}]}}