{"input":{"cteatedAt":"2021-02-18T13:09:25.524Z","url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-AD-SEC_CF-V1_1-20101130-C.pdf","file":"OMA-AD-SEC_CF-V1_1-20101130-C.pdf","status":"Candidate","version":"V1.1","date":"2010-11-30","contentMediaType":"application/pdf","description":"Common Security Functions Architecture provides common security architecture for OMA Enablers. SEC_CF also describes a common way to implement security functionality for OMA Enablers and provides various architectures for different enabler deployment scenarios. Ultimately, it should be possible for all types of OMA enablers to use this architecture to provide security.  SEC_CF will be accompanied with several Technical Specifications (TS). This specification (Architecture Document) intends to describe the high level architecture of the SEC_CF and provide architecture guidance for different enabler deployment options. Details of the security implementations will be provided in separate technical specifications. The list of the technical specifications can be found in this document."},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-DDS-SEC_CERT_MO-V1_0-20080902-A.pdf","file":"OMA-DDS-SEC_CERT_MO-V1_0-20080902-A.pdf","status":"Approved","version":"V1.0","date":"2008-09-02","contentMediaType":"application/pdf","description":"This data specification defines Management Objects (MO) required for the management of security properties in the context of  the  SEC_CF  enabler.  The  structure  and  the  machanisms  to  use  Management  Objects  (MO)  are  defined  in  OMA  Device  Management Enabler [DM]. This specification does not detail how these MOs are created or transported to the devices but rather defines the contents and the purpose of the MOs. This  specification  intends  to  specify  all  the  necessary  management  objects  required  for  the  operation  of  the  SEC_CF  v1.0  enabler and does not intent to specify all the security related MOs that may be defined in other existing OMA enablers. This specification will be updated as required following the new versions of SEC_CF Enabler specifications."},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-ERELD-SEC_CF-V1_1-20101130-C.pdf","file":"OMA-ERELD-SEC_CF-V1_1-20101130-C.pdf","status":"Candidate","version":"V1.1","date":"2010-11-30","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Application Layer Security Common Functions (SEC_CF) according to OMA Release process and the Enabler Release specification baseline listed in section Error! Reference source not found.."},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-ERP-SEC_CF-V1_1-20101130-C.zip","file":"OMA-ERP-SEC_CF-V1_1-20101130-C.zip","status":"Candidate","version":"V1.1","date":"2010-11-30","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-RD-SEC_CF-V1_1-20101130-C.pdf","file":"OMA-RD-SEC_CF-V1_1-20101130-C.pdf","status":"Candidate","version":"V1.1","date":"2010-11-30","contentMediaType":"application/pdf","description":"This document defines use cases and requirements for OMA Security Common Functions (SEC_CF) 1.1. It describes a set of enhanced or new functional requirements for the enabler Security Common Functions to support OMA enablers. In order to maintain backward compatibility, this requirement document also contains use cases and requirements in prior release SEC_CF 1.0."},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-SUP-MO_SEC_CERT-V1_0-20080902-A.txt","file":"OMA-SUP-MO_SEC_CERT-V1_0-20080902-A.txt","status":"Approved","version":"V1.0","date":"2008-09-02","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-SUP-XSD_seccf_gba-V1_1-20101130-C.xsd","file":"OMA-SUP-XSD_seccf_gba-V1_1-20101130-C.xsd","status":"Candidate","version":"V1.1","date":"2010-11-30","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-TS-Delegated_Authentication_Profile-V1_1-20101130-C.pdf","file":"OMA-TS-Delegated_Authentication_Profile-V1_1-20101130-C.pdf","status":"Candidate","version":"V1.1","date":"2010-11-30","contentMediaType":"application/pdf","description":"This specification defines an OMA profile of existing mechanisms related to delegated authentication for web service to provide SSO experience for users during accessing web services as well as to allow users to control their public identifiers on the Web."},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-TS-GBA_Profile-V1_1-20101130-C.pdf","file":"OMA-TS-GBA_Profile-V1_1-20101130-C.pdf","status":"Candidate","version":"V1.1","date":"2010-11-30","contentMediaType":"application/pdf","description":"This specification defines an OMA profile of the Generic Bootstrapping Architecture (GBA) specified in 3GPP/3GPP2 and also an OMA profile of GBA Push specified in 3GPP. GBA specifies an architecture where operator controlled smart cards, i.e., SIMs for GSM, and USIMs/ISIMs for UMTS and UICCs/R-UIMs/CSIMs for 3GPP2) can be used to bootstrap a short term  security  association  between  a  client  and  a  server  in  the  network.  This  short  term  security  association  can  be  used  between any client and any server in the network to secure the connection between them. GBA Push also specifies a similar architecture, where the NAF initiates the bootstrapping process, but the scheme applies only to USIM/ISIM. GBA is often used in OMA Enabler Specifications, and existence of several options in the GBA specifications may lead to interoperability problems in GBA usage in OMA Enablers. In addition, requiring implementations of some options in the TLS protocol for OMA enablers can increase the level of security compared to only implementing the mandatory features in the TLS specifications. OMA Workgroups developing enabler specifications are recommended to use the OMA Profile of GBA."},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-TS-IPSec_Profile-V1_1-20101130-C.pdf","file":"OMA-TS-IPSec_Profile-V1_1-20101130-C.pdf","status":"Candidate","version":"V1.1","date":"2010-11-30","contentMediaType":"application/pdf","description":"The set of IPsec protocols include two traffic security protocols, the Authentication Header (AH) and the Encapsulating Security Payload (ESP). The IPsec AH provides connectionless integrity, data origin authentication, and an optional anti-replay service. The IPsec ESP also provides connectionless integrity, data origin authentication, an anti-replay service as well as confidentiality. In order to make implementation more simply and to avoid interoperability problems in some implementations of IPsec in OMA Enablers, it’s suggested profiling only IPsec ESP to secure OMA enablers. This specification is to profile IPsec ESP related specifications [RFC 2401] [RFC 2406] [RFC 4301][RFC 4303][RFC 4305] to provide data origin authentication, an anti-replay service, data integrity and encryption for OMA enablers operating over the protocol IP, especially for those OMA enablers operating over the protocol UDP.  Note: the old RFCs related to IPsec (e.g., [RFC 2406][RFC 2401]) are not recommended for new implementations."},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20101130-C/OMA-TS-TLS_Profile-V1_1-20101130-C.pdf","file":"OMA-TS-TLS_Profile-V1_1-20101130-C.pdf","status":"Candidate","version":"V1.1","date":"2010-11-30","contentMediaType":"application/pdf","description":"This specification defines an OMA profile of TLS related specifications specified in IETF, [RFC2246], [RFC4346], [RFC4279], [RFC4366], [RFC3268], [RFC4347], [RFC5246], [RFC4785][RFC5487]. The TLS related specifications are often used in OMA Enabler Specifications and the current TLS specifications include several optional features for the enabler specifications to choose from. Existence of several versions and options in the TLS related specifications may lead to interoperability problems in some implementations of TLS in OMA Enablers. In addition, requiring implementations of some options in the TLS protocol for OMA enablers can increase the level of security compared to only implementing the mandatory features in the TLS related specifications. OMA Workgroups developing enabler specifications are recommended to use the OMA Profile of TLS. ."}]}}