{"input":{"cteatedAt":"2021-02-18T13:09:20.549Z","url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20100330-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20100330-C/OMA-AD-SEC_CF-V1_1-20100330-C.pdf","file":"OMA-AD-SEC_CF-V1_1-20100330-C.pdf","status":"Candidate","version":"V1.1","date":"2010-03-30","contentMediaType":"application/pdf","description":"Common Security Functions Architecture provides common security architecture for OMA Enablers. SEC_CF also describes a common way to implement security functionality for OMA Enablers and provides various architectures for different enabler deployment scenarios. Ultimately, it should be possible for all types of OMA enablers to use this architecture to provide security.  SEC_CF will be accompanied with several Technical Specifications (TS). This specification (Architecture Document) intends to describe the high level architecture of the SEC_CF and provide architecture guidance for different enabler deployment options. Details of the security implementations will be provided in separate technical specifications. The list of the technical specifications can be found in this document."},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20100330-C/OMA-ERELD-SEC_CF-V1_1-20100330-C.pdf","file":"OMA-ERELD-SEC_CF-V1_1-20100330-C.pdf","status":"Candidate","version":"V1.1","date":"2010-03-30","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Application Layer Security Common Functions (SEC_CF) according to OMA Release process and the Enabler Release specification baseline listed in section Error! Reference source not found.."},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20100330-C/OMA-ERP-SEC_CF-V1_1-20100330-C.zip","file":"OMA-ERP-SEC_CF-V1_1-20100330-C.zip","status":"Candidate","version":"V1.1","date":"2010-03-30","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SEC_CF/V1_1-20100330-C/OMA-RD-SEC_CF-V1_1-20091208-C.pdf","file":"OMA-RD-SEC_CF-V1_1-20091208-C.pdf","status":"Candidate","version":"V1.1","date":"2009-12-08","contentMediaType":"application/pdf","description":"This document defines use cases and requirements for OMA Security Common Functions (SEC_CF) 1.1. It describes a set of enhanced or new functional requirements for the enabler Security Common Functions to support OMA enablers. In order to maintain backward compatibility, this requirement document also contains use cases and requirements in prior release SEC_CF 1.0."}]}}