{"input":{"cteatedAt":"2021-02-18T12:33:01.469Z","url":"http://www.openmobilealliance.org/release/OGSA/V1_0-20100126-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/OGSA/V1_0-20100126-C/OMA-OD-Global_Service_Architecture-20100126-C.pdf","file":"OMA-OD-Global_Service_Architecture-20100126-C.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document describes the OMA Global Service Architecture (OGSA) that is a service architectural view of OMA Enablers leveraging OSE (OMA Service Environment). The main scope of OGSA is to support new (and/or revised) Enabler specifications clarifying how they fit with the OSE. For this reason, when creating a new (or revised) Enabler, OGSA will: •identify the dependencies between the being-defined (or revised) Enabler and other OMA Enablers  •compile which interfaces the being-defined (or revised) Enabler exposes;   How the relevant OMA WG will specify the being-defined (or revised) Enabler is out of scope of the OGSA work. Influencing other SDOs is out of scope of the OGSA work: in case overlaps with other SDOs specifications should come out, these will be managed as in OMA process. Material for a specific enabler will only be included in this document for enablers where the Architecture Document has reached Candidate or Approved status."},{"url":"http://www.openmobilealliance.org/release/OGSA/V1_0-20100126-C/OMA-RRELD-OGSA-V1_0-20100126-C.pdf","file":"OMA-RRELD-OGSA-V1_0-20100126-C.pdf","status":"Candidate","version":"V1.0","date":"2010-01-26","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of OMA Global Service Architecture (OGSA) V1.0 according to OMA Release process and the Reference Release document baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/OGSA/V1_0-20100126-C/OMA-RRP-OGSA-V1_0-20100126-C.zip","file":"OMA-RRP-OGSA-V1_0-20100126-C.zip","status":"Candidate","version":"V1.0","date":"2010-01-26","contentMediaType":"application/zip"}]}}