{"input":{"cteatedAt":"2021-02-17T21:54:50.361Z","url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-AD-DCD-V1_0-20081223-C.pdf","file":"OMA-AD-DCD-V1_0-20081223-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"application/pdf","description":"This  document  defines  the  architecture  of  Dynamic  Content  Delivery  (DCD)  Enabler.  This  architecture  is  based  on  the  requirements listed in the DCD Requirement Document [OMA-DCD-RD]."},{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-ERELD-DCD-V1_0-20081223-C.pdf","file":"OMA-ERELD-DCD-V1_0-20081223-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of DCD according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-ERP-DCD-V1_0-20081223-C.zip","file":"OMA-ERP-DCD-V1_0-20081223-C.zip","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-RD-DCD-V1_0-20081223-C.pdf","file":"OMA-RD-DCD-V1_0-20081223-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"application/pdf","description":"This document defines the requirements for the Dynamic Content Delivery Enabler. The  Dynamic  Content  Delivery  (DCD)  Enabler  is  expected  to  enhance  a  mobile  user’s  experience  through  the  periodic  delivery of personalised or customized content to a device. Such content may be based on the subscription and preferences of the user, operator or service provider. As a complementary delivery mechanism to the existing mechanisms, e.g. browsing, messaging, etc., it will reuse as much existing technology as possible, while providing the added benefits of delivery control management, and an enhanced user experience. The  content  delivery  should  support  various  network  technologies  (i.e.  network  types  and/or  bearers),  and  may  operate  autonomously  in  the  background.    The  content  types  and  formats  used  by  DCD  will,  wherever  possible,  be  consistent  with  those of the established mechanisms. The DCD Enabler enables an application and its delivery to be enhanced by making it available asynchronously and through automatic means though it does not specify detailed DCD applications, or how to render those applications."},{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-SUP-XSD_DCD-V1_0-20081223-C.txt","file":"OMA-SUP-XSD_DCD-V1_0-20081223-C.txt","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-TS-DCD_BCAST_Adaptation-V1_0-20081223-C.pdf","file":"OMA-TS-DCD_BCAST_Adaptation-V1_0-20081223-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"application/pdf","description":"This document is intended to supplement the core Dynamic Content Delivery (DCD) technical specification by describing additional behaviors and metadata necessary to enable the operation of the DCD Version 1.0 Enabler over the Mobile Broadcast Services (BCAST) Enabler. The scope of this document is limited to the interfaces and metadata required to achieve interoperability between a DCD Server operating over BCAST and a DCD Client operating over BCAST.   The interfaces between the DCD Server and BCAST Service Distribution / Adaptation function are considered out of scope for this document.  The interfaces between the DCD Client and BCAST File Delivery Client are also considered out of scope for this document.  These interfaces may be specified in future releases of the DCD Enabler."},{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-TS-DCD_CBS_Adaptation-V1_0-20081223-C.pdf","file":"OMA-TS-DCD_CBS_Adaptation-V1_0-20081223-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"application/pdf","description":"The DCD Enabler is designed to enable content delivery over a number of different underlying protocols and bearer technologies.  This document specifies the binding of DCD to Cell Broadcast Service (CBS) bearers in in GSM/UMTS networks, and special considerations that should be taken within DCD interfaces and metadata necessary to facilitate the use of the DCD Enabler over the CBS bearer. The interface between the DCD Server and a Cell Broadcast Center (CBC) is considered out of scope for this document.  However the responsibility and the expected behaviour of each entity are described. The interface between the DCD Client and CB handler in the ME/UE is assumed to be unidirectional data delivery only from the CB handler towards the DCD Client. Any other data exchange between these entities is considered to be out of scope of standardization. However the responsibility and the expected behavior of each entity are described."},{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-TS-DCD_Charging-V1_0-20081223-C.pdf","file":"OMA-TS-DCD_Charging-V1_0-20081223-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"application/pdf","description":"This document specifies the use of OMA Charging Enabler to realise the offline and online charging requirements of OMA DCD Enabler. The OMA Charging Enabler defines a set of interfaces that are utilised by the other Enablers to fulfil their charging requirements. The interfaces are specified in [OMA-AD-Charging-V1_0]. This document defines how, when and by which entities charging is triggered and which function invokes charging over the OMA Charging Enabler interfaces. This document also defines the data that will be exchanged during the process. This document specifies in detail: •The charging models for the OMA DCD enabler, •The logical messages and message types used on CH-1 and CH-2 interfaces,  •The flow of messages between the Charging Enabler User and the Charging Enabler with regard to the DCD Service and applicable DCD scenarios, •Mapping of the DCD parameters to the OMA Charging Data Elements"},{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-TS-DCD_MO-V1_0-20081223-C.pdf","file":"OMA-TS-DCD_MO-V1_0-20081223-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"application/pdf","description":"This document defines the OMA DCD Management Object that enables management of default DCD connection profiles."},{"url":"http://www.openmobilealliance.org/release/DCD/V1_0-20081223-C/OMA-TS-DCD_Semantics-V1_0-20081223-C.pdf","file":"OMA-TS-DCD_Semantics-V1_0-20081223-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-23","contentMediaType":"application/pdf","description":"This document defines the semantics of Dynamic Content Delivery (DCD) Version 1.0, including the session and transaction model, message types and their information elements, status and error codes, and other details."}]}}