{"input":{"cteatedAt":"2021-02-18T12:38:04.959Z","url":"http://www.openmobilealliance.org/release/OpenCMAPI/V1_0-20120619-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/OpenCMAPI/V1_0-20120619-C/OMA-AD-OpenCMAPI-V1_0-20120619-C.pdf","file":"OMA-AD-OpenCMAPI-V1_0-20120619-C.pdf","status":"Candidate","version":"V1.0","date":"2012-06-19","contentMediaType":"application/pdf","description":"This document provides the architecture for the OpenCMAPI Enabler. This architecture is based on the requirements as listed in the OpenCMAPI Requirement Document [OpenCMAPI-RD]. The objective of the OpenCMAPI Enabler is to the define the OpenCMAPI Connection Management component and the interfaces exposed by this component to applications (CM applications or non CM applications) that rely on OpenCMAPI Enabler to work or to provide additional functionalities. The OpenCMAPI Enabler architecture is designed to support the core functionalities related to connection management, in particular Cellular network connection management, WLAN management, PIN/PUK management, Information Status and call backs."},{"url":"http://www.openmobilealliance.org/release/OpenCMAPI/V1_0-20120619-C/OMA-ERELD-OpenCMAPI-V1_0-20120619-C.pdf","file":"OMA-ERELD-OpenCMAPI-V1_0-20120619-C.pdf","status":"Candidate","version":"V1.0","date":"2012-06-19","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of the Open Connection Manager API (OpenCMAPI) Enabler according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/OpenCMAPI/V1_0-20120619-C/OMA-ERP-OpenCMAPI-V1_0-20120619-C.zip","file":"OMA-ERP-OpenCMAPI-V1_0-20120619-C.zip","status":"Candidate","version":"V1.0","date":"2012-06-19","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/OpenCMAPI/V1_0-20120619-C/OMA-ETR-OpenCMAPI-V1_0-20120619-C.pdf","file":"OMA-ETR-OpenCMAPI-V1_0-20120619-C.pdf","status":"Candidate","version":"V1.0","date":"2012-06-19","contentMediaType":"application/pdf","description":"The Enabler Test Requirements (ETR) document for the Enabler under consideration is created and maintained by the Technical Working Group (TWG) responsible for the technical specifications for the corresponding Enabler. The ETR document is intended to cover at least those requirements collected in the Requirements Document (RD) and the Architecture Document (AD) in addition to any other items the TWG has identified as important enough to warrant attention from interoperability perspective and identify any technical functionalities that should be covered by testing."},{"url":"http://www.openmobilealliance.org/release/OpenCMAPI/V1_0-20120619-C/OMA-RD-OpenCMAPI-V1_0-20120619-C.pdf","file":"OMA-RD-OpenCMAPI-V1_0-20120619-C.pdf","status":"Candidate","version":"V1.0","date":"2012-06-19","contentMediaType":"application/pdf","description":"This document defines the requirements for the OMA Open Connection Manager API (OpenCMAPI) V1.0. The aim of the OMA OpenCMAPI V1.0 RD is to address requirements for: \u0001 all connectivity and connection management  aspects relevant such as: o Connection/Disconnection o All relevant elements related to the connection or the device and more specifically all elements necessary and useful to be provided to any UI and user experience or to any application needing information status on the connection. o Additional services such as SMS, USSD, GNSS... when associated to connection management and relevant for the device considered o Data service especially PUSH service configuration on the device side.  The intention is that this API is \u0001 OS independent  \u0001 Supporting Multi-Instance (several applications/services can use it in parallel if necessary) \u0001 Applicable to different types of devices requiring access to mobile internet such as Mobile Broadband devices, Wireless routers, M2M, Smartphones, Tablets, Cloud Devices... \u0001 User Interface independent"},{"url":"http://www.openmobilealliance.org/release/OpenCMAPI/V1_0-20120619-C/OMA-TS-OpenCMAPI-V1_0-20120619-C.pdf","file":"OMA-TS-OpenCMAPI-V1_0-20120619-C.pdf","status":"Candidate","version":"V1.0","date":"2012-06-19","contentMediaType":"application/pdf","description":"This specification of the OpenCMAPI defines an interface, through which connection management services are made available to different applications. The specification addresses the requirements enumerated in [OpenCMAPI-RD] and adheres to the architecture described in [OpenCMAPI-AD]."}]}}