{"input":{"cteatedAt":"2021-02-18T12:41:31.322Z","url":"http://www.openmobilealliance.org/release/PIOSE/V1_0-20080331-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/PIOSE/V1_0-20080331-A/OMA-AD-PIOSE-V1_0-20080331-A.pdf","file":"OMA-AD-PIOSE-V1_0-20080331-A.pdf","status":"Approved","version":"V1.0","date":"2008-03-31","contentMediaType":"application/pdf","description":"The PIOSE AD addresses how OMA OSE and OSA/Parlay architectures could be integrated and how components (in an implementation or realization) could coexist; it addresses integration of OSA/Parlay, Parlay X Web Services, and OSE.  The information contained in this AD is applicable to OMA working groups that are developing service enablers that may use other resources such as Parlay and Parlay X components. The AD focuses on how the OSE could take advantage of OSA/Parlay and Parlay X Web Services..  The specific OMA service enablers are not affected by this AD and are handled by the individual OMA working groups as usual. OSA/Parlay architecture [OSA] is not affected by this AD either."},{"url":"http://www.openmobilealliance.org/release/PIOSE/V1_0-20080331-A/OMA-RD-ParlayinOSE-V1_0-20080331-A.pdf","file":"OMA-RD-ParlayinOSE-V1_0-20080331-A.pdf","status":"Approved","version":"V1.0","date":"2008-03-31","contentMediaType":"application/pdf","description":"This specification defines the use cases and requirements for ParlayinOSE (PIOSE). The requirements in this document  addresses how OMA OSE and Parlay/OSA architectures could be integrated and components implementation/ realizations coexist.  This PIOSE RD describes requirements on integration of OSA/Parlay, Parlay X Web Service and OSE. The information contained in this RD is applicable to OMA working groups that are developing service enablers that may use other resources such as Parlay, Parlay X components. The RD  focuses on determining the requirements for how the OSE could take advantage of Parlay/OSA components. The requirements on specific OMA service enablers are not affected by this RD and are handled by the individual OMA working groups as usual. Parlay/OSA architecture[OSA] is not affected by this RD either."},{"url":"http://www.openmobilealliance.org/release/PIOSE/V1_0-20080331-A/OMA-RRELD-PIOSE-V1_0-20080331-A.pdf","file":"OMA-RRELD-PIOSE-V1_0-20080331-A.pdf","status":"Approved","version":"V1.0","date":"2008-03-31","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of Parlay/OSA in OSE (PIOSE) V1.0 according to OMA Release process and the Reference Release document baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/PIOSE/V1_0-20080331-A/OMA-RRP-PIOSE-V1_0-20080331-A.zip","file":"OMA-RRP-PIOSE-V1_0-20080331-A.zip","status":"Approved","version":"V1.0","date":"2008-03-31","contentMediaType":"application/zip"}]}}