{"input":{"cteatedAt":"2021-02-18T13:11:25.900Z","url":"http://www.openmobilealliance.org/release/SIP_Push/V1_0-20100401-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SIP_Push/V1_0-20100401-C/OMA-AD-SIP_Push-V1_0-20081202-C.pdf","file":"OMA-AD-SIP_Push-V1_0-20081202-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-02","contentMediaType":"application/pdf","description":"This document defines the entities needed to implement the SIP Push protocol and how to integrate them to create a SIP Push based service. The architecture is based on the requirements in the SIP Push Requirement Document [PushSIP-RD]. The definition of SIP Push entities and the description of SIP/IP Core features needed to enable a SIP Push based service are in scope of this document. In the definition of the entire OMA push solution this architecture specification co-exists and references the work of the OMA Push 2.1 Enabler Release [PUSH2.1].  In order to facilitate integration with other OMA enablers this document deals with entities of the general push architecture that are significantly affected by the introduction of a SIP based push mechanism."},{"url":"http://www.openmobilealliance.org/release/SIP_Push/V1_0-20100401-C/OMA-ERELD-SIP_Push-V1_0-20100401-C.pdf","file":"OMA-ERELD-SIP_Push-V1_0-20100401-C.pdf","status":"Candidate","version":"V1.0","date":"2010-04-01","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of SIP Push according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/SIP_Push/V1_0-20100401-C/OMA-ERP-SIP_PUSH-V1_0-20100401-C.zip","file":"OMA-ERP-SIP_PUSH-V1_0-20100401-C.zip","status":"Candidate","version":"V1.0","date":"2010-04-01","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SIP_Push/V1_0-20100401-C/OMA-RD-SIP_Push-V1_0-20050130-C.pdf","file":"OMA-RD-SIP_Push-V1_0-20050130-C.pdf","status":"Candidate","version":"V1.0","date":"2005-01-30","contentMediaType":"application/pdf","description":"This document defines the use-cases and requirements for SIP based Push as a transport bearer for OMA Push.  The document will maintain the compatibility with the existing WAP Push architecture; push message definitions, service definitions, charging [OMACharging]. Push Proxy Gateway Service specification [PPGService] defines PPG operations, which defines each push submission processing, before sending the push content to the client. It is out of the scope of SIP Based Push RD to define any new push submission processing."},{"url":"http://www.openmobilealliance.org/release/SIP_Push/V1_0-20100401-C/OMA-TS-SIP_Push-V1_0-20100401-C.pdf","file":"OMA-TS-SIP_Push-V1_0-20100401-C.pdf","status":"Candidate","version":"V1.0","date":"2010-04-01","contentMediaType":"application/pdf","description":"This  specification  defines  the  protocol  for  delivery  of  content  to  a  mobile  terminal  via  SIP  [RFC3261]  and  MSRP [RFC4975],  referred  to  as  SIP  Push.  The  protocol  specified  in  this  document  is  an  application  layer  protocol  that  interacts with a SIP/IP Core network, such as IMS [IMSArch] to fulfil the Push using SIP service.  The scope of this specification is to specify mechanisms for the following functionality within the architecture identified in [PushSIPArch]"}]}}