{"input":{"cteatedAt":"2021-02-17T21:49:36.712Z","url":"http://www.openmobilealliance.org/release/CSEA/V1_0-20101130-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/CSEA/V1_0-20101130-A/OMA-RD-CSEA-V1_0-20101130-A.pdf","file":"OMA-RD-CSEA-V1_0-20101130-A.pdf","status":"Approved","version":"V1.0","date":"2010-11-30","contentMediaType":"application/pdf","description":"This document defines the requirements for Application Programming Interfaces (API) to be defined as part of the OMA Client-Side Enabler API (CSEA) work item. As a core feature of the “programmable Web” environment enabling Web 2.0, the CSEA work item focuses on the definition of API’s. As an application environment capability, API’s make client and server functions programmable, and change the market impact of what were previous siloed or inaccessible to applications and functions, by integrating them into Web 2.0.  The CSEA work item further focuses on the definition of API’s as provided to client-side applications executing in Web runtime environments, e.g. in Web browsers or widget engines. The Web application environment provides a consistent application programming model through the use of Javascript as the primary procedural language through which application logic is coded and the CSEA API’s will be defined. The OMA Browsing enabler is thus closely related to the CSEA enabler, in that a Web runtime environment such as defined in the OMA Browsing enabler is a foundational requirement for client-side Web applications.  The API’s to be defined by CSEA are specifically scoped to enable Web application access to the services provided by OMA enablers as made available on the host device, e.g. through OMA enabler clients or other device software. In its initial release, the scope of CSEA 1.0 is further scoped to define the API requirements for the following OMA enablers: • OMA enablers focused on access to content, as a typical web application need: initially limited to DCD, Push  • OMA enablers supplementing the web application experience with key capabilities enabling application personalization and contextualization: initially limited to DPE Subsequent releases may be defined to extend this set of OMA enablers."},{"url":"http://www.openmobilealliance.org/release/CSEA/V1_0-20101130-A/OMA-RRELD-CSEA-V1_0-20101130-A.pdf","file":"OMA-RRELD-CSEA-V1_0-20101130-A.pdf","status":"Approved","version":"V1.0","date":"2010-11-30","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of Client Side Enabler API (CSEA) 1.0 according to OMA Release process and the Reference Release document baseline listed in section 5.  As a core feature of the “programmable Web” environment enabling Web 2.0, CSEA focuses on the definition of API’s. As an application environment capability, API’s make client and server functions programmable, and change the market impact of what were previous siloed or inaccessible to applications and functions, by integrating them into Web 2.0.  CSEA further focuses on the definition of API’s as provided to client-side applications executing in Web runtime environments, e.g. in Web browsers or widget engines. The Web application environment provides a consistent application programming model through the use of Javascript as the primary procedural language through which application logic is coded and the CSEA API’s will be defined. The OMA Browsing enabler is thus closely related to the CSEA enabler, in that a Web runtime environment such as defined in the OMA Browsing enabler is a foundational requirement for client-side Web applications.  The API’s to be defined by CSEA are specifically scoped to enable Web application access to the services provided by OMA enablers as made available on the host device, e.g. through OMA enabler clients or other device software."},{"url":"http://www.openmobilealliance.org/release/CSEA/V1_0-20101130-A/OMA-RRP-CSEA-V1_0-20101130-A.zip","file":"OMA-RRP-CSEA-V1_0-20101130-A.zip","status":"Approved","version":"V1.0","date":"2010-11-30","contentMediaType":"application/zip"}]}}