{"input":{"cteatedAt":"2021-02-17T21:56:44.770Z","url":"http://www.openmobilealliance.org/release/DCMO/V1_0-20120410-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/DCMO/V1_0-20120410-A/OMA-AD-DCMO-V1_0-20120410-A.pdf","file":"OMA-AD-DCMO-V1_0-20120410-A.pdf","status":"Approved","version":"V1.0","date":"2012-04-10","contentMediaType":"application/pdf","description":"The scope of this document is to define the architecture for the DCMO enabler. The DCMO enabler is based on OMA DM enabler and makes use of the functionalities provided by OMA DM v1.2 [DMPRO] protocol to remotely manage the device capabilities. This document fulfils the functional capabilities needed to support this enabler as described in the DCMO Requirements document [DCMO-RD]."},{"url":"http://www.openmobilealliance.org/release/DCMO/V1_0-20120410-A/OMA-ERELD-DCMO-V1_0-20120410-A.pdf","file":"OMA-ERELD-DCMO-V1_0-20120410-A.pdf","status":"Approved","version":"V1.0","date":"2012-04-10","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of DCMO according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/DCMO/V1_0-20120410-A/OMA-ERP-DCMO-V1_0-20120410-A.zip","file":"OMA-ERP-DCMO-V1_0-20120410-A.zip","status":"Approved","version":"V1.0","date":"2012-04-10","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DCMO/V1_0-20120410-A/OMA-RD-DCMO-V1_0-20120410-A.pdf","file":"OMA-RD-DCMO-V1_0-20120410-A.pdf","status":"Approved","version":"V1.0","date":"2012-04-10","contentMediaType":"application/pdf","description":"A number of Device  Management specifications  have  been defined  within OMA. These specifications, referred to as OMA DM  v1.2  specifications,  define  protocol  and  mechanism  to  be  used  between  a Device  Management Server  and  a  mobile device, data model made available for remote manipulation of a mobile device, security and policy to control the access to a particular resource in the mobile device.  This document defines the requirements for Device Capability Management functionality, which is based on OMA DM v1.2 specifications and makes use of the functionalities provided by OMA DM protocol Error! Reference source not found. to define special functionalities to manage device capabilities in the client device."},{"url":"http://www.openmobilealliance.org/release/DCMO/V1_0-20120410-A/OMA-SUP-MO_DCMO-V1_0-20120410-A.txt","file":"OMA-SUP-MO_DCMO-V1_0-20120410-A.txt","status":"Approved","version":"V1.0","date":"2012-04-10","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/DCMO/V1_0-20120410-A/OMA-TS-DCMO-V1_0-20120410-A.pdf","file":"OMA-TS-DCMO-V1_0-20120410-A.pdf","status":"Approved","version":"V1.0","date":"2012-04-10","contentMediaType":"application/pdf","description":"This document defines the Device Capability Management Object employed in a Device Capability management process that leverages OMA DM protocol [DMPRO]. It also defines client and server-side behaviour associated with Device Capability Management Object necessary to manage the Device Capabilities. The DCMO enabler is based on OMA DM enabler and makes use of the functionalities provided by OMA DM v1.2 [DMPRO] protocol to remotely manage the device capabilities. The mechanisms defined in this document fulfils the functional capabilities needed to support DCMO enabler as described in the DCMO Requirements document [DCMO-RD] and comply to the architecture defined in DCMO Architecture document [DCMO-AD]."}]}}