{"input":{"cteatedAt":"2021-02-18T13:11:49.354Z","url":"http://www.openmobilealliance.org/release/SNeW/V1_0-20160329-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SNeW/V1_0-20160329-A/OMA-ER-SNeW-V1_0-20160329-A.pdf","file":"OMA-ER-SNeW-V1_0-20160329-A.pdf","status":"Approved","version":"V1.0","date":"2016-03-29","contentMediaType":"application/pdf","description":"This Enabler Release (ER) document is a combined document that includes requirements, architecture and technical specification of the Social Network Web (SNeW) Enabler. The SNeW Enabler scope covers the following items: • the requirements and reference architecture to allow interoperability between clients and servers and server-to-server federation of OMA Compliant SNs, supporting at least features such as: o profile discovery; o publication and sharing of contents, activities and reactions; • the interface between a SNEW Client entity and a SNEW Server entity (intra-domain or UNI) that supports the above identified features; • the interface between SNEW Server entities (inter-domain or NNI) that supports the above identified features; • a set of Device APIs and Network APIs, to easily integrate OMA Compliant SN with external applications, as well as an appropriate privacy framework to control access to information through these APIs; • a set of guidelines to reuse existing OMA enablers for providing additional features (e.g. profile search using OMA MSF); In particular, with respect to interface specification, it is in the scope of this Enabler: • to consider referencing OStatus-related specifications, in particular for server-to-server interactions; • to consider referencing OpenSocial Social APIs, in particular for client-server interactions; • to consider referencing OpenSocial JavaScript APIs as Device APIs; • to consider reusing OAuth 2.0 and related specifications as privacy framework for APIs; • to consider reusing OMA Push enabler to support notifications to SNEW Client entities (e.g. for reactions delivery, private message delivery, user status notification, etc). Connections with External SNs are expected (through gateways implementing proprietary interfaces) but the definition of which External Social Network will be interconnected (and how) is out-of-scope of this activity. SNeW Enabler will reuse as much as possible existing technologies."},{"url":"http://www.openmobilealliance.org/release/SNeW/V1_0-20160329-A/OMA-ERELD-SNeW-V1_0-20160329-A.pdf","file":"OMA-ERELD-SNeW-V1_0-20160329-A.pdf","status":"Approved","version":"V1.0","date":"2016-03-29","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Social Network Web (SNeW) 1.0 according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/SNeW/V1_0-20160329-A/OMA-ERP-SNeW-V1_0-20160329-A.zip","file":"OMA-ERP-SNeW-V1_0-20160329-A.zip","status":"Approved","version":"V1.0","date":"2016-03-29","contentMediaType":"application/zip"}],"toFollow":[{"url":"http://www.openmobilealliance.org/release/SNeW/V1_0-20160329-A/V1_0-20160329-A/","pubVersion":"V1_0-20160329-A"}]}}