{"input":{"cteatedAt":"2021-02-17T22:16:23.568Z","url":"http://www.openmobilealliance.org/release/IMS/V1_0-20050204-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/IMS/V1_0-20050204-C/OMA-AD-IMS-V1_0-20050204-C.pdf","file":"OMA-AD-IMS-V1_0-20050204-C.pdf","status":"Candidate","version":"V1.0","date":"2005-02-04","contentMediaType":"application/pdf","description":"Within the framework of the OMA Service Environment (OSE) [OSE], this Architecture Document (AD) identifies a set of capabilities within the IP Multimedia Subsystem (IMS) as defined by 3GPP and 3GPP2 that can be utilized for the OMA service enabler implementations.   The scope of the IMS in OMA AD is to show, for OMA enablers realised on IMS, how they should use IMS and how they should interface with IMS in a consistent way. Furthermore, the AD describes interoperability and/or interworking of OMA enablers realized on IMS with other OMA enablers (either IMS realized or not). Although targeted at implementers of OMA enablers, the information contained in this AD is also targeted at OMA working groups that are developing service enablers that may be realized using IMS capabilities. This AD describes how OMA service enabler implementations interface with an underlying IP Multimedia Subsystem (as specified by 3GPP/3GPP2) in order to ensure interoperability. This document provides guidance and support for the implementation of service enablers utilizing IMS capabilities in order to meet the requirements given in the corresponding Requirements Document, ref. [IMS in OMA RD]."},{"url":"http://www.openmobilealliance.org/release/IMS/V1_0-20050204-C/OMA-ERELD-IMSinOMA-V1_0-20050204-C.pdf","file":"OMA-ERELD-IMSinOMA-V1_0-20050204-C.pdf","status":"Candidate","version":"V1.0","date":"2005-02-04","contentMediaType":"application/pdf","description":"The scope of this document is to give the Enabler Release Definition of IMSinOMA according to OMA Release process and the Enabler Release specification baseline listed in section 5.   © 2005 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20040205]"},{"url":"http://www.openmobilealliance.org/release/IMS/V1_0-20050204-C/OMA-IMSinOMA-V1_0-20050204-C.zip","file":"OMA-IMSinOMA-V1_0-20050204-C.zip","status":"Candidate","version":"V1.0","date":"2005-02-04","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/IMS/V1_0-20050204-C/OMA-RD-IMSinOMA-V1_0-20050204-C.pdf","file":"OMA-RD-IMSinOMA-V1_0-20050204-C.pdf","status":"Candidate","version":"V1.0","date":"2005-02-04","contentMediaType":"application/pdf","description":"The scope of the IMS WI is to show, for OMA enablers realised on IMS, how they should use IMS and how they should interface with IMS in a consistent way, whilst not breaking the principle of interoperability and/or interworking with both other (IMS realized or not) enablers and non-IMS networks. The information contained in this RD is applicable for OMA working groups that are developing service enablers that might be realized using IMS capabilities, since it is targeted to implementers of such enablers. This RD contains system level requirements to ensure interoperability between OMA service enabler realizations and an underlying IP Multimedia Subsystem (as specified by 3GPP/3GPP2). The requirements on specific OMA service enablers are not affected by this RD and are handled by the individual OMA working groups as usual. The requirements provided in this RD are oriented towards the recommendations given in the “Technical report on the usage of 3GPP/3GPP2 IMS in OMA” [TR_IMSinOMA].  © 2005 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ReqDoc-20030912]"}]}}