{"input":{"cteatedAt":"2021-02-18T12:32:53.230Z","url":"http://www.openmobilealliance.org/release/OCSP/V1_0-20070403-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/OCSP/V1_0-20070403-A/OMA-ERELD-OCSP_MP-V1_0-20070403-A.pdf","file":"OMA-ERELD-OCSP_MP-V1_0-20070403-A.pdf","status":"Approved","version":"V1.0","date":"2007-04-03","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Online Certificate Status Protocol (OCSP) Mobile Profile V1.0 according to OMA Release process and the Enabler Release specification baseline listed in section 6.  OCSP defines a protocol used to determine the current status of a digital certificate in lieu of using standard Certificate Revocation Lists (CRL’s).  The scope of this work item is to profile OCSP in such a way to ensure it can be used efficiently by limited wireless devices and to be interoperable with OCSP responders already at market.  The profile will be defined as an OMA service enabler to ensure its use with any existing and future OMA applications and/or services."},{"url":"http://www.openmobilealliance.org/release/OCSP/V1_0-20070403-A/OMA-ERP-OCSP_MP-V1_0-20070403-A.zip","file":"OMA-ERP-OCSP_MP-V1_0-20070403-A.zip","status":"Approved","version":"V1.0","date":"2007-04-03","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/OCSP/V1_0-20070403-A/OMA-WAP-OCSP_MP-V1_0-20070403-A.pdf","file":"OMA-WAP-OCSP_MP-V1_0-20070403-A.pdf","status":"Approved","version":"V1.0","date":"2007-04-03","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) is a consortium of mobile industry companies working to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the OMA is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation, OMA defines a set of protocols in transport, session and application layers. For additional information on the Wireless Application Environment, refer to [WAESPEC]. This specification defines a profile of the Online Certificate Status Protocol (OCSP) [RFC2560] for mobile environments.   OCSP defines a protocol used to determine the current status of a digital certificate in lieu of using standard Certificate Revocation Lists (CRL’s).  The scope of this work is to profile OCSP in such a way to ensure it can be used efficiently by limited wireless devices and to be interoperable with OCSP responders already available in the market.  This profile is defined as an OMA service enabler to ensure its use with any existing and future OMA applications and/or services."}]}}