{"input":{"cteatedAt":"2021-02-18T12:34:37.052Z","url":"http://www.openmobilealliance.org/release/OWSER/V1_1-20051220-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/OWSER/V1_1-20051220-C/OMA-AD-OWSER_Overview-V1_1-20051220-C.pdf","file":"OMA-AD-OWSER_Overview-V1_1-20051220-C.pdf","status":"Candidate","version":"V1.1","date":"2005-12-20","contentMediaType":"application/pdf","description":"This document, entitled \"OMA Web Services Enabler (OWSER): Overview,\" is part of a group of documents [OWSERSpec] and [OWSERBP] that together describe and specify components of the OMA Web Services Enabler (OWSER).  This OWSER Overview is informative and provides an overview of the OWSER and the Web Service technologies that will be used to publish, discover and use components that support Mobile Web Services in a secure manner. It is intended to complement the normative text found in the companion OWSER Specifications. The OMA Web Services Enabler defines the means by which OMA applications can be exposed, discovered and consumed using Web Services technologies.  The purpose of the OWSER is to provide designers of Web Services within OMA with solutions to common functionality using Web Services technologies.  Without such a framework, designers of Web Services within OMA would almost certainly try to solve these problems on their own, each in their own way.  Such an effort would inevitably lead to brittle implementations, interoperability problems, and increased time to market. The goals of the OWSER are consistent with those expressed in the OMA Service Enabler Strategy White Paper [OMASES]. The document entitled \"OMA Web Services Enabler (OWSER): Core Specifications\" [OWSERSpec] provides the specifications of the components needed to provide the capabilities of the OWSER as identified in this document, in particular the normative use of Web Service technologies to implement such capabilities.  The document entitled \"OMA Web Services Enabler (OSWER) Best Practices: WSDL Style Guide\" [OWSERBP] provides informative guidelines on the use of the Web Services Description Language [WSDL] that may be used by OMA-defined Web Services. While the normative definition of technologies specified in the OWSER is rightly provided in the specification documents themselves ([OWSERSpec] and the Overview provides some information on technologies which are considered to be within the scope or outside the scope of the current OWSER release.  In particular, Sections 7, 7.1, and 7.2.2 contain specific scope information."},{"url":"http://www.openmobilealliance.org/release/OWSER/V1_1-20051220-C/OMA-ERELD-OWSER-V1_1-20051220-C.pdf","file":"OMA-ERELD-OWSER-V1_1-20051220-C.pdf","status":"Candidate","version":"V1.1","date":"2005-12-20","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of the OMA Web Services Enabler (OWSER)  V1.1 according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/OWSER/V1_1-20051220-C/OMA-ERP-OWSER-V1_1-20051220-C.zip","file":"OMA-ERP-OWSER-V1_1-20051220-C.zip","status":"Candidate","version":"V1.1","date":"2005-12-20","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/OWSER/V1_1-20051220-C/OMA-RD-OWSER-V1_1-20051220-C.pdf","file":"OMA-RD-OWSER-V1_1-20051220-C.pdf","status":"Candidate","version":"V1.1","date":"2005-12-20","contentMediaType":"application/pdf","description":"This document provides OMA requirements for mobile web services  The requirements are primarily based on the use cases compiled by the Mobile Web Service Group. The  output  of  the  OMA  Architecture  use  cases,  OMA  REQ  use  cases  and  use  cases  produced  by  other  working  groups  further refined the requirements specified in this document. The requirements specified in this document shall be adhered to by all OMA Web Services: •OMA Web Services Enabler release •OMA service enablers exposing their capabilities as Web services Because the OMA MWS specifications in general provide web services realizations respectively of the OMA architecture and components of the OMA architecture (enablers), the present document has also implications on the OMA architecture and enabler specifications."},{"url":"http://www.openmobilealliance.org/release/OWSER/V1_1-20051220-C/OMA-TS-OWSER-Best_Practice_WSDL_Style_Guide-V1_1-20051220-C.pdf","file":"OMA-TS-OWSER-Best_Practice_WSDL_Style_Guide-V1_1-20051220-C.pdf","status":"Candidate","version":"V1.1","date":"2005-12-20","contentMediaType":"application/pdf","description":"This document provides informative information for the use of the WSDL that should be followed for OMA defined Web Services. The scope of content is consistent with the capabilities described in the OWSER Overview [OWSEROvw] and OWSER Core Specification [OWSERSpec] documents, and does not provide information beyond that required to support these capabilities. This is the first in a series of best practices that are expected to be produced as part of the OWSER. Through the use of these best practices, it is expected that there will be a coherent and consistent approach to the use of Web Services in an OMA environment."},{"url":"http://www.openmobilealliance.org/release/OWSER/V1_1-20051220-C/OMA-TS-OWSER_Core_Specification-V1_1-20051220-C.pdf","file":"OMA-TS-OWSER_Core_Specification-V1_1-20051220-C.pdf","status":"Candidate","version":"V1.1","date":"2005-12-20","contentMediaType":"application/pdf","description":"This document is part of a group of documents [OWSEROvw] [OWSERBP] that will be used to specify components of the OMA Web Services Enabler Release (OWSER). This document specifies the Web Service technologies that will be used to publish, discover and use these components in a secure, controlled and auditable manner. The OMA Web Services Enabler (OWSER) defines the means by which OMA applications can be exposed, discovered and consumed using Web Services technologies.  The purpose of the OWSER is to provide designers of Web Services within OMA with solutions to common functions using Web Services technologies.  Without such a framework, designers of Web Services within OMA would almost certainly try to solve these problems on their own, each in their own way.  Such an effort would inevitably lead to brittle implementations, interoperability problems, and increased time to market. These goals are consistent with those expressed in the OMA Service Enabler Strategy White Paper [OMASES].  The OMA Web Services Enabler (OWSER): Overview document [OWSEROvw] provides the rationale for using Web Services and an overview of the technologies to implement a set of identified common functions that are expected to be available to all OMA applications. The OMA Web Services Enabler (OWSER) Best Practices: WSDL Style Guide [OWSERBP] provides non-normative information on the use of WSDL that may be used by OMA-defined Web Services. This document provides the specifications of the components needed to provide the capabilities of the OWSER as identified in [OWSEROvw], in particular the normative use of Web Service technologies to implement such capabilities.  Ths document is intended to provide normative guidance to designers of specific OMA Web Services and implementers thereof. Therefore, material of a tutorial nature is kept to a minimum.  Not all components of the OWSER are specified in this version (1.0) of the document. This version specifies technologies that will enable applications acting in the role of Web Service Requesters (WSR) to access services offered by Web Service providers (WSP). No restriction is placed on the types of computing devices – mobile terminals, personal computers, servers etc. – that can be WSRs or WSPs, so long as they are capable of supporting the technologies specified in this document. Future versions of this specification will provide additional functionality to complete the full range of capabilities offered by the OWSER."}]}}