{"input":{"cteatedAt":"2021-02-18T13:07:36.424Z","url":"http://www.openmobilealliance.org/release/SCWS/V1_1-20090512-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SCWS/V1_1-20090512-A/OMA-AD-Smartcard_Web_Server-V1_0-20080421-A.pdf","file":"OMA-AD-Smartcard_Web_Server-V1_0-20080421-A.pdf","status":"Approved","version":"V1.0","date":"2008-04-21","contentMediaType":"application/pdf","description":"The  Smartcard  enables  network  operators  to  provide network  security  to  their  customers  and  as  a  platform  to  run  their services. Several standardization bodies develop smart card toolkit standards in order to fulfill these requirements. The Smart Card Web Server (SCWS) intends to enable smart card issuers (e.g. Mobile Network Operators) to offer static or dynamic web pages. One operator centric example could be pages generated by applications running in the smart card (e.g. SIM, UICC  or  R-UIM),  enabling local access  to content (e.g. questionnaires, FAQs) or security-oriented services requiring keys stored in the smart card.  All these services will be accessible via a Web browser. This document is an architecture document for the SCWS Enabler (work item presented in [SCWS WID]). It depicts the functionality, interfaces and information flow that is needed to address the requirements related to this work item as described in the Smartcard Web Server Requirements document [SCWS-RD]. This work item addresses the interfaces needed to access and use a web server in the smart card, the HTTP profile that need to be implemented and the access control to this SCWS. The web server implementation in the smart card is considered out of the scope for this release so this document does not describe the SCWS internal entities within such an implementation."},{"url":"http://www.openmobilealliance.org/release/SCWS/V1_1-20090512-A/OMA-ERELD-Smartcard_Web_Server-V1_1-20090512-A.pdf","file":"OMA-ERELD-Smartcard_Web_Server-V1_1-20090512-A.pdf","status":"Approved","version":"V1.1","date":"2009-05-12","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Smartcard Web Server (SCWS) v1.1 according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/SCWS/V1_1-20090512-A/OMA-ERP-SCWS-V1_1-20090512-A.Zip","file":"OMA-ERP-SCWS-V1_1-20090512-A.Zip","status":"Approved","version":"V1.1","date":"2009-05-12","contentMediaType":"Unsiported Content Media type .Zip"},{"url":"http://www.openmobilealliance.org/release/SCWS/V1_1-20090512-A/OMA-EVP-Smartcard_Web_Server-V1_1-20090512-A.pdf","file":"OMA-EVP-Smartcard_Web_Server-V1_1-20090512-A.pdf","status":"Approved","version":"V1.1","date":"2009-05-12","contentMediaType":"application/pdf","description":"This document details the Validation plan for the Smartcard-Web-Server 1.1 Enabler Release.  The successful accomplishment of the validation activities will be required for the Enabler to be considered for Approved status.  The validation plan for the Smartcard-Web-Server 1.1 Enabler Release specifications is based on testing expectations in the Enabler Test Requirements (ETR).  While the specific test activities to be performed are described in the Enabler Test Specification (ETS) the test environment is described in this plan.  This test environment details infrastructure, operational and participation requirements identified for the needed testing activities. 1.1     Assumptions None. 1.2     Exclusions None."},{"url":"http://www.openmobilealliance.org/release/SCWS/V1_1-20090512-A/OMA-RD-Smartcard_Web_Server-V1_0-20080421-A.pdf","file":"OMA-RD-Smartcard_Web_Server-V1_0-20080421-A.pdf","status":"Approved","version":"V1.0","date":"2008-04-21","contentMediaType":"application/pdf","description":"Network operators aim to improve the user experience when using network operator services in the smart card. The OMA-SEC Smart Card Technology sub-working group (SEC-SCT) has identified these requirements and proposes a solution with the Smart Card Web Server (SCWS). The SCWS enables smart card issuers to offer static or dynamic web pages. One network operator centric example could be pages generated by applications running in the smart card (e.g. SIM, UICC or R-UIM), enabling access to content (e.g. questionnaires, FAQs) or security-oriented services requiring keys that are stored in the smart card.  All these services will be accessible via a web browser in the device. This document is a requirement document for the work item presented in [SCWS WID]."},{"url":"http://www.openmobilealliance.org/release/SCWS/V1_1-20090512-A/OMA-TS-Smartcard_Web_Server-V1_1-20090512-A.pdf","file":"OMA-TS-Smartcard_Web_Server-V1_1-20090512-A.pdf","status":"Approved","version":"V1.1","date":"2009-05-12","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks. This specification defines the interfaces to an HTTP server in a smart card (i.e. Smart Card Web Server), which is embedded in a mobile device (e.g. SIM, (U)SIM, UICC, R-UIM, CSIM). These interfaces cover the following aspects: • The URL to access the Smart Card Web Server (SCWS) • The transport protocol that is used to enable the communication between HTTP applications in the device and the Smart Card Web Server • The HTTP profile that the Smart Card Web Server needs to implement • A secure remote administration protocol for the Smart Card Web Server • User, or principal, authentication with the Smart Card Web Server and related security protocols It is important to note that the Smart Card Web Server can be administrated only by the smart card issuer (e.g. Mobile Network Operator) or a delegated authorized entity. This clearly sets the scope of ownership and roles for the remote administration and services that are deployed via the Smart Card Web Server."}]}}