{"input":{"cteatedAt":"2021-02-18T13:08:15.794Z","url":"http://www.openmobilealliance.org/release/SCWS/V1_2-20110111-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SCWS/V1_2-20110111-C/OMA-AD-Smartcard_Web_Server-V1_2-20110111-C.pdf","file":"OMA-AD-Smartcard_Web_Server-V1_2-20110111-C.pdf","status":"Candidate","version":"V1.2","date":"2011-01-11","contentMediaType":"application/pdf","description":"The  Smart  Card  enables  network  operators  to  provide  network  security  to  their  customers  and  as  a  platform  to  run  their  services. Several standardization bodies develop Smart Card toolkit standards in order to fulfill these requirements. The Smart Card Web Server (SCWS) intends to enable Smart Card Issuers (e.g. Mobile Network Operators) to offer static or dynamic web pages. One operator centric example could be pages generated by applications running in the Smart Card (e.g. SIM, UICC or R-UIM), enabling local access to content (e.g. questionnaires, FAQs) or security-oriented services requiring keys stored in the Smart Card.  All these services will be accessible via a Web browser. This document is an architecture document for the SCWS Enabler (work item presented in [SCWS WID]). It depicts the functionality, interfaces and information flow that is needed to address the requirements related to this work item as described in the Smartcard Web Server Requirements document [SCWS-RD]. This work item addresses the interfaces needed to access and use a web server in the Smart Card, the HTTP profile that need to be implemented and the access control to this SCWS. The web server implementation in the Smart Card is considered out of the scope for this release so this document does not describe the SCWS internal entities within such an implementation."},{"url":"http://www.openmobilealliance.org/release/SCWS/V1_2-20110111-C/OMA-ERELD-Smartcard_Web_Server-V1_2-20110111-C.pdf","file":"OMA-ERELD-Smartcard_Web_Server-V1_2-20110111-C.pdf","status":"Candidate","version":"V1.2","date":"2011-01-11","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Smart Card Web Server (SCWS) v1.2 according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/SCWS/V1_2-20110111-C/OMA-ERP-Smartcard_Web_Server-V1_2-20110111-C.zip","file":"OMA-ERP-Smartcard_Web_Server-V1_2-20110111-C.zip","status":"Candidate","version":"V1.2","date":"2011-01-11","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SCWS/V1_2-20110111-C/OMA-RD-Smartcard_Web_Server-V1_2-20110111-C.pdf","file":"OMA-RD-Smartcard_Web_Server-V1_2-20110111-C.pdf","status":"Candidate","version":"V1.2","date":"2011-01-11","contentMediaType":"application/pdf","description":"Network operators aim to improve the user experience when using network operator services in the Smart Card. The OMA-SEC Smart Card Technology sub-working group (SEC-SCT) has identified these requirements and proposes a solution with the Smart Card Web Server (SCWS). The SCWS enables Smart Card issuers to offer static or dynamic web pages. One network operator centric example could be pages generated by applications running in the Smart Card (e.g. SIM, UICC or R-UIM), enabling access to content (e.g. questionnaires, FAQs) or security-oriented services requiring keys that are stored in the Smart Card.  All these services will be accessible via a web browser in the device. This document is a requirement document for the work item presented in [SCWS WID]."}]}}