{"input":{"cteatedAt":"2021-02-18T15:24:50.038Z","url":"http://www.openmobilealliance.org/release/vObject/V1_0-20071002-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/vObject/V1_0-20071002-A/OMA-ERELD-vObject-V1_0-20071002-A.pdf","file":"OMA-ERELD-vObject-V1_0-20071002-A.pdf","status":"Approved","version":"V1.0","date":"2007-10-02","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of vObject minimum interoperability profile V1.0 according to OMA Release process and the Enabler Release specification baseline listed in section Error! Reference source not found..The vObject enabler defines vObject(vCard, vCalendar, vBookmark) minimum interoperbility profile and implementation guideline to ensure consistent and unambigous interpretation of the relevant base specifications vCard2.1, vCalendar1.0 and vBookmark1.0."},{"url":"http://www.openmobilealliance.org/release/vObject/V1_0-20071002-A/OMA-ERP-vObject-V1_0-20071002-A.zip","file":"OMA-ERP-vObject-V1_0-20071002-A.zip","status":"Approved","version":"V1.0","date":"2007-10-02","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/vObject/V1_0-20071002-A/OMA-RD-vObjectOMAProfile-V1_0-20071002-A.pdf","file":"OMA-RD-vObjectOMAProfile-V1_0-20071002-A.pdf","status":"Approved","version":"V1.0","date":"2007-10-02","contentMediaType":"application/pdf","description":"This document presents the use cases and requirements for developing a vObject minimum interoperability profile based on the vCard 2.1, vCalendar 1.0 and vBookmark1.0 specifications along with guidelines to ensure a consistent, non-ambiguous interpretation of the relevant base specifications. It is not the purpose of this document to address any OMA enabler requirements which might result in proposing extensions or modifications to any of the specifications mentioned above. It is recognized that existing and new applications will introduce such vObject requirements. It is expected that these requirements will be addressed by a complementary OMA activity focusing on a longer term interoperability solution. Interoperability of vObjects covers a range of issues. It is the intention of the vObject minimum interoperability profile to address the issues of physical data formatting for these objects as well as specifying a standard presentation for commonly used data properties. These issues have been identified as a  subset of the larger set of interoperability; it does not attempt to address all the interoperability issues known to exist with the specifications."},{"url":"http://www.openmobilealliance.org/release/vObject/V1_0-20071002-A/OMA-TS-vObjectOMAProfile-V1_0-20071002-A.pdf","file":"OMA-TS-vObjectOMAProfile-V1_0-20071002-A.pdf","status":"Approved","version":"V1.0","date":"2007-10-02","contentMediaType":"application/pdf","description":"This document defines the vObject minimum interoperability profile based on the vCard 2.1, vCalendar 1.0 and vBookmark1.0 specifications. This document also serves as an implementation guideline to ensure consistent and unambiguous interpretation of the relevant base specifications. This specification is aimed at the mobile communications community to foster interoperability across different terminals, platforms, and user agents.  The vObject minimum interoperability profile is to be used in following use cases •vObject exchange between mobile terminals (peer-to-peer) via local interface e.g. Bluetooth, infrared  •vObject attached to an email or a MMS message •vObject downloading from a web server The enablement of applications and advanced function such as data synchronization requires additional metadata and/or mechanism when sending updated vObjects. For this specification, the enablement of such features is out of scope. It is expected that these advance functions will be addressed by a complementary OMA activity focusing on a longer term interoperability solution. Ambiguities in the vCard2.1, vCalendar1.0 and vBookmark1.0 specifications coupled with the lack of well-known implementation guidelines has led to various commercial implementations that result in interoperability problems. For instance, vCard2.1, vCalendar1.0 and vBookmark1.0 provide several options for content types and file extensions definitions but without defining mandatory support, vCard2.1 allows both ISO 8601basic and extended format to specify date and time, the minimum size of the vObject is not defined and etc.  Therefore the objectives of this specification are three fold. •to define a set of vObject conformance •to constrain the implementation choices from original vCard2.1, vCalendar1.0 and vBookmark1.0 specifications •to clarify the ambiguities of the syntax contained in those specifications. Interoperability of vObjects covers a range of issues. It is the intention of this specification to address the issues of physical data formatting for these objects as well as specifying a standard presentation for commonly used data properties. These issues have been identified as a subset of the larger set of interoperability; it does not attempt to address all the interoperability issues known to exist with the specifications."}]}}