{"input":{"cteatedAt":"2021-02-17T22:16:32.962Z","url":"http://www.openmobilealliance.org/release/ISC/V1_0-20131015-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/ISC/V1_0-20131015-C/OMA-AD-ISC-V1_0-20131015-C.pdf","file":"OMA-AD-ISC-V1_0-20131015-C.pdf","status":"Candidate","version":"V1.0","date":"2013-10-15","contentMediaType":"application/pdf","description":"This document defines the architecture for the Immersive Social Centre (ISC) Enabler. This document describes the architecture to fulfill all the requirements specified by the Requirements Document [OMA-ISC-RD] for the ISC Enabler 1.0. The description of the architecture comprises the definition of the functional components and the interfaces used or exposed by these components. In addition, this document identfies the relationship to external functional components that are utilized by the ISC Enabler."},{"url":"http://www.openmobilealliance.org/release/ISC/V1_0-20131015-C/OMA-ERELD-ISC-V1_0-20131015-C.pdf","file":"OMA-ERELD-ISC-V1_0-20131015-C.pdf","status":"Candidate","version":"V1.0","date":"2013-10-15","contentMediaType":"application/pdf","description":"The scope of this document is given by the Enabler Release Definition of Immersive Social Centre (ISC) enabler according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The ISC Enabler defines a service-level framework  providing a standardized integration of content viewing and communication experience. This includes the use of multiple devices (e.g. smartphones, TV, tablets, PC) in order to enable an immersive (“being there”and “being with”) experience. The scope of the enabler covers the specification of a common interface between clients and servers and between servers to ensure interoperability. This includes a description of an architecture in order to support all defined requirements and to support all necessary entities to ensure enriched communication between them and external applications."},{"url":"http://www.openmobilealliance.org/release/ISC/V1_0-20131015-C/OMA-ERP-ISC-V1_0-20131015-C.zip","file":"OMA-ERP-ISC-V1_0-20131015-C.zip","status":"Candidate","version":"V1.0","date":"2013-10-15","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/ISC/V1_0-20131015-C/OMA-RD-ISC-V1_0-20130402-C.pdf","file":"OMA-RD-ISC-V1_0-20130402-C.pdf","status":"Candidate","version":"V1.0","date":"2013-04-02","contentMediaType":"application/pdf","description":"The Requirement Document (RD) contains the requirements for the Immersive Social Centre (ISC) Enabler. The aim is to comprise all requirements for a service-level framework to enable a standardized integration of content viewing and communication experience. This includes enhancing user experience with new features, the use of multiple devices (e.g. smartphones, TV, tablets, PC) in order to provide an immersive (“being there” and “being with”) experience. High-level requirements and overall system requirements as well as several use cases which provide examples of ISC services that should be enabled are specified."}]}}