{"input":{"cteatedAt":"2021-02-18T12:18:38.271Z","url":"http://www.openmobilealliance.org/release/M2M_Device_Classification/V1_0-20120612-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/M2M_Device_Classification/V1_0-20120612-C/OMA-RRELD-M2M_Device_Classification-V1_0-20120612-C.pdf","file":"OMA-RRELD-M2M_Device_Classification-V1_0-20120612-C.pdf","status":"Candidate","version":"V1.0","date":"2012-06-12","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of the M2M Device Classification White Paper Reference Release according to OMA Release process and the Reference Release document baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/M2M_Device_Classification/V1_0-20120612-C/OMA-RRP-M2M_Device_Classification-V1_0-20120612-C.zip","file":"OMA-RRP-M2M_Device_Classification-V1_0-20120612-C.zip","status":"Candidate","version":"V1.0","date":"2012-06-12","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/M2M_Device_Classification/V1_0-20120612-C/OMA-WP-M2M_Device_Classification-20120612-C.pdf","file":"OMA-WP-M2M_Device_Classification-20120612-C.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document is to provide a Machine-to-Machine (M2M) device classification framework based on the horizontal attributes (e.g., wide area communication interface, local area communication interface, IP stack, human I/O capabilities, persistent configuration storage) of interest to communication service providers (CSPs) and M2M service providers (MSPs), independent of vertical markets, such as smart grid, connected cars, e-health, smart home, etc.  The objective of the M2M device classification is to enable the M2M industry to group a large and ever increasing number of M2M devices into a manageable number of classes so that M2M device management and service protocols, methods, and procedures can be systematically analyzed for re-useability and incrementally developed for the gaps in handling the M2M device classes not fully addressed by existing standards.  The classification scheme could help not only clarify the scope and requirements of M2M related work in OMA, but also articulate its linkage with all other M2M related standard development organizations (SDOs) to avoid overlapping and facilitate coordination related to M2M. It also enables integration of M2M services and management across the boundaries of vertical markets.  Once the white paper is completed, it can be used as a tool to analyze the applicability of existing requirements and specifications developed by OMA and other cooperative standards development organizations (SDOs) on various M2M devices based on the device classification scheme. It can also be used to identify the requirement and specification areas that need to be qualified or enhanced for the M2M device classes which are not well addressed by the current standards."}]}}