{"input":{"cteatedAt":"2021-02-18T13:03:31.385Z","url":"http://www.openmobilealliance.org/release/RME/V1_0-20050923-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/RME/V1_0-20050923-C/OMA-RD-Rich-Media-Environment-V1_0-20050923-C.pdf","file":"OMA-RD-Rich-Media-Environment-V1_0-20050923-C.pdf","status":"Candidate","version":"V1.0","date":"2005-09-23","contentMediaType":"application/pdf","description":"This work takes into account the global environment of the mobile industry in the field of enhanced rich-media services: from rich-media content and service creation, deployment, diffusion and display.   By enhanced rich-media services we understand:  - Services aggregating in a single interface any kind of content (graphics, text, audio, video) allowing: •Arendering and behaviour of the service on the device conforming with the developer wishes and adaptable to the end-user device characteristics (screen size, input...) •A progressive rendering and fast display of data: there should always be something going on the terminal. •An intuitive and easy user interaction with the content for navigation.  •A frame-accurate synchronisation of content, stream and interaction. •Receiving data from various networks at the same time and displaying all together in a single service interface. - Service logic based on client server real-time interaction with: •Dynamic  updates  of  content  and  interface  triggered  by  the  service  logic  and/or  by  end-user  requests  without  reloading a complete interface to provide to the end-user low latency and a best quality of service. •Adding data at any time in the delivery process, even to an already started progressive download, to decrease end-user latency. •Managing  data  both  on  client  and  server  side  for  storage  and  temporal  live  cycle  of  data  in  conformance  with  the  logic and delivery of the service. •Packaging data in a convenient way to decrease network requests and server resources. Such rich-media services remain network, device, OS and codec independent.   The objectives of this work are: •describing use-cases and new requirements that will lead to improved end-user experience through use of enhanced rich-media services  •defining requirements to optimise rich-media services  •identifying new functionality to enable the support of enhance rich-media services on existing devices •if necessary, identifying the need of new OMA enablers to realize such use cases and requirement •releasing a requirements document for rich-media content services which will be released as a public document."}]}}