{"input":{"cteatedAt":"2021-02-18T13:03:40.372Z","url":"http://www.openmobilealliance.org/release/RME/V1_0-20110329-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/RME/V1_0-20110329-A/OMA-AD-RME-V1_0-20110329-A.pdf","file":"OMA-AD-RME-V1_0-20110329-A.pdf","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/pdf","description":"The Rich Media Environment addresses enhanced rich media services: defining the environment from rich-media content and service creation, through deployment, distribution and presentation.  The objective of this document is the definition of the architecture for the rich media environment to meet the requirements defined in the Rich Media Environment Requirements Document [RME-RD]."},{"url":"http://www.openmobilealliance.org/release/RME/V1_0-20110329-A/OMA-ERELD-RME-V1_0-20110329-A.pdf","file":"OMA-ERELD-RME-V1_0-20110329-A.pdf","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Rich Media Environment (RME) according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/RME/V1_0-20110329-A/OMA-ERP-RME-V1_0-20110329-A.zip","file":"OMA-ERP-RME-V1_0-20110329-A.zip","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/RME/V1_0-20110329-A/OMA-RD-Rich-Media-Environment-V1_0-20110329-A.pdf","file":"OMA-RD-Rich-Media-Environment-V1_0-20110329-A.pdf","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/pdf","description":"This work takes into account the global environment of the mobile industry in the field of enhanced rich-media services: from rich-media content and service creation, deployment, diffusion and display.   By enhanced rich-media services we understand:  - Services aggregating in a single interface any kind of content (graphics, text, audio, video) allowing: •Arendering and behaviour of the service on the device conforming with the developer wishes and adaptable to the end-user device characteristics (screen size, input...) •A progressive rendering and fast display of data: there should always be something going on the terminal. •An intuitive and easy user interaction with the content for navigation.  •A frame-accurate synchronisation of content, stream and interaction. •Receiving data from various networks at the same time and displaying all together in a single service interface. - Service logic based on client server real-time interaction with: •Dynamic  updates  of  content  and  interface  triggered  by  the  service  logic  and/or  by  end-user  requests  without  reloading a complete interface to provide to the end-user low latency and a best quality of service. •Adding data at any time in the delivery process, even to an already started progressive download, to decrease end-user latency. •Managing  data  both  on  client  and  server  side  for  storage  and  temporal  live  cycle  of  data  in  conformance  with  the  logic and delivery of the service. •Packaging data in a convenient way to decrease network requests and server resources. Such rich-media services remain network, device, OS and codec independent.   The objectives of this work are: •describing use-cases and new requirements that will lead to improved end-user experience through use of enhanced rich-media services  •defining requirements to optimise rich-media services  •identifying new functionality to enable the support of enhance rich-media services on existing devices •if necessary, identifying the need of new OMA enablers to realize such use cases and requirement •releasing a requirements document for rich-media content services which will be released as a public document."},{"url":"http://www.openmobilealliance.org/release/RME/V1_0-20110329-A/OMA-TS-RME-V1_0-20110329-A.pdf","file":"OMA-TS-RME-V1_0-20110329-A.pdf","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/pdf","description":"The Scope of this document is to specify all the components, interfaces and functionalities needed by the Rich-Media Environment Enabler, according to the [RME_RD] and the [RME_AD] documents.  A joint work has been agreed to define the RME enabler with the 3GPP SA4 working group. As a consequence the RME TS is based on the 3GPP SA4 Dynamic and Interactive Multimedia Scene [DIMS]  The objectives of this document, detailed below, are: •To complement [DIMS] in OMA specific areas  •To ensure compliancy and compatibility with [DIMS] •To fulfill RME Requirements not taken in account by [DIMS] •To ensure RME will remain bearer agnostic and usable outside of 3GPP networks Specific OMA areas In addition to the RME requirements not fulfilled by [DIMS] or fulfilled in a 3GPP specific manner, the RME specification needs to complement [DIMS] in areas owned by OMA such as:  •Specific functions (e.g. Soft key mapping, event handling and fonts) •Overall Processing Model •UAProf vocabulary •Integration with other OMA enablers •Alignment with related mark-up languages (e.g. XHTML). Compliance with DIMS A coordination process has been pursued with the 3GPP SA4 working group since the delivery of the OMA RD document. The intent between the BT-MAE and 3GPP SA4 is to develop a common Core Rich-Media specification usable on any bearer, but well adapted to 3GPP networks. In order to avoid market fragmentation, the RME TS will reference the [DIMS] specification in sections related to the core common rich-media specification and will specify additional features when needed for the OMA environment. The RME TS is defined as a superset of [DIMS]. DIMS and RME share the same MIME type definition: video/richmedia+xml for stream-based RTP transport of rich media data. RME requirements not taken in account by DIMS When developing DIMS, the 3GPP SA4 working group has delivered the document [DIMS REQ] which adapted the RME requirements to DIMS needs. In particular Annex A of [DIMS REQ] lists all the RME requirements not taken in account for the [DIMS] specification development. The RME specification should define the complementary text for these requirements. Usage of RME outside of 3GPP networks/environment The RME requirement document states that the RME enabler is agnostic of any bearers, networks, OSs, etc. [DIMS] is not totally agnostic of “any” bearers outside of 3GPP networks and environment.  RME intends to maximize the usage of common technologies across various environments where possible. The RME specification needs to provide equivalent functionalities to [DIMS] for non 3GPP environment, e.g.: 3GPP2, DVB, OMA-PUSH."},{"url":"http://www.openmobilealliance.org/release/RME/V1_0-20110329-A/OMA-WP-Rich_Media_Environment-20110329-A.pdf","file":"OMA-WP-Rich_Media_Environment-20110329-A.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":""}]}}