{"input":{"cteatedAt":"2021-02-18T13:12:16.798Z","url":"http://www.openmobilealliance.org/release/SRM/V1_0-20090310-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SRM/V1_0-20090310-A/OMA-AD-SRM-V1_0-20090310-A.pdf","file":"OMA-AD-SRM-V1_0-20090310-A.pdf","status":"Approved","version":"V1.0","date":"2009-03-10","contentMediaType":"application/pdf","description":"The scope of OMA \"Secure Removable Media\" is to enable the use of Secure Removable Media by allowing users the ability, for example, to transfer Rights to and from a trusted SRM and to consume Rights from the SRM. This enabler extends the OMA DRM specifications to provide mechanisms for the secure transfer of Rights between a DRM Agent and an SRM Agent including their mutual authentication."},{"url":"http://www.openmobilealliance.org/release/SRM/V1_0-20090310-A/OMA-ERELD-SRM-V1_0-20090310-A.pdf","file":"OMA-ERELD-SRM-V1_0-20090310-A.pdf","status":"Approved","version":"V1.0","date":"2009-03-10","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Secure Removable Media 1.0 according to OMA Release process and the Enabler Release specification baseline listed in section 6."},{"url":"http://www.openmobilealliance.org/release/SRM/V1_0-20090310-A/OMA-ERP-SRM-V1_0-20090310-A.zip","file":"OMA-ERP-SRM-V1_0-20090310-A.zip","status":"Approved","version":"V1.0","date":"2009-03-10","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SRM/V1_0-20090310-A/OMA-RD-SRM-V1_0-20090310-A.pdf","file":"OMA-RD-SRM-V1_0-20090310-A.pdf","status":"Approved","version":"V1.0","date":"2009-03-10","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks. The scope of OMA “Digital Rights Management” (DRM) is to enable the distribution and consumption of digital content in a controlled manner. The content is distributed and consumed on authenticated Devices per the usage rights expressed by the content owners. This specification defines the requirement for the OMA DRM based Secure Removable Media to extend the OMA DRM 2.0 to enable the use of OMA DRM based Secure Removable Media.  OMA DRM with Secure Removable Media enables the protection and consumption of digital content and its usage rights in Secure Removable Media in a secure manner. This specification is not stand-alone; it must be interpreted in the context of the existing OMA DRM v2.0 suite of specifications."},{"url":"http://www.openmobilealliance.org/release/SRM/V1_0-20090310-A/OMA-TS-SRM-V1_0-20090310-A.pdf","file":"OMA-TS-SRM-V1_0-20090310-A.pdf","status":"Approved","version":"V1.0","date":"2009-03-10","contentMediaType":"application/pdf","description":"The scope of OMA “Secure Removable Media” is to enable the use of the Secure Removable Media based on the OMA DRM version 2.0. This specification defines mechanisms and protocols necessary to implement the Secure Removable Media and the extended part of the OMA DRM version 2.0 system to enable the use of the Secure Removable Media."}]}}