{"input":{"cteatedAt":"2021-02-17T22:12:23.144Z","url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/GPM_PEM1InputTemplate-V1_0.xsd","file":"GPM_PEM1InputTemplate-V1_0.xsd","status":"","version":"","date":"","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/GPM_PEM1OutputTemplate-v1_0.xsd","file":"GPM_PEM1OutputTemplate-v1_0.xsd","status":"","version":"","date":"","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/OMA-AD-GPM-V1_0-2009331-C.pdf","file":"OMA-AD-GPM-V1_0-2009331-C.pdf","status":"Candidate","version":"V1.0","date":"","contentMediaType":"application/pdf","description":"The Global Permissions Management (GPM) enabler provides generic permissions checking and permissions management, which can be used by other resources (e.g. OMA service enablers). This document provides the architecture for the GPM enabler. The role of the GPM enabler is to specify how authorized principals are managing the permission rules that determine if, when, how and to what extent information about end-users of OMA enabled services (i.e. Permissions Target) is released to Target Attribute Requesters and Consumers, (e.g. applications, enablers or other end-users), and to specify how permissions checking requests for release of information are defined and processed. The scope of the Global Permissions Management architecture document is to define the architecture for the Global Permissions Management enabler based on the requirements as described in the Global Permissions Management Requirements Document [GPM-RD]. The scope of this Architecture Document does not include general authorization architecture for verifying access to resources or services."},{"url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/OMA-ERELD-GPM-V1_0-20090331-C.pdf","file":"OMA-ERELD-GPM-V1_0-20090331-C.pdf","status":"Candidate","version":"V1.0","date":"2009-03-31","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of GPM according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/OMA-ERP-GPM-V1_0-20090331-C.zip","file":"OMA-ERP-GPM-V1_0-20090331-C.zip","status":"Candidate","version":"V1.0","date":"2009-03-31","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/OMA-RD-GPM-V1_0-20090331-C.pdf","file":"OMA-RD-GPM-V1_0-20090331-C.pdf","status":"Candidate","version":"V1.0","date":"2009-03-31","contentMediaType":"application/pdf","description":"This  document  provides  use  cases  and  requirements  for  a  Global  Permissions  Management  (GPM)  enabler  that  allows  principals  to  manage  the  permission  rules  that  determine  if,  when,  how  and  to  what  extent  information  about  end-users  of  OMA enabled services (i.e. Permissions Target) is released to Target Attribute Requesters and –Consumers, e.g. applications, enablers or other end-users. GPM would protect information about end-users being requested by other resources as well. OMA service enablers that enable presence and location services already have specific requirements on how principal related information  is  released.  GPM  provides  generic  permissions  checking  and  permissions  management,  which  can  be  used  by  other  resources  (e.g.  OMA  service  enablers).  Therefore,  the  requirements  contained  in  this  document  are  limited  to  those  generic aspects, e.g. defining the types of permissions, the storage, management, provisioning and re-use of such permissions and of introducing the notion of notifying a Permissions Target of any changes to permissions and of getting users consent to those changes.   The scope of this RD does not include requirements for authorization to access services or service enablers. GPM specifically excludes authorization of an entity accessing another entity.  The scope of this RD is focused on determining whether a user attribute can be accessed for a particular usage, as well as the management of permissions rules and other specific functions including interaction with the user.  Note that this does not prevent the GPM enabler from making use of other generic functions or enablers when its architecture is  described  or  when  it  is  implemented,  if  they  satisfy  the  GPM  requirements.  Neither  does  it  prevent  other  enablers  from  using the GPM enabler whenever needed to perform the specific functions that the latter will provide."},{"url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/OMA-SUP-XSD_GPM_PEM1InputTemplate-V1_0-20090331-C.txt","file":"OMA-SUP-XSD_GPM_PEM1InputTemplate-V1_0-20090331-C.txt","status":"Candidate","version":"V1.0","date":"2009-03-31","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/OMA-SUP-XSD_GPM_PEM1OutputTemplate-V1_0-20090331-C.txt","file":"OMA-SUP-XSD_GPM_PEM1OutputTemplate-V1_0-20090331-C.txt","status":"Candidate","version":"V1.0","date":"2009-03-31","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/GPM/V1_0-20090331-C/OMA-TS-GPM-V1_0-20090331-C.pdf","file":"OMA-TS-GPM-V1_0-20090331-C.pdf","status":"Candidate","version":"V1.0","date":"2009-03-31","contentMediaType":"application/pdf","description":"The Global Permissions Management (GPM) enabler provides generic permissions checking and permissions management, which can be used by other resources (e.g. OMA service enablers). This document provides the technical specification for the GPM enabler. The scope of this GPM technical specification is to define how the GPM enabler extends the PEM-1 interface for permissions rule checking and the PEM-2 interface for permissions rule management. One or both of the PEL options may be used for Permissions Rules, without extending the PEL options."}]}}