{"input":{"cteatedAt":"2021-02-17T21:52:31.846Z","url":"http://www.openmobilealliance.org/release/ClientProv/V1_1-20080226-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/ClientProv/V1_1-20080226-C/OMA-ERELD-ClientProvisioning-V1_1-20080226-C.pdf","file":"OMA-ERELD-ClientProvisioning-V1_1-20080226-C.pdf","status":"Candidate","version":"V1.1","date":"2008-02-26","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Client Provisioning version 1.1 according to Open Mobile Alliance Release process and the documents listed in section 0. The Open Mobile Alliance continues the work of the WAP Forum to define a set of specifications to be used by service applications. Provisioning is the process by which a WAP client is configured with a minimum of user interaction. The term covers both over the air (OTA) provisioning and provisioning by means of, e.g., SIM cards."},{"url":"http://www.openmobilealliance.org/release/ClientProv/V1_1-20080226-C/OMA-ERP-ClientProvisioning-V1_1-20080226-C.zip","file":"OMA-ERP-ClientProvisioning-V1_1-20080226-C.zip","status":"Candidate","version":"V1.1","date":"2008-02-26","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/ClientProv/V1_1-20080226-C/OMA-WAP-ProvArch-v1_1-20080226-C.pdf","file":"OMA-WAP-ProvArch-v1_1-20080226-C.pdf","status":"Candidate","version":"V1.1","date":"2008-02-26","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The Open Mobile Alliance continues the work of the WAP Forum to define a set of specifications to be used by service applications. For information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Provisioning is the process by which a WAP client is configured with a minimum of user interaction. The term covers both over the air (OTA) provisioning and provisioning by means of, e.g., smart cards. This specification defines the architecture of the provisioning process. The specification is an informative document."},{"url":"http://www.openmobilealliance.org/release/ClientProv/V1_1-20080226-C/OMA-WAP-ProvBoot-v1_1-20080226-C.pdf","file":"OMA-WAP-ProvBoot-v1_1-20080226-C.pdf","status":"Candidate","version":"V1.1","date":"2008-02-26","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for Open Mobile Alliance is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation WAP Forum defines a set of protocols in transport, security, transaction, session and application layers. For additional information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. Provisioning is the process by which a WAP client is initially configured with connectivity and application access parameters.  The provisioning process also includes subsequent updates of persistent information in WAP client devices as well as retrieval of management information stored on WAP client devices. The term covers both OTA provisioning and provisioning by means of, e.g., smart cards. This specification defines a part of the provisioning process, namely, the bootstrap process, which is an OTA mechanism used to initially provision unconfigured WAP clients when, e.g., a smart card containing WAP provisioning information is not available."},{"url":"http://www.openmobilealliance.org/release/ClientProv/V1_1-20080226-C/OMA-WAP-ProvUAB-v1_1-20080226-C.pdf","file":"OMA-WAP-ProvUAB-v1_1-20080226-C.pdf","status":"Candidate","version":"V1.1","date":"2008-02-26","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The Open Mobile Alliance continues the work of the WAP Forum to define a set of specifications to be used by service applications. For information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. Provisioning is the process by which a WAP client is configured with a minimum of user interaction. This specification defines user agent behaviour relating to provisioning. For an overview of the WAP provisioning architecture, see [PROVARCH]."},{"url":"http://www.openmobilealliance.org/release/ClientProv/V1_1-20080226-C/OMA-WAP-TS-ProvCont-v1_1-20080226-C.pdf","file":"OMA-WAP-TS-ProvCont-v1_1-20080226-C.pdf","status":"Candidate","version":"V1.1","date":"2008-02-26","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The Open Mobile Alliance continues the work of the WAP Forum to define a set of specifications to be used by service applications. For information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. Provisioning is the process by which a WAP client is configured with a minimum of user interaction. The term covers both OTA provisioning and provisioning by means of, e.g., smart cards. A WAP client may, for example, be provisioned with connectivity and application information by pushing configuration parameters over the air from a server to a WAP client. This specification defines the content encoding by what configuration parameters are presented to the WAP client in the provisioning framework. The content encoding is defined in terms of binary XML [WBXML] and is interpreted and handled at the application level of the WAP architecture. However, the handling and use of provisioned information is outside the scope of this specification. For an overview of the provisioning process architecture, please refer to the Provisioning Architecture Overview Specification, [PROVARCH]."},{"url":"http://www.openmobilealliance.org/release/ClientProv/V1_1-20080226-C/OMA-WAP-TS-ProvSC-V1_1-20080226-C.pdf","file":"OMA-WAP-TS-ProvSC-V1_1-20080226-C.pdf","status":"Candidate","version":"V1.1","date":"2008-02-26","contentMediaType":"application/pdf","description":"Open  Mobile  Alliance  (OMA)  Wireless  Application  Protocol  (WAP)  is  a  result  of  continuous  work  to  define  an  industry-wide  specification  for  developing  applications  that  operate  over  wireless  communication  networks.  The  Open  Mobile  Alliance  continues  the  work  of  the  WAP  Forum  to  define  a  set  of  specifications  to  be  used  by  service  applications.  For  information   on   the   WAP   architecture,   please   refer   to   “Wireless   Application   Protocol   Architecture   Specification”   [WAPARCH]. This document defines the information format and the access methods of WAP provisioning data present on smart cards used for wireless telecom applications. A particular case is when a WIM application is already present on such smart card type.  Provisioning WAP connectivity data on a SIM/RUIM smart card or a UICC smart card with a SIM, USIM, CSIM or WIM application  will  have  advantages  (i.e.  pre-provisioning  of  personalised  data  during  manufacturing,  portability,  controlled  access to sensitive data like login/passwords etc.)"}]}}