{"input":{"cteatedAt":"2021-02-18T12:26:44.362Z","url":"http://www.openmobilealliance.org/release/MSrchFramework/V1_0-20100223-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MSrchFramework/V1_0-20100223-C/OMA-AD-MSrchFramework-V1_0-20100223-C.pdf","file":"OMA-AD-MSrchFramework-V1_0-20100223-C.pdf","status":"Candidate","version":"V1.0","date":"2010-02-23","contentMediaType":"application/pdf","description":"The Architecture Document (AD) illustrates the Mobile Search Framework Enabler from an architectural perspective. This document contains the architecture diagram as well as functional components and interfaces definitions. To further demonstrate the architecture of the MSrchFramework Enabler, several flows are included in Appendix B. This document does not contain any detailed definition of the components or the parameters of interfaces. These definitions are included in the TS document"},{"url":"http://www.openmobilealliance.org/release/MSrchFramework/V1_0-20100223-C/OMA-ERELD-MSrchFramework-V1_0-20100223-C.pdf","file":"OMA-ERELD-MSrchFramework-V1_0-20100223-C.pdf","status":"Candidate","version":"V1.0","date":"2010-02-23","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Mobile Search Framework Enabler according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The Mobile Search Framework Enabler release defines an open framework providing different capabilities to support mobile search service. The capabilities of this enabler include (not limited to) search engine integration, selection, results personalization; search engines are not in the scope of this enabler, nevertheless some requirements are identified for Search engines to be integrated with the Mobile Search Framework Enabler in a standard way ."},{"url":"http://www.openmobilealliance.org/release/MSrchFramework/V1_0-20100223-C/OMA-ERP-MSrchFramework-V1_0-20100223-C.zip","file":"OMA-ERP-MSrchFramework-V1_0-20100223-C.zip","status":"Candidate","version":"V1.0","date":"2010-02-23","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MSrchFramework/V1_0-20100223-C/OMA-RD-MSrchFramework-V1_0-20090811-C.pdf","file":"OMA-RD-MSrchFramework-V1_0-20090811-C.pdf","status":"Candidate","version":"V1.0","date":"2009-08-11","contentMediaType":"application/pdf","description":"The requirement document (RD) contains the use cases and requirements for Mobile Search Framework Enabler. This covers defining  the  requirements  for  an  open  framework  providing  several  capabilities  to  support  mobile  search  service.  The capabilities of this enabler will include (not limited to) Search Engine integration, selection, results Personalization. Mobile Search Framework Enabler will reuse as much as possible existing technologies. Some requirements may involve other OMA Enablers. Search Engines are not in the scope of this RD, nevertheless some requirements are identified for Search Engines to be integrated with the Mobile Search Framework Enabler in a standard way."}]}}