{"input":{"cteatedAt":"2021-02-17T21:40:57.348Z","url":"http://www.openmobilealliance.org/release/Browsing/V2_3-20070313-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Browsing/V2_3-20070313-C/OMA-ERELD-Browsing-V2_3-20070313-C.pdf","file":"OMA-ERELD-Browsing-V2_3-20070313-C.pdf","status":"Candidate","version":"V2.3","date":"2007-03-13","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition (ERELD) of Browsing V2.3 according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The Browsing enabler defines application-level protocols, semantics, syntax and user agent behaviours to provide a browsing capability suitable for mobile and wireless handheld devices. OMA-ERELD-Browsing-V2_3-20070313-C Page 5 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] 2.  References  2.1     Normative     References     [BE-Phase1-RD] “Browsing Enhancements Phase One Requirements”, Open Mobile Alliance™. OMA-RD_BrowsingEnhancementsOne-V1_0 .  URL:http://www.openmobilealliance.org/[BCI-RD] “Browser Interoperability”, Open Mobile Alliance™. OMA-RD-BrowserInteroperability-V1_0   URL:http://www.openmobilealliance.org/[CacheMod] “User Agent Caching Model, V1.1”, Open Mobile Alliance\u0002. OMA-TS-UACACHE-V1_1.  URL:http://www.openmobilealliance.org/[CacheOp] “WAP Cache Operation”, WAP Forum\u0002. WAP-175-CacheOp. URL:http://www.openmobilealliance.org/[CryptoLib] “WMLScript Crypto Library Specification”, WAP Forum\u0002. WAP-161-WMLScriptCrypto. URL:http://www.openmobilealliance.org/[DL-ERELD] “Enabler Release Definition for Download Version 1.0”, Open Mobile Alliance™. OMA-ERELD-DL-V1_0. URL:http://www.openmobilealliance.org[DRM-ERELD] “Enabler Release Definition for DRM Version 2.0”, Open Mobile Alliance™. OMA-ERELD-DRM-V2_0. URL:http://www.openmobilealliance.org[EFI-ERELD] “Enabler Release Definition for EFI V1.1”, Open Mobile Allance™. OMA-ERELD-EFI-V1_1. URL:http://www.openmobilealliance.org.[ESMP] “ECMAScript Mobile Profile”, Open Mobile Alliance™. OMA-WAP-ESMP-V1_0. URL:http://www.openmobilealliance.org/[ESMPCrypto] “ECMAScript Crypto”, Open Mobile Alliance™.  OMA-WAP-ECMACR-V1.0. URL:http://www.openmobilealliance.org/[HTTPSM] “HTTP State Management Specification, V1.1”, Open Mobile Alliance\u0002.  OMA-TS-HTTPSM-V1_1. URL:http://www.openmobilealliance.org/[IOPProc] “OMA Interoperability Policy and Process”. Open Mobile Alliance\u0002. OMA-IOP-Process-v1_1. URL:http//www.openmobilealliance.org/[MMS-ERELD] “Enabler Release Definition for MMS Version 1.2”, Open Mobile Alliance™. OMA-ERELD-MMS-V1_2. URL:http://www.openmobilealliance.org[PAP] “Push Access Protocol”, WAP Forum\u0002. WAP-247-PAP. URL:http://www.openmobilealliance.org/[PICT] “WAP Pictogram, V1.1”, Open Mobile Alliance\u0002. OMA-WAP-TS-Pictogram-V1_1. URL:http://www.openmobilealliance.org/[PPGService] “Push Proxy Gateway Service”, WAP Forum\u0002. WAP-249-PPGService. URL:http://www.openmobilealliance.org/[PSTOR] “WAP WAG Persistent Storage Interface”, WAP Forum\u0002. WAP-301-PSTOR. URL:http://www.openmobilealliance.org/[PushArch] “Push Architecture Overview”, WAP Forum\u0002. WAP-250-PushArchOverview. URL:http://www.openmobilealliance.org/[PushMessage] “WAP Push Message”, WAP Forum\u0002.  WAP-251-PushMessage. URL:http://www.openmobilealliance.org/[PushOTA] “WAP Push OTA Protocol”, WAP Forum\u0002.  WAP-235-PushOTA. URL:http://www.openmobilealliance.org/OMA-ERELD-Browsing-V2_3-20070313-C Page 6 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] [RFC2119] “Key words for use in RFCs to Indicate Requirement Levels”. S. Bradner, March 1997. URL:http://www.ietf.org/rfc/rfc2119.txt[ServiceInd] “Service Indication”, WAP Forum\u0002. WAP-167-ServiceInd. URL:http://www.openmobilealliance.org/[ServiceLoad] “Service Loading”, WAP Forum\u0002. WAP-168-ServiceLoad. URL:http://www.openmobilealliance.org/[Sync] “Enabler Release Definition for Data Sync, Version 1.1.2”, Open Mobile Alliance\u0002. OMA-ERELD-SyncML-DS-V1_1_2. URL:http://www.openmobilealliance.org/[VCAL] \"vCalendar - the Electronic Calendaring and Scheduling Format\", version 1.0, The Internet Mail Consortium (IMC), September 18, 1996, URL:http://www.imc.org/pdi/vcal-10.doc[VCARD] “vCard - The Electronic Business Card”, version 2.1,The Internet Mail Consortium (IMC), September 18, 1996, URL:http://www.imc.org/pdi/vcard-21.doc[WAE] “Wireless Application Environment Specification, version 2.3”, Open Mobile Alliance™. OMA-WAP-WAESpec-V2_3. URL:http://www.openmobilealliance.org/[WAEMedia] “WAE Defined Media Type”, WAP Forum\u0002.  WAP-237-WAEMT. URL:http://www.openmobilealliance.org/[WBXML] “WAP Binary XML Content Format”, WAP Forum\u0002. WAP-192-WBXML. URL:http://www.openmobilealliance.org/[WCSS] “Wireless CSS V1.1”, Open Mobile Alliance\u0002.  OMA-WAP-WCSS-V1_1. URL:http://www.openmobilealliance.org/[WML1] “Wireless Markup Language Version 1.3”, WAP Forum\u0002.  WAP-191-WML. URL:http://www.openmobilealliance.org/[WML2] “Wireless Markup Language”, WAP Forum\u0002.  WAP-238-WML. URL:http://www.openmobilealliance.org/[WMLScript] “WMLScript Language Specification”, WAP Forum\u0002.  WAP-193-WMLS. URL:http://www.openmobilealliance.org/[WMLStdLib] “WMLScript Standard Libraries Specification”, WAP Forum\u0002.  WAP-194-WMLSL. URL:http://www.openmobilealliance.org/[WTAI] “Wireless Telephony Application Interface Specification”, WAP Forum\u0002. WAP-268-WTAI. URL:http://www.openmobilealliance.org/[XHTMLMP] “XHTML Mobile Profile 1.2”, Open Mobile Alliance\u0002.  OMA-XHTMLMP-V1_2. URL:http://www.openmobilealliance.org/2.2     Informative     References     [Browsing22] “Enabler Release Definition for Browsing V2.2”, Open Mobile Alliance™. OMA-ERELD-Browsing-V2_2. URL:http://www.openmobilealliance.org.[CSS2] “Cascading Style Sheets, level 2 (CSS2) Specification”, W3C Recommendation, Bert Bos et al., 12 May 1998.  URL:http://www.w3.org/TR/1998/REC-CSS2-19980512[CSSMP] “CSS Mobile Profile 1.0”, W3C Candidate Recommendation, Ted Wugofski. Doug Dominiak, Peter Stark, 24 October 2001. URL:http://www.w3.org/TR/2001/CR-css-mobile-20011024.[ECMA327] Standard ECMA-327, “ECMAScript 3 rd Edition Compact Profile”, ECMA, June 2001, URL: OMA-ERELD-Browsing-V2_3-20070313-C Page 7 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] ftp://ftp.ecma.ch/ecma-st/Ecma-327.pdf[ECMAScript] Standard ECMA-262: “ECMAScript Language Specification – Edition 3”, ECMA, December 1999. URL: ftp://ftp.ecma.ch/ecma-st/Ecma-262.pdf[HTTP/1.1] “Hypertext Transfer Protocol -- HTTP/1.1”, RFC2616, R. Fielding et al., June 1999.  URL:http://www.ietf.org/rfc/rfc2616.txt[ProvArch] “WAP Provisioning Architecture Overview”, WAP Forum\u0002. WAP-182-ProvArch. URL:http://www.openmobilealliance.org/[ProvCont] “WAP Provisioning Content Specification”, WAP Forum\u0002. WAP-183-ProvCont. URL:http://www.openmobilealliance.org/[ProvUAB] “WAP Provisioning User Agent Behaviour Specification”, WAP Forum\u0002. WAP-185-ProvUAB. URL:http://www.openmobilealliance.org/[UAPROF] “WAG UAProf”, WAP ForumTM. WAP-248-UAPROF. URL:http://www.openmobilealliance.org/[WAE20] “Wireless Application Environment Specification – version 2.0”, WAP Forum™. WAP-236-WAESpec. URL:http://www.openmobilealliance.org/[WAPArch] “WAP Architecture Specification”, WAP Forum\u0002. WAP-210-WAPArch. URL:http://www.openmobilealliance.org/[WCSS10] “WAP CSS”, WAP Forum\u0002.  WAP-239-WCSS. URL:http://www.openmobilealliance.org/[W-HTTP] “WAP Wireless Profiled HTTP”, WAP Forum\u0002.  WAP-229-HTTP. URL:http://www.openmobilealliance.org/[WSP] “Wireless Session Protocol”, WAP Forum\u0002.  WAP-230-WSP. URL:http://www.openmobilealliance.org/[WTP] “Wireless Transaction Protocol Specification”, WAP Forum\u0002. WAP-224-WTP. URL:http://www.openmobilealliance.org/[XHTMLMP10] “XHTML Mobile Profile”, WAP Forum\u0002.  WAP-277-XHTMLMP. URL:http://www.openmobilealliance.org/[XHTMLMP11] “XHTML Mobile Profile V1.1”, Open Mobile Alliance\u0002.  OMA-WAP-XHTMLMP-V1_1. URL:http://www.openmobilealliance.org/  OMA-ERELD-Browsing-V2_3-20070313-C Page 8 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] 3.  Terminology and Conventions 3.1     Conventions     The key words “MUST”, “MUST NOT”, “REQUIRED”, “SHALL”, “SHALL NOT”, “SHOULD”, “SHOULD NOT”, “RECOMMENDED”, “MAY”, and “OPTIONAL” in this document are to be interpreted as described in [RFC2119]. All sections and appendixes, except “Scope” and “Introduction”, are normative, unless they are explicitly indicated to be informative. The formal notation convention used in sections 8and 9 to formally express the structure and internal dependencies between specifications in the Enabler Release specification baseline is detailed in [IOPP].  3.2     Definitions     Client A device (or application) that initiates a request for connection with a server. Content Synonym for data objects. Content Format (or Format) Actual representation of content. Deprecated A deprecated feature (e.g. specification, element or attribute) is one that has been outdated by a newer feature. Deprecated features are defined in the specification and are clearly marked as deprecated. Deprecated features may become obsolete in a future version. Device A network entity that is capable of sending and receiving packets of information and has a unique device address.  A device can act as both a client and a server within a given context or across multiple contexts.  For example, a device can service a number of clients (as a server) while being a client to another server. ECMAScript  A scripting language produced and managed by the European Computer Manufacturers Association (ECMA) that provides a common scripting language for the computer industry.   Enabler Release A collection of specifications that combined together form an enabler for a service area, e.g. a download enabler, a browsing enabler, a messaging enabler, a location enabler, etc. The specifications that are forming an enabler should combined fulfil a number of related market requirements. Gateway (or WAP Gateway)  A server which acts as an intermediary for some other server. A gateway performs protocol transformation as well as encoding/decoding content. Host Object ECMAScript objects provided by the user agent for the purpose of interaction with the loaded document. Hypermedia Transfer The hypermedia transfer services provides for the transfer of self-describing hypermedia resources. The combination of WSP (Wireless Session Protocol) [WSP] and WTP (Wireless Transaction Protocol) [WTP] provide the hypermedia transfer service over secure and non-secure datagram transports over datagram-based protocol stack. The W-HTTP (Wireless Profiled Hypertext Transfer Protocol) [W-HTTP], a profile of HTTP/1.1 [HTTP/1.1] provides the hypermedia transfer service over secure and non-secure connection-oriented transports over connection-oriented protocol stack. Origin Server The server on which a given resource resides or is to be created.  Often referred to as a web server or an HTTP server. Media type A MIME media type or an identifier for a given data type. Minimum Functionality Description Description of the guaranteed features and functionality that will be enabled by implementing the minimum mandatory part of the Enabler Release. PC Browser  An existing Web browser that already supports text/html. OMA-ERELD-Browsing-V2_3-20070313-C Page 9 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] Resource A network data object or service that can be identified by a URL.  Resources may be available in multiple representations (e.g., multiple languages, data formats, size, and resolutions) or vary in other ways. Server A device (or application) that passively waits for connection requests from one or more clients.  A server may accept or reject a connection request from a client. Also Origin Server. Terminal A device typically used by a user to request and receive information.  Also called a mobile terminal or mobile station. User  A user is a person who interacts with a User Agent to access a resource. WAE User Agent (or User Agent)  A User Agent is any software or device that interprets markup and scripting languages or other content.  This may include textual browsers, voice browsers, search engines, etc. WAE version The version of the WAE User Agent. The version of the WAE User Agent may be uniquely identifiable by the WAP version, e.g. WAP version 1.1 contains WAE version 1.1, or it may be a feature of the WAP version in which case the WAE versioning mechanisms are used to determine the WAE User Agent version. WAP1 WAP Version 1, nominally the latest point release, e.g. WAP V1.2.1, unless otherwise noted. WAP2 WAP Version 2. When used as a prefix, it indicates that something is compliant to the WAP Version 2 conformance requirements, e.g., a WAP2 client is a client that fulfils all the requirements for a user agent of WAP Version 2. WAP2 content is content with a media type specified in WAP Version 2. WAP Proxy An intermediary program which acts as both a server and a client for the purpose of making requests on behalf of other clients. Requests are serviced internally or by passing them on, with possible translation, to other servers. It may provide functions of protocol enhancement, transcoding or any number of other optimisation or transformation functions and may be associated with any gateways, proxies or servers being used in the deployment architecture. WAP gateway is one of the optional functionalities of WAP proxy. WML  The Wireless Markup Language is a hypertext markup language used to represent information for delivery to a narrowband device, e.g., a phone.  WMLScript A scripting language used to program the mobile device.  WMLScript is an extended subset of the ECMAScript scripting language. XHTML The W3Cs codification of HTML version 4.01 in an XML. XML The Extensible Markup Language is a World Wide Web Consortium (W3C) standard for Internet markup languages, of which WML is one such language.  XML is a restricted subset of SGML. vCalendar Internet Mail Consortium (IMC) electronic calendar record. vCard Internet Mail Consortium (IMC) electronic business card. 3.3     Abbreviations          CSS Cascading Style Sheets DRM Digital Rights Management ECMA European Computer Manufacturer Association EFI External Functionality Interface ERDEF Enabler Requirement Definition ERELD Enabler Release Definition ESMP ECMAScript Mobile Profile HTML HyperText Markup Language  HTTP HyperText Transfer Protocol [HTTP/1.1] OMA Open Mobile Alliance OMA-ERELD-Browsing-V2_3-20070313-C Page 10 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] UAProf User Agent Profile W3C World Wide Web Consortium W-HTTP Wireless Profiled HTTP WML Wireless Markup Language (WML1 or WML2) WML1 Wireless Markup Language Version 1.3 WML2 Wireless Markup Language Version 2.0 WWW World Wide Web WSP Wireless Session Protocol WAP Wireless Application Protocol WAE Wireless Application Environment. Unless otherwise stated it refers to this version. WAE20 Wireless Application Environment version 2.0 [WAE20] WCSS Wireless Cascading Style Sheets (also previously know as WAP CSS) WTA Wireless Telephony Application WTAI Wireless Telephony Application Interface (an API defined in WTA WBMP Wireless BitMaP XHTML Extensible HyperText Markup Language  OMA-ERELD-Browsing-V2_3-20070313-C Page 11 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] 4.  Introduction    This document outlines the Enabler Release Definition for Browsing V2.3 and the respective conformance requirements for clients and servers implementing claiming compliance to it as defined by Open Mobile Alliance across the specification baseline. Browsing V2.3 provides OMA browsing capability for mobile and wireless handheld devices and the any necessary or optional supporting network services which may be provided on a gateway or proxy. Browsing V2.3 uses much of the internet technology used in today’s PC Browsers to access content on the WorldWide Web (WWW) but limits the specified profiles of this technology to that appropriate to the constrained resources and user interface of mobile and wireless handheld devices, e.g. reduced memory, processing power, communications bandwidth, display and user input capabilities, including some extensions to improve the user experience. Browing V2.3 builds on the browsing feature defined in Browsing V2.2 [Browsing22] by providing an updated version of XHTML Mobile Profile [XHTMLMP12]. The updates provide: improved navigation through the use of author control of softkeys when they are provided; enhanced and more consistent support for multimedia objects included in XHTMLMP documents; support for XHTML file upload and enhanced forms capabilities; and an enhanced input mode allowing authors to set the rules for user input data.  As with the Browsing V2.2 particular attention has been placed on enabling backwards compatibility, thereby allowing new devices conforming to the Browser enabler V2.3 to access legacy content and services where the specified set of features to facilitate such access are provided by the devices or supporting network based features.  The suite of specifications defining Browsing V2.3 defines the application-level protocols, semantics, syntax, content formats, user agent behaviour, and the use of hypermedia transfer protocols required to achieve consistent function and interoperability of services.  The Browsing V2.3 enabler maintains the approach of using the Wireless Application Environment [WAESpec] specification to define which markup languages, and script languages, content types and formats and other features of the browser are supported, the use of the hypermedia feature in the WAP 2.0 architecture [WAPArch], and whether they are mandatory or optional. Further it enables extensibility to a number of other features. Browsing 2.3, or the WAE User Agent, supports the following features directly through the WAE Specification [WAESpec], which is updated in this enabler release: •Markup language based content to be rendered to the user of the device; oWML V1.3 [WML1], WML V2.0 [WML2] and XHTMLMP V1.2[XHTMLMP] are specified. Content using XHTMLMP V1.0[XHTMLMP10] or XHTMLMP V1.1 [XHTMLMP11] is supported through XHTMLMP 1.2 compatibility. The XHTMLMP specification also provides HTML rendering capability within the limit of the device’s capabilities. •Scripting language augmentation of the markup content to allow extended functionality and user experience; oWMLScript [WMLScript], with its associated WMLScript Library [WMLStdLib], and  oECMAScript Mobile Profile [ESMP] along with a well-known set of host objects. •Style capabilities to enhance the presentation of markup on devices supporting it. oThe style is provided by the Wireless Cascading Style Sheets [WCSS] V1.1 specification.. [WCSS] is a profile of the W3C’s CSS2 [CSS2] and being inspired by the CSS2 mobile profile [CSSMP] extended with some other desirable features not available in [CSS2] to suite the needs of the mobile Browsing environment.  •Image and other content support;  oWBMP is a unique, efficient, monochrome format for Browsing V2.3 devices and predecessor devices but other types are supported, the types dependent on the device. WBMP is defined in the WAE Media Types specification [WAEMedia]. OMA-ERELD-Browsing-V2_3-20070313-C Page 12 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] oVcard[VCARD] and Vcalendar[VCAL] are supported formats for the exchange of electronic business cards and calendar information •Local caching of content to improve user experience and reduce network usage.[CacheMod]; •HTTP State Management [HTTPSM], or cookies in common terminology, to provide the means to convey state and state information between user and application server, e.g. session identifiers, time and date information of last access, recent enquiries to that application, to aid the user’s access to that application; •Pictograms [PICT] to provide an enhanced user experience through the use of small images to augment or even replace textural information, e.g. the use of common weather symbols to illustrate the current weather; and in which combinations and whether they are mandatory or optional. The Browsing V2.3 enabler also supports optional extensions to this basic browsing environment, namely •Download and DRM ERELD ([DL-ERELD] & [DRM-ERELD] oDownload and DRM provide a common means to download content over the air and manage the lifecycle of the content using Digital Rights Management with the rights expressed in a Rights Expression Language. •External Functionality Interface ERELD [EFI-ERELD] oEFI extends the browser to include other hardware or software elements through the use of markup and script interfaces. The discovery of these elements is enabled thereby allowing them to be used, e.g. start or stop another application, retrieve a digital photograph from a camera, etc. EFI support is updated to version 1.1 in this enabler release. •Push ([PushArch], [CacheOp], [PushMessage], [PushOTA], [PAP], [PPGService], [ServiceInd], [ServiceLoad]) oPUSH provides an alert mechanism with the ability to have the alert provide a link to content which is subsequently pulled using the browser •MMS ERELD [MMS-ERELD] oThe Multimedia Messaging Service (MMS) provides the means to send and receive rich media messages and uses Push for the alert mechanism.  •Synchronisation [Sync] •Application level signing of content oThis is provided through the use of scripting extensions of the basic scripting environment by the ECMA Script Cypto Object [ESMPCrypto] and WMLScript Crypto Library [CryptoLib] features •WBXML [WBXML] oWBXML is a compact format used for WAP Version 1.x browsers and still supported for other features though not required for the Browser per se. •Wireless Telephony Application Interface [WTAI] oThe  Public Wireless Telephony Application Interface  (WTAI) [WTAI] support allows applications to utilise a basic set of telephony features, e.g. make a call. •Persistent Storage [PSTOR] oThis provides a means to store data objects locally, personal details, applications, etc., within a device for use by applications and allows improved user experience  OMA-ERELD-Browsing-V2_3-20070313-C Page 13 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] Features such as Provisioning, [ProvArch], [ProvCont] and [ProvUAB], and UAPROF [UAPROF] are not specifically called out but are related and presented in the [WAESpec]. Additionally, Browsing 2.3 addresses some market requirements as recognised by real implementations based on previous versions of OMA Browsing. These requirements are identified in [BCI-RD].  OMA-ERELD-Browsing-V2_3-20070313-C Page 14 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] 5.  Document Listing for Browsing 2.3 This section is normative. The following list of specifications form the total core Browsing V2.3 Enabler Release, though a given device or proxy or server may support a valid subset of these specifications and the features contained within those specifications. The actual minimum profile for a device is defined in section 8 “ERDEF for Browsing V2.3 – Client Requirements”. The minimum profile for the proxy in section 9 “ERDEF for Browsing V2.3 – Server Requirements”. A description of the minimum browsing service being in section 6 “Minimum Functionality Description for Browsing V2.3”. Doc Ref Permanent Document Reference Description Requirement Documents [BE-Phase1-RD]                 OMA-RD_BrowsingEnhancementsOne-V1_0-20031216-C Browsing Enhancements Phase One Requirements V1.0 [BCI-RD]                            OMA-RD-BrowserInteroperability-V1_0-20070227-C Browser Interoperability Requirements V1.0 Architecture Document [WAPArch]                        OMA-AD-WAP_210_WAPArch-20010712-AWireless Application Protocol Architecture Specification Technical Specifications [WAE]                                OMA-WAP-TS-WAESpec-V2_3-20070227-CWireless Application Environment Specification, Version 2.3 [ESMP]                               OMA-WAP-ESMP-V1_0-20061020-A                               ECMA                               Script                               Mobile                               Profile                               [CacheMod] OMA-TS-UACACHE-V1_1-20070227-C User Agent Caching Model 1.1  [WML1] WAP-191-WML-20000219-a WAP Wireless Markup Language Version 1.3 WAP-191_102-WML-20001213-a. WML Specification Information Note 102 WAP-191_104-WML-20010718-a WAP Specification Information Note 104 WAP-191_105-WML-20020212-a. WML Specification Information Note 105 [WMLScript] WAP-193-WMLScript-20001025-a.pdf Wireless Markup Language Script Specification WAP-193_101-WMLScript-20010928-a. WML Specification Information Note 101 [WMLStdLib] WAP-194-WMLScriptLibraries-20000925-a Wireless Markup Language Script Standard Libraries Specification WAP-194_103-WMLScriptLibraries-20020318-a Wireless Markup Language Script Standard Libraries SpecificationSpecification Information Note 103 [HTTPSM] OMA-TS-HTTPSM-V1_1-20070227-C HTTP State Management Specification 1.1 [WAEMedia] WAP-237-WAEMT-20010515-a WIreless Application Environment Defined Media Type Specification [WML2] WAP-238-WML-20010911-a Wireless Mark up Language version 2.0 [WCSS] OMA-WAP-WCSS-V1_1-20061020-A WAP CSS Specification 1.1 [XHTMLMP] OMA-TS-XHTMLMP-V1_2-20070227-C XHTML Mobile Profile Version 1.2 [PICT]                                 OMA-WAP-TS-Pictogram-V1_1-20061620-AWAP Pictogram Specification, Version 1.1 [WBXML] WAP-192-WBXML-20010725-a Wireless Binary eXtended Markup Language [CryptoLib] WAP-161-WMLScriptCrypto-20010620-a WMLScript Crypto Library  Supporting Files OMA-ERELD-Browsing-V2_3-20070313-C Page 15 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I]  OMA-SUP-DTD_wml13-V1_3-20061020-A DTD for WAP Wireless Markup Language Version 1.3  Working file in DTD directory:  file: wml13.dtd path: http://www.wapforum.org/DTD/and path: http://www.openmobilealliance.org/tech/dtd/OMA-SUP-DTD_wml20-V2_0-20061020-A DTD for Wireless Markup Language version 2.0 Working file in DTD directory:  file: wml20.dtd path: http://www.wapforum.org/DTD/and path: http://www.openmobilealliance.org/tech/dtd/OMA-SUP-DTD_wml20-flat-V2_0-20061020-A DTD for Wireless Markup Language version 2.0  Working file in DTD directory:  file: wml20-flat.dtd path: http://www.wapforum.org/DTD/and path: http://www.openmobilealliance.org/tech/dtd/OMA-SUP-MOD_wml-deprecated-1-V2_0-20061020-A MOD for Wireless Markup Language version 2.0  Working file in DTD directory:  file: wml-deprecated-1.mod path: http://www.wapforum.org/DTD/and path: http://www.openmobilealliance.org/tech/dtd/OMA-SUP-MOD_wml-framework-1-V2_0-20061020-A MOD for Wireless Markup Language version 2.0  Working file in DTD directory:  file: wml-framework-1.mod  path: http://www.wapforum.org/DTD/and path: http://www.openmobilealliance.org/tech/dtd/OMA-SUP-MOD_wml-special-1-V2_0-20061020-A MOD for Wireless Markup Language version 2.0  Working file in DTD directory:  file: wml-special-1.mod path: http://www.wapforum.org/DTD/and  path: http://www.openmobilealliance.org/tech/dtd/OMA-SUP-MOD_wml-qname-1-V2_0-20061020-A MOD for Wireless Markup Language version 2.0  Working file in DTD directory:  file: wml-qname-1.mod path: http://www.wapforum.org/DTD/and path: http://www.openmobilealliance.org/tech/dtd/OMA-SUP-DTD_xhtml_mobile12-V1_2-20070313-C DTD for ”XHTML Mobile Profile V1.2”  Working file in DTD directory:  file: xhtml-mobile12.dtd  path: http://www.openmobilealliance.org/tech/dtd/OMA-ERELD-Browsing-V2_3-20070313-C Page 16 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I]                                             OMA-SUP-MOD_xhtml_mobile12_model_1-V1_2-20070313-C MOD for ”XHTML Mobile Profile V1.2” DTD module Working file in DTD directory:  file: xhtml-mobile12-model-1.mod  path: http://www.openmobilealliance.org/tech/dtd/OMA-SUP-MOD_xhtml_mobile12_form_1-V1_2-20070313-C MOD for ”XHTML Mobile Profile V1.2” Forms module Working file in DTD directory:  file: xhtmlmp12-form-1.mod path: http://www.openmobilealliance.org/tech/dtd/The following enablers and specifications form non-core extensions to the core Browsing V2.3 Enabler Release or optional additional enablers or features which have some dependency on the Browsing V2.3 Enabler Release. “Cypto Object for the ECMAScript Mobile Profile” [ESMPCrypto] “Enabler Release Definition for Download Version 1.0” [DL-ERELD] “Enabler Release Definition for DRM Version 2.0” [DRM-ERELD] “Enabler Definition for EFI V1.1 [EFI-ERELD] ”Enabler Release Definition for MMS Version 1.1” [MMS-ERELD] ”Persistent Storage”, [PSTOR] ”Synchronisation”, [Sync] ”Wireless Telephony Application Interface”, [WTAI] Push  ”Push Architecture Overview”, [PushArch] ”Push OTA Protocol”, [PushOTA] ”Push Access Protocol” [PAP] ”Push Proxy Gateway Service”, [PPGService] ”Push Message”, [PushMessage] ”WAP Service Indication”, [ServiceInd] ”WAP Service Loading”, [ServiceLoad] ”WAP Cache Operation”, [CacheOp] OMA-ERELD-Browsing-V2_3-20070313-C Page 17 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] 6.  Minimum Functionality Description for Browsing V2.3  This section is informative The minimum functionality description for the Browsing Version 2.3 enabler release is the support for the minimum requirements of the “Wireless Application Environment, Version 2.3” [WAE], and the HTTP State Management specification [HTTPSM]. This provides a minimum browser experience without any of the optional extra features, i.e. no Style, images, Vcard, or Vcalendar from the core browser features and no optional enablers or specifications as listed in section 5. The minimum functionality is the minimum set of requirements from: •XHTML Mobile Profile V1.2 for renderable content •ECMAScript Mobile Profile •User Agent Caching Model •Behaviour of the user agent during navigation between displayable pages of content  •Content retrieval using HTTP semantics and where HTTPS semantics are used via a secure session. The HTTP semantics are used via the Hypermedia Transfer service as defined in [WAPArch].   •General behaviour of the Browser in its use of protocols, supported media types etc. •WBMP Images support if the device supports graphics •HTTP State Management (mandated through this document) WCSS should be supported in the minimum requirements for a Browsing Version 2.2 comformant implementation unless it is impractical to do so for a class of device, i.e. the device has insufficient user interface capabilities which prevents its meaningful use. OMA-ERELD-Browsing-V2_3-20070313-C Page 18 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] 7.  Conformance Requirements Notation Details This section is informative   The tables in following chapters use the following notation:  Item: Entry in this column MUST be a valid ScrItem according to [IOPProc].  Feature/Application: Entry in this column SHOULD be a short descriptive label to the Item in question.  Status: Entry in this column MUST accurately reflect the architectural status of the Item in question. •Mmeans the Item is mandatory for the class •O means the Item is optional for the class •NA means the Item is not applicable for the class  Requirement: Expression in the column MUST be a valid TerminalExpression according to [10PProc] and it MUST accurately reflect the architectural requirement of the Item in question.  OMA-ERELD-Browsing-V2_3-20070313-C Page 19 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] 8.  ERDEF for Browsing V2.3 - Client Requirements This section is normative. Table 1 ERDEF for Browsing V2_3 Client-side Requirements Item Feature / Application Status Requirement OMA-ERDEF-BROWSING-C-001 Browsing V2.3 Client M WAESpec:MCF AND HTTPSM:MCF OMA-ERELD-Browsing-V2_3-20070313-C Page 20 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] 9.  ERDEF for Browsing V2.3 - Server Requirements This section is normative. Table 2 ERDEF for Browsing V2_3 Server-side Requirements Item Feature / Application Status Requirement OMA-ERDEF-BROWSING-S-001 Browsing V2.3 Server M WAESpec:MCF AND HTTPSM:MCF OMA-ERELD-Browsing-V2_3-20070313-C Page 21 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] Appendix A. Change History (Informative) A.1     Approved Version History Reference Date Description n/a n/a No previous version within OMA A.2     Draft/Candidate Version 2.3 History Document Identifier Date Sections Description 15 Aug 2004 All Initial draft formed from Browsing 2.2. ERELD 2.1 Add reference to the Browsing Enhancements RD 09 Dec 2004 5Add Browsing Enhacements RD to baseline and citation 10 Dec 2004 5 Fixed spelling error 21 Dec 2004 2.1 Modified referenced version for [BE-Phase1-RD] from OMA-Browsing-Enh-REQ-V1_0_1-20031008-D.doc to OMA-RD_BrowsingEnhancmentsOne-V1_0. The same document, only aligning the name and filename and template and status Draft Versions OMA-ERELD-Browsing-V2_3 22 Dec 2004 2.1 Correct spelling of ref [BE-Phase1-RD] to OMA-RD_BrowsingEnhancementsOne-V1_0 to align with RD correction 18 Jan 2005 n/a Status changed to Candidate by TP    TP ref  #OMA-TP-2004-0459-Browsing-2_3-for-candidate-approval 17 May 2005 n/a Date update to reflect the changes in minor CRs applied to ESMP. 14 Jun 2005 n/a Date update to reflect the changes in minor CRs applied to ESMP. Ref# OMA-TP-2005-0176-Notification-changes-Browsing-2_1-2_2-2_3 28 Jul 2006 2.1 5Template updated  Minor update of  reference to Pictogram :   OMA-MAE-2005-0239-CR_Browsing_ERELD_re_Pictogram.doc OMA-MAE-2006-0048R01-INP_BrowsingUpdateRePictAndXHTMP (Pictogram Spec added to the ERP) Apply OMA-MAE-2006-0220-CR_Add_RD_to_Browsing23_ERELD 31 Oct 2006 Template, 5 Revert to –D to show being touched Add SUP files to section 5 Apply SUP updates   OMA-MAE-2006-0330-CR_XHTMLMP12SUPmodel   OMA-MAE-2006-0337-CR_XHTMLMP12SUPmodel_titlecomment   OMA-MAE-2006-0361-CR_XHTMLMP12SUP_form_filepostfix Apply HTTPSM reference change OMA-MAE-2006-0373R01-CR_ERELD23_HTTPSM_change Apply UACACHE reference change OMA-MAE-2006-0374R02-CR_ERELD23_Caching_change Editorially change: Update specific ref to WCSS in 5.to OMA-WAP-WCSS-V1_1-20061020-A following approval Editorially change: Update specific ref to PictogramWCSS in 5.to OMA-WAP-TS-PIictogram-V1_1-20061020-A following approval Candidate Versions OMA-ERELD_Browsing-V2_3 14 Nov 2006  Update dates for UACache and HTTPSM to latest PDs Update SUP to OMA-SUP-DTD_xhtml_mobile12-V1_2-20061108-C in line with OMA-MAE-2006-0382-CR_XHTMLMP12DTDtrailingcomments.zip  Apply OMA-MAE-2006-0386R01-CR_Add_BCI_RD_to_B23_ERELD OMA-ERELD-Browsing-V2_3-20070313-C Page 22 (22 \u00012007 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20070101-I] Document Identifier Date Sections Description 21 Nov 2006  Update history for 28 July to reflect application of OMA-MAE-2006-0220-CR_Add_RD_to_Browsing23_ERELD Apply OMA-MAE-2006-0349-CR_Browsing_2_3_cleanup except use date of the –A version of ESMP Editorially change OMA-SUP-MOD_xhtml_mobile12_model_1-V1_1_0-20060923-D to OMA-SUP-MOD_xhtml_mobile12_model_1-V1_2-20060923-D in ERELD and ERP supporting material Editorially update the XHTMLMP 1.2 Model  file to OMA-SUP-MOD_xhtml_mobile12_model_1-V1_2-20061121-D to fully implement CR 330 (removal of part of the comment) 24 Nov 2006  Editorially move some entries in section 5 so the spec came before the SIN updates.  Editorially remove redundant HTTPSM V1.0 SIN from section 5. Editorially update the SUPs for WML 1.3 and 2.0 to 20061020-A to reflect their new status. Editorially correct some typos Editorial update UACaching date to reflect cleanup draft upload Mirror date update for WAESpec 28 Nov 2006 5 Remove duplicate WMLScript SIN. Resolve date for updated XHTMLMP 1.2 Resolve all XHTMLMP 1.2 SUPs to -D 07 Dec 2006 5 Mirror update to BCI RD to reflect roll-up of  OMA-MAE-2006-0393R01-CR_Browser_Interoperability_RD 20 Jan 2007  2007 template OMA-ERP-Browsing-V2_3-20061207-D updated with addition of SUP files (missing in zip file) 27 Feb 2007 n/a Re-approved as Candidate by TP   OMA-TP-2007-0074R01-INP_Browsing_V2_3_ERP_for_Candidate_Re_approval 13 Mar 2007 5 Minor CRs to match the OMA standard prologue to: - OMA-SUP-DTD_xhtml_mobile12-V1_2-20070227-C.dtd (CR 2007-0046R01) - OMA-SUP-MOD_xhtml_mobile12_model_1-V1_2-20070227-C.mod (CR 2007-0047R01) - OMA-SUP-MOD_xhtml_mobile12_form-V1_2-20070227-C.mod (CR 2007-0048R01)"},{"url":"http://www.openmobilealliance.org/release/Browsing/V2_3-20070313-C/OMA-ERP-Browsing-V2_3-20070313-C.zip","file":"OMA-ERP-Browsing-V2_3-20070313-C.zip","status":"Candidate","version":"V2.3","date":"2007-03-13","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/Browsing/V2_3-20070313-C/OMA-SUP-DTD_xhtml_mobile12-V1_2-20070313-C.txt","file":"OMA-SUP-DTD_xhtml_mobile12-V1_2-20070313-C.txt","status":"Candidate","version":"V1.2","date":"2007-03-13","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/Browsing/V2_3-20070313-C/OMA-SUP-MOD_xhtml_mobile12_form-V1_2-20070313-C.txt","file":"OMA-SUP-MOD_xhtml_mobile12_form-V1_2-20070313-C.txt","status":"Candidate","version":"V1.2","date":"2007-03-13","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/Browsing/V2_3-20070313-C/OMA-SUP-MOD_xhtml_mobile12_model_1-V1_2-20070313-C.txt","file":"OMA-SUP-MOD_xhtml_mobile12_model_1-V1_2-20070313-C.txt","status":"Candidate","version":"V1.2","date":"2007-03-13","contentMediaType":"text/plain"}]}}