{"input":{"cteatedAt":"2021-02-18T13:17:57.474Z","url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-AD-Service_User_Profile_Management-V1_0-20120529-A.pdf","file":"OMA-AD-Service_User_Profile_Management-V1_0-20120529-A.pdf","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"application/pdf","description":"The Service User Profile Management (SUPM) enabler provides a standardized interface to access and manage the data related to Service User Profile, with which applications and/or enablers can create, read, update and delete those data in order to support contextualization and personalization of the User’s services. This document provides the architecture of the SUPM enabler. This architecture is defined for this enabler to support the requirements described in the Service User Profile Management Requirements Document [SUPM-RD]."},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-ERELD-Service_User_Profile_Management-V1_0-20120529-A.pdf","file":"OMA-ERELD-Service_User_Profile_Management-V1_0-20120529-A.pdf","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Service User Profile Management (SUPM) enabler according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The Service User Profile Management (SUPM) enabler provides a standardized interface to access and manage the data related to Service User Profile, with which applications and/or enablers can create, read, update and delete those data in order to support contextualization and personalization of the User’s services."},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-ERP-Service_User_Profile_Management-V1_0-20120529-A-pdf.zip","file":"OMA-ERP-Service_User_Profile_Management-V1_0-20120529-A-pdf.zip","status":"","version":"","date":"","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-ERP-Service_User_Profile_Management-V1_0-20120529-Apdf.zip","file":"OMA-ERP-Service_User_Profile_Management-V1_0-20120529-Apdf.zip","status":"","version":"","date":"","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-RD-Service_User_Profile_Management-V1_0-20120529-A.pdf","file":"OMA-RD-Service_User_Profile_Management-V1_0-20120529-A.pdf","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"application/pdf","description":"The  scope  of  this  specification  is  to  identify  the  requirements  (and  a  few  informative  use  cases  where  appropriate)  for  the  Service  User  Profile  Management  (SUPM)  enabler.  The  objective  is  to  determine  the  requirements  for  the  access  to,  and  management  of,  Service  User  Profile  data.  These  requirements  are  in  support  of  needs  identified  in  both  OMA  service  enablers  and  other  resources.  The  objective  is  to  determine  the  requirements  for  a  data  model  for  the  Service  User  Profile  data, and the access to and the management of such data."},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-SUP-WSDL_supm_soap-V1_0-20120529-A.txt","file":"OMA-SUP-WSDL_supm_soap-V1_0-20120529-A.txt","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-SUP-XSD_rest_supm-V1_0-20120529-A.txt","file":"OMA-SUP-XSD_rest_supm-V1_0-20120529-A.txt","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-SUP-XSD_supm_soap-V1_0-20120529-A.txt","file":"OMA-SUP-XSD_supm_soap-V1_0-20120529-A.txt","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-TS-Service_User_Profile_Management-V1_0-20120529-A.pdf","file":"OMA-TS-Service_User_Profile_Management-V1_0-20120529-A.pdf","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"application/pdf","description":"The Service User Profile Management (SUPM) enabler provides a standardized interface to access and manage the data related to Service User Profile, with which Applications and/or enablers can create, read, update and delete those data in order to support contextualization and personalization of the User’s services. This document provides the core Technical Specification of the SUPM enabler.  This document specifies:  The abstract definition of common SUPM Data Views and data elements of the Service User Profile for SUPM 1.0  The detailed functional description of SUPM Component   Abstract interface definitions: the message flows, and message exchange patterns used for message exchanges between SUPM Component and Data Consumer   Page 6 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] 2.  References  2.1     Normative     References     [CAB_XDMS] “Converged Addess Book XML Specification”, Version 1.0, Open Mobile Alliance™, OMA-TS-CAB_XDMS-V1_0, URL:http://www.openmobilealliance.org/ [CBCS_TS] “Categorization Based Content Screening Technical Specification”, Version 1.0, Open Mobile Alliance™,OMA-TS-CBCS-V1_0, URL:http://www.openmobilealliance.org/ [OMA_DDS_Presence_data_ext] “OMA Data Description Specification for Presence Data Extension”, Version 1.0, Open Mobile Alliance™, OMA-DDS-Presence_Data_Extension-V1_0, URL:http://www.openmobilealliance.org/ [Profile_XDMS] “Profile XML Specification”, Version 2.1, Open Mobile Alliance™, OMA-TS-XDM_Profile-V2_1, URL:http://www.openmobilealliance.org/ [RFC2119] “Key words for use in RFCs to Indicate Requirement Levels”, S. Bradner, March 1997, URL:http://www.ietf.org/rfc/rfc2119.txt [RFC2822] “Internet Message Format”, P. Resnick, April 2001, URL: http://www.ietf.org/rfc/rfc2822.txt [RFC3261] “SIP: Session Initiation Protocol”, J. Rosenberg, et. al, June 2002, URL: http://www.ietf.org/rfc/rfc3261.txt [RFC3966] “The tel URI for Telephone Numbers”, H. Schulzrinne, December 2004, URL: http://www.ietf.org/rfc/rfc3966.txt [RFC4646] “Tags for Identifying Languages”, A. Phillips, M. Davis, September 2006, URL: http://www.ietf.org/rfc/rfc4646.txt [SEC_CF] “Enabler Release Package for Application Layer Security Common Functions”, Version 1.0, Open Mobile Alliance™, OMA-ERP-SEC_CF-V1_0-A, URL:http://www.openmobilealliance.org/ [SUPM-AD] “OMA Service User Profile Management Architecture”, Open Mobile Alliance™,  OMA-AD-Service_User_Profile_Management-V1_0, URL:http://www.openmobilealliance.org/ [SUPM-RD] “OMA Service User Profile Management Requirements”, Open Mobile Alliance™,  OMA-RD-Service_User_Profile_Management-V1_0, URL:http://www.openmobilealliance.org/ [SUPM-TS-LDAP] \"Service User Profile Management Technical Specification LDAP binding for SUPM-1 interface\", Open Mobile Alliance™, OMA-TS-Service_User_Profile_Management_LDAP_Binding-V1_0, URL:http://www.openmobilealliance.org/ [SUPM-TS-RESTful] “Service User Profile Management Technical SpecificationRESTful binding for SUPM-1 interface”, Open Mobile Alliance™, OMA-TS-Service_User_Profile_Management_RESTful_Binding-V1_0, URL:http://www.openmobilealliance.org/ [SUPM-TS-SOAP] “Service User Profile Management Technical SpecificationSOAP binding for SUPM-1 interface”, Open Mobile Alliance™, OMA-TS-Service_User_Profile_Management_SOAP_Binding-V1_0, URL:http://www.openmobilealliance.org/ [XDM_UPP] “UPP Directory XML Specification”, Version 1.0, Open Mobile Alliance™, OMA-TS-XDM_UPP_Directory-V1_0, URL:http://www.openmobilealliance.org/ [XML] \"Extensible Markup Language (XML) 1.0 (Second Edition)\", W3C Recommendation 6-October-2000. T. Bray, et al, 6-October-2000.  URL: http://www.w3.org/TR/REC-xml 2.2     Informative     References      [OMADICT] “Dictionary for OMA Specifications”, Version 2.8, Open Mobile Alliance™, OMA-ORG-Dictionary-V2_8, URL:http://www.openmobilealliance.org/  Page 7 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] 3.  Terminology  and  Conventions  3.1     Conventions     The key words “MUST”, “MUST NOT”, “REQUIRED”, “SHALL”, “SHALL NOT”, “SHOULD”, “SHOULD NOT”, “RECOMMENDED”, “MAY”, and “OPTIONAL” in this document are to be interpreted as described in [RFC2119]. All sections and appendixes, except “Scope” and “Introduction”, are normative, unless they are explicitly indicated to be informative. 3.2     Definitions     Application See [OMADICT] Resource See [OMADICT] Service See [OMADICT] Service Provider See [OMADICT] Service User Profile See [SUPM-RD] SUPM Data View See [SUPM-AD]. SUPM Data View ID A name that identifies a SUPM Data View. User See [OMADICT] User Profile See [OMADICT] 3.3     Abbreviations     AD Architecture Document LDAP Lightweight Directory Access Protocol HTTP HyperText Transfer Protocol OMA Open Mobile Alliance RD Requirement Document REST Representational State Transfer SUPM Service User Profile Management TS Technical Specification URI Uniform Resource Identifier XML Extensible Mark-up Language  Page 8 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] 4.  Introduction  This document defines the interfaces and functionalities of Service User Profile Management (SUPM) based on requirements defined by the SUPM requirement document [SUPM-RD] and in accordance with the architecture defined by the SUPM architecture document [SUPM-AD]. This document describes common features and behaviours of the SUPM-1 interface. The protocol bindings for the SUPM-1 interface are described in separate documents ([SUPM-TS-LDAP], [SUPM-TS-RESTful], [SUPM-TS-SOAP]). Section 5 of this document contains the detailed functional description of the SUPM Component. Section 6 of this document contains the description of the message exchange patterns, operations and parameters which are used over SUPM-1 interface. Section 7 of this document contains details on security considerations between SUPM Component and Data Consumer. Section 8 of this document contains abstract definition of common Data Views and data elements. 4.1     Version     1.0     The SUPM Technical Specification covers all requirements [SUPM-RD] of SUPM V1.0.  Page 9 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] 5.  SUPM Component Functional Descriptions This section contains the detailed description of the functions provided by the SUPM Component. 5.1     Data Request Analysis Function The Data Request Analysis function is responsible for handling SUPM-1 Data requests which are initiated from Data Consumers, decoding the request, and then invoking corresponding analysis actions. Upon receiving the request, the Data Request Analysis Function:  SHALL decode the SUPM-1 request, extract the data elements from the request payload;  SHALL interpret the semantic of  the request, and then determine where the data that the request required is stored;  SHALL determine which data elements indicated in the SUPM-1 request are accessed, according to the authorization rights of the Data Consumer. 5.2     Data Translation Function The SUPM Enabler SHALL take the responsibility of translating data format from its original format to the data format used in SUPM-1 interface, because the data extracted from various data sources may be in different format.  Data Translation Function SHALL adapt the format of the data from the data source(s) where the required data is stored to the format required on the SUPM-1 interface. 5.3     SUPM Data View Function The SUPM Enabler MAY support SUPM Data View function. SUPM Data Views are defined as a list of data elements. They are known to SUPM component by configuration. On the SUPM-1 interface, SUPM Data Views can be used to request all data elements of these views.  Page 10 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] 6.  SUPM-1  Interface  This section contains the description of the message exchange, operations and parameters which are used over SUPM-1 interface. In the SUPM-1 interface, data elements can be specified using any combination of individual data element names or pre-defined 'data-element-group' (that is, SUPM Data View) names that correspond to a list of data element names. 6.1     Operations/messages     6.1.1      Operation:      createServiceUserProfileData      This operation allows the creation of a Service User Profile for a specific user. Initial attribute values are pre-populated as part of the profile creation. 6.1.1.1 Input message: createServiceUserProfileDataRequest  Part name Optional DescriptionOriginator   No The data consumer which requests the creation of a Service User Profile for a specific user.  UserId  No Identification of the user for whom the profile is created. AttributeValuePairs No List of attribute names and attribute values.  Table 1: Input message createServiceUserProfileDataRequest 6.1.1.2 Output message: createServiceUserProfileDataResponse Part name Optional DescriptionResultCode No Success indication or error code ErrorMessage Yes Optional error diagnostic description Table 2: Output message createServiceUserProfileDataResponse 6.1.2      Operation:      readServiceUserProfileData      This operation allows the access to Service User Profile data. 6.1.2.1 Input message: readServiceUserProfileDataRequest  Part name Optional DescriptionOriginator   No The data consumer who wants to read Service User Profile data about one user.  UserId  No Identification of the Service User Profile that is used for the readServiceUserProfileData operation.   AttributeNames     No     List of attribute names that are requested. This list may consist of one or more DataViewId(s) only, of attribute names only or can be a composition of DataViewId(s) and attribute names. Table 3: Input message readServiceUserProfileDataRequest  Page 11 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] 6.1.2.2 Output message: readServiceUserProfileDataResponse Part name Optional DescriptionResultEntries Yes List of resultEntries including UserId and attribute list (which also includes DataViewId(s)).  ResultCode            No               Result            code            ErrorMessage Yes Optional error diagnostic description Table 4: Output message readServiceUserProfileDataResponse 6.1.3      Operation:      updateServiceUserProfileData      This operation allows to update individual attributes of a Service User Profile for a specific user. It is required to use create (respectively delete) operation to create (respectively delete) a complete Service User Profile for a specific user. 6.1.3.1 Input message: updateServiceUserProfileDataRequest  Part name Optional DescriptionOriginator  No The data consumer who wants to operate on Service User Profile. UserId No Identification of the user for whom the profile is updated. AttributeValuePairs No List of attribute names and attribute values Table 5: Input message updateServiceUserProfileDataRequest 6.1.3.2 Output message: updateServiceUserProfileDataResponse Part name Optional DescriptionResultCode No Success indication or error code ErrorMessage Yes Optional error diagnostic description Table 6: Output message updateServiceUserProfileDataResponse 6.1.4      Operation:      deleteServiceUserProfileData      This operation allows the deletion of the Service User Profile for a specific user. It is required to use the update operation to delete individual attributes of a Service User Profile. 6.1.4.1 Input message: deleteServiceUserProfileDataRequest  Part name Optional DescriptionOriginator   No The data consumer who wants to operate on Service User Profile.  UserId  No Identification of the user for whom the Service User Profile is deleted. Table 7: Input message deleteServiceUserProfileDataRequest 6.1.4.2 Output message: deleteServiceUserProfileDataResponse Part name Optional DescriptionResultCode No Success indication or error code ErrorMessage Yes Optional error diagnostic description Table 8: Output message deleteServiceUserProfileDataResponse  Page 12 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] 7.  Security  Considerations  SUPM Enabler SHALL allow Service Provider’s deployment to perform the specific security features below:  mutual authentication of the Data Consumer and SUPM Component  integrity protection between Data Consumer and SUPM Component  authorizing Data Consumer of operations on SUPM data, to ensure that different Data Consumers have different access control level to user data Data Consumer and SUPM Enabler MAY support mechanisms for mutual authentication, integrity protection and authorization as specified by [SEC-CF]. When applicable, the recommended mechanisms are specified in the respective binding specifications (e.g. [SUPM-TS-LDAP]).  Page 13 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] 8.  SUPM Data Views and Data Elements 8.1     Data definition principles Following principle apply at the abstract level:   Data element is also called attribute within this document and other SUPM Technical Specifications.  Until a data element (for a user) is assigned a value, that data element does not actually exist – its value is “undefined”.  The data element (for a given user) comes into being (i.e., its value is no longer “undefined”) when given a value via a CREATE or UPDATE operation.  When the data element is deleted via a DELETE operation, it again becomes “undefined”.  User Profile is a set of data elements. There is exactly one User Profile per user identified by its user id.   SUPM Data View is pre-defined arbitrary grouping of existing data elements, i.e. a subset of a User Profile. 8.2     SUPM     Data     Elements     The SUPM data elements are shown in the tables below. Non optional Data Elements SHOULD be supported by any SUPM 1.0 deployment implementation. The list MAY be extended with new attributes defined outside of SUPM 1.0 Enabler.  Element Name Optional Reference specification Descriptioncountry                           Yes                           [Profile_XDMS] the country in which this address is located region                             Yes                             [Profile_XDMS] corresponding to the region (e.g. state, province...) in which this address is located locality                            Yes                            [Profile_XDMS] represents the locality in which this address is located (e.g. village, city, town...) area                                 Yes                                 [Profile_XDMS]                                 represents the subdivision of the locality in which this address is located (e.g. neighbourhood, suburb, district...) street-name                     Yes                     [Profile_XDMS]                     represents the name of the street in which this address is located street-number                 Yes                 [Profile_XDMS]                 represents the house number in the street in which this address is located postal-code                     Yes                     [Profile_XDMS]                     represents the code for postal delivery (e.g. ZIP code) for this address communication-addresses No           [Profile_XDMS]           these elements MAY be of the following kind: SIP URI; tel URI; E.164 number; email address. display-name                  Yes                  [Profile_XDMS]                  containing a suggested name to display in user interfaces (e.g. in the IM buddy list) ; birth-date Yes [Profile_XDMS] containing the birth date of the User; gender Yes [Profile_XDMS] containing the gender of the User freetext Yes [Profile_XDMS] containing a description of  the User  Page 14 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] communication-types Yes          [Profile_XDMS]          containing a list of the communication abilities of the User for human consumption hobbies                           Yes                           [Profile_XDMS]                           element listing the User's hobbies favourite-links                Yes                [Profile_XDMS]                listing the User's favourite links activities                         Yes                         [OMA_DDS_Presence_data_ext] list of current user activities in free text. location-info                   Yes                   [OMA_DDS_Presence_data_ext]  geographical location place-type                       Yes                       [OMA_DDS_Presence_data_ext] textual location. time-zone                        Yes                        [OMA_DDS_Presence_data_ext] time zone at the location mood                               Yes                               [OMA_DDS_Presence_data_ext]  mood in free text note                                 Yes                                 [OMA_DDS_Presence_data_ext]  presence related free text information. title No [CAB_XDMS] title (e.g., Mr., Ms., Miss.). given                               No                               [CAB_XDMS]                               given                               name.                               middle                             Yes                             [CAB_XDMS]                             middle                             name                             family                             No                             [CAB_XDMS]                             family                             name.                             gen_id                             Yes                             [CAB_XDMS]                             the                             generation identifier (e.g., Jr., Sr., III) display_name                 No                 [CAB_XDMS]                 display name that is associated with the name anniversary-date Yes [CAB_XDMS] date of the anniversary gender Yes [CAB_XDMS] gender of the user language-list Yes [CAB_XDMS] langage list of the user media-list                        Yes                        [CAB_XDMS]                        Media                        list                        category-list                    Yes                    [CAB_XDMS]                    Categories associated to the user web-resources                 Yes                 [CAB_XDMS]                 Uniform Resource Locator associated to the user expertise-list Yes [CAB_XDMS] As in reference specification. hobby-list Yes [CAB_XDMS] string based text description of the hobby interests-list                    Yes                    [CAB_XDMS]                    string based text description of the current interests   8.3     SUPM     Data     Views     The SUPM Data Views are shown in the table below:  SUPM Data View ID Optional List of data elementsAddress Yes country, region, locality, area, street-name, street-number, postal-code  Name Yes title, given, middle, family, gen_id, display_name Presence           Yes               activities,           location-info, place-type,  note, time-zone  Page 15 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] Table 9: SUPM Data Views 8.3.1      Examples      This is an example of Data View and data elements. <Address>      <country> China </country>  <region> Shenzhen </region> <locality> Longgang </locality>  <area> Bantian </area> <street-name>  Huawei Industrial Base </street-name> <street-number>  F1 </street-number> <postal-code> 518129 </postal-code>  </Address>   Page 16 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] Appendix A. Change History (Informative) A.1    Approved Version History Reference Date Description OMA-TS-Service_User_Profile_Management-V1_0-20120529-A 29 May 2012 Status changed to Approved by TP    Ref TP Doc # OMA-TP-2012-0204-INP_SUPM_V1_0_for_Final_Approval  Page 17 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] Appendix B. Static Conformance Requirements (Informative) This Service User Profile Management Technical Specification provides the abstract definition of the SUPM-1 interface. Specific protocol bindings are specified in [SUPM-TS-LDAP], [SUPM-TS-RESTful], and [SUPM-TS-SOAP]. As such, this Technical Specification does not contain any Static Conformance Requirements.   Page 18 (18)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-Spec-20120101-I] Appendix C. SUPM Data View Deployment This diagram shows one of many potential implementations and deployments of a SUPM enabler.  This diagram shows that the implementation handles multiple data elements and SUPM Data Views.  SUPM Data Views can be composed of data.  The actual data can be stored in databases, other types of repositories, or can be accessed through other Resources (e.g. OMA enablers, Applications, network capabilities).    . Figure 1: SUPM Data View Deployment"},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-TS-Service_User_Profile_Management_LDAP_Binding-V1_0-20120529-A.pdf","file":"OMA-TS-Service_User_Profile_Management_LDAP_Binding-V1_0-20120529-A.pdf","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"application/pdf","description":"The scope of this document is to specify an LDAP protocol binding for the set of operations defined in [SUPM-TS]."},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-TS-Service_User_Profile_Management_RESTful_Binding-V1_0-20120529-A.pdf","file":"OMA-TS-Service_User_Profile_Management_RESTful_Binding-V1_0-20120529-A.pdf","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"application/pdf","description":"The scope of this document is to specify an HTTP protocol binding for the set of operations defined in [SUPM-TS], using REST architectural style."},{"url":"http://www.openmobilealliance.org/release/SUPM/V1_0-20120529-A/OMA-TS-Service_User_Profile_Management_SOAP_Binding-V1_0-20120529-A.pdf","file":"OMA-TS-Service_User_Profile_Management_SOAP_Binding-V1_0-20120529-A.pdf","status":"Approved","version":"V1.0","date":"2012-05-29","contentMediaType":"application/pdf","description":"The scope of this document is to specify a SOAP protocol binding for the set of operations defined in [SUPM-TS]. SOAP/XML can be used to access and manage (create, read, update, delete) the data related to Service User Profile. OMA enablers or other resources/services can read and update those data using SOAP/XML as described in this document."}]}}