{"input":{"cteatedAt":"2021-02-17T21:45:24.770Z","url":"http://www.openmobilealliance.org/release/CPM/V1_0-20090310-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/CPM/V1_0-20090310-C/OMA-ERELD-CPM-V1_0-20090310-C.pdf","file":"OMA-ERELD-CPM-V1_0-20090310-C.pdf","status":"Candidate","version":"V1.0","date":"2009-03-10","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of the Converged IP Messaging (CPM) Enabler according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/CPM/V1_0-20090310-C/OMA-ERP-CPM-V1_0-20090310-C.zip","file":"OMA-ERP-CPM-V1_0-20090310-C.zip","status":"Candidate","version":"V1.0","date":"2009-03-10","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/CPM/V1_0-20090310-C/OMA-RD-CPM-V1_0-20090310-C.pdf","file":"OMA-RD-CPM-V1_0-20090310-C.pdf","status":"Candidate","version":"V1.0","date":"2009-03-10","contentMediaType":"application/pdf","description":"This document defines the requirements for the Converged IP Messaging (CPM) Enabler. The aim of the CPM Enabler is to reuse existing and define new reusable building blocks to be able to create a variety of interpersonal, interactive, multimedia communication services that run on top of an IP network. It will be possible for third party Applications to use these capabilities, and these third party Applications also can interact with CPM Users as Participants. The CPM Enabler will provide the functionality to enable CPM based service users to communicate seamlessly with the users of Non-CPM Communication Services such as SMS and MMS. The CPM Enabler aims to provide the functionality for: • a consistent user experience across many service domains for all IP networks (mobile, home, Internet worlds) by addressing the service constraints in a bearer-agnostic manner • interoperability between different service providers, including roaming conditions  • supporting the creation and exchange of charging information  • allowing  users to be unaware of the underlying technology used for communication The CPM Enabler is targeted to build upon the user experiences provided by the following services: • text and/or multimedia messaging enabled services: e.g. SMS, IMPS, SIMPLE IM, Email, MMS • voice-enabled services: e.g. PoC, VoIP • video-enabled service: e.g. Video telephony, webcam, Video streaming"}]}}