{"input":{"cteatedAt":"2021-02-17T21:47:25.535Z","url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-AD-CPM-V2_2-20170926-C.pdf","file":"OMA-AD-CPM-V2_2-20170926-C.pdf","status":"Candidate","version":"V2.2","date":"2017-09-26","contentMediaType":"application/pdf","description":"This document describes the architecture additions to the CPM v2.2 Enabler. This document describes the architecture designed to fulfil all the requirements outlined in the Converged IP Messaging Requirements document [OMA-CPM-RD] for CPM V2.2 and for future CPM versions; the major differences between CPM V2.2 and the future CPM versions are described under section 4 and Appendix C. The description of the architecture comprises the definition of functional components and the interfaces used or exposed by these functional components. Additionally, this document identifies the relationship of the CPM Enabler to external functional components that either are utilized by the CPM Enabler or take advantage of the CPM Enabler. The description of these relationships comprises the functional components and interfaces that reside at the boundary between the CPM Enabler and the external technology domain."},{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-ERELD-CPM-V2_2-20170926-C.pdf","file":"OMA-ERELD-CPM-V2_2-20170926-C.pdf","status":"Candidate","version":"V2.2","date":"2017-09-26","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of the Converged IP Messaging (CPM) Enabler version 2.2 according to OMA release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-ERP-CPM-V2_2-20170926-C.zip","file":"OMA-ERP-CPM-V2_2-20170926-C.zip","status":"Candidate","version":"V2.2","date":"2017-09-26","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-RD-CPM-V2_2-20170926-C.pdf","file":"OMA-RD-CPM-V2_2-20170926-C.pdf","status":"Candidate","version":"V2.2","date":"2017-09-26","contentMediaType":"application/pdf","description":"This document defines the requirements for the Converged IP Messaging (CPM) Enabler. The aim of the CPM Enabler is to reuse existing and define new reusable building blocks to be able to create a variety of interpersonal, interactive, multimedia communication services that run on top of an IP network. It will be possible for third party Applications to use these capabilities, and these third party Applications also can interact with CPM Users as Participants. The CPM Enabler aims to provide the functionality for:  a consistent user experience across many service domains for all IP networks (mobile, home, Internet worlds) by addressing the service constraints in a bearer-agnostic manner  interoperability between different service providers, including roaming conditions  supporting the creation and exchange of charging information  allowing  users to be unaware of the underlying technology used for communication  centralized network based message store as a permanent repository for a CPM User’s communication history  multi-device environment for a CPM User  seamless communication with Non-CPM Users using legacy messaging services such as SMS and MMS  third party application development using CPM Enabler as a transport platform for value adding services The CPM Enabler is targeted to build upon the user experiences provided by the following services:  text and/or multimedia messaging enabled services: e.g. SMS, IMPS, SIMPLE IM, Email, MMS  voice-enabled services: e.g. PoC, VoIP  video-enabled service: e.g. Video telephony, webcam, Video streaming"},{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-TS-CPM_Charging_Specification-V2_2-20170926-C.pdf","file":"OMA-TS-CPM_Charging_Specification-V2_2-20170926-C.pdf","status":"Candidate","version":"V2.2","date":"2017-09-26","contentMediaType":"application/pdf","description":"This document specifies the use of OMA Charging Enabler to realise the offline and online charging requirements of OMA CPM Enabler. The OMA Charging Enabler defines a set of interfaces that are utilised by the other Enablers to fulfil their charging requirements. The interfaces are specified in [CHRG_AD11] and the parameter definitions in [CHRG_DDS]. This document defines how, when and by which entities charging is triggered and which function invokes charging over the OMA Charging Enabler interfaces. This document also defines the data that will be exchanged during the process. This document specifies in detail:  The charging models for the OMA CPM enabler,  The logical messages and message types used on CH-1 and CH-2 interfaces,   The flow of messages between the Charging Enabler User and the Charging Enabler with regard to the CPM Service and applicable CPM scenarios,  Mapping of the CPM parameters to the OMA Charging Data Elements"},{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-TS-CPM_Conversation_Function-V2_2-20170926-C.pdf","file":"OMA-TS-CPM_Conversation_Function-V2_2-20170926-C.pdf","status":"Candidate","version":"V2.2","date":"2017-09-26","contentMediaType":"application/pdf","description":"This document provides the technical specifications for the conversation functionality of the CPM Enabler. The document covers the formats and procedures that Principals can use to exchange CPM Standalone Messages, CPM File Transfers and CPM Sessions. Also, it specifies how the CPM Standalone Messages, CPM File Transfers and CPM Sessions are linked to each other in CPM Conversations. The technical specifications are designed to fulfil the requirements, architecture and system concepts that are described in [OMA-CPM-RD], [OMA-CPM-AD] and [OMA-CPM-SD] respectively. As such, these technical specifications provide the formal definitions of the CPM-PF1, CPM-PF2, and CPM-CF interfaces that have been identified in [OMA-CPM-AD]. Also, these technical specifications formally define the expected behaviour of the CPM Client, CPM Participating Function and CPM Controlling Function functional components that have been identified in [OMA-CPM-AD]."},{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-TS-CPM_Interworking_Function-V2_2-20170926-C.pdf","file":"OMA-TS-CPM_Interworking_Function-V2_2-20170926-C.pdf","status":"Candidate","version":"V2.2","date":"2017-09-26","contentMediaType":"application/pdf","description":"This document provides the technical specifications for the interworking functionality of the CPM Enabler. The document covers the interworking selection procedures and the principles of interworking of CPM Standalone Messages, CPM disposition notifications, CPM File Transfers and CPM Sessions with Non-CPM Communication Services. The technical specifications are designed to fulfil the requirements, architecture and system concepts that are described in [OMA-CPM-RD], [OMA-CPM-AD] and [OMA-CPM-SD]. As such, these technical specifications provide the formal definitions of the CPM-IW1 and CPM-IW2 interfaces that have been identified in [OMA-CPM-AD]. Also, these technical specifications formally define the expected behaviour of the ISF and Interworking Function components that have been identified in [OMA-CPM-AD]. This version of the document specifies the interworking with:  SMS;  MMS;  e-mail. NOTE: CPM interworking with other Non-CPM Communication Services is possible but the specific adaptations towards these other Non-CPM Communication Services are not described in this version of the document."},{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-TS-CPM_Message_Storage_Using_RESTFul_API-V1_0-20170926-C.pdf","file":"OMA-TS-CPM_Message_Storage_Using_RESTFul_API-V1_0-20170926-C.pdf","status":"Candidate","version":"V1.0","date":"2017-09-26","contentMediaType":"application/pdf","description":"This document provides a technical specification of how the CPM Message Storage functionality of the CPM Enabler [OMA-CPM-MSG] may be accessed using the RESTful interface defined in [OMA-REST-NMS]. The goal of this document is to present an alternative protocol binding of the CPM-MSG interface as defined in [OMA-CPM-AD] specifying procedures for Clients and Servers that communicate with the CPM Message Store. As such, these technical specifications provide an alternative formal definition of the CPM-MSG interface that has been identified in [OMA-CPM-AD]. Also, these technical specifications formally define the expected behaviour of the Message Storage Client and Message Storage Server functional components that have been identified in [OMA-CPM-AD] when using the RESTful interface defined in [OMA-REST-NMS]."},{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-TS-CPM_Message_Store-V2_2-20170926-C.pdf","file":"OMA-TS-CPM_Message_Store-V2_2-20170926-C.pdf","status":"Candidate","version":"V2.2","date":"2017-09-26","contentMediaType":"application/pdf","description":"This document provides the technical specifications for the message storage functionality of the CPM Enabler. The document covers the storage of Media Objects, CPM Messages, CPM File Transfer Histories, CPM Session Histories and CPM Conversation Histories in the network and the interactions between client and server components to access the network storage. The technical specifications are designed to fulfil the requirements, architecture and system concepts that are described in [OMA-CPM-RD], [OMA-CPM-AD] and [OMA-CPM-SD] respectively. As such, these technical specifications provide the formal definitions of the CPM-MSG interface that has been identified in [OMA-CPM-AD]. Also, these technical specifications formally define the expected behaviour of the Message Storage Client and Message Storage Server functional components that have been identified in [OMA-CPM-AD]."},{"url":"http://www.openmobilealliance.org/release/CPM/V2_2-20170926-C/OMA-TS-CPM_System_Description-V2_2-20170926-C.pdf","file":"OMA-TS-CPM_System_Description-V2_2-20170926-C.pdf","status":"Candidate","version":"V2.2","date":"2017-09-26","contentMediaType":"application/pdf","description":"This is an informative document which describes the system concepts of the CPM Enabler to fulfil the requirements outlined in the Converged IP Messaging requirements document [OMA-CPM-RD] in compliance to the architecture described in [OMA-CPM-AD]. The description of the system concepts comprises the definition of central data elements of the CPM Enabler and the specification of general procedures for each of the functionalities supported by the CPM Enabler. Additionally, this document describes a set of detailed call flows for the functionalities of the CPM Enabler. These call flows explain the system concepts in a graphical manner, and describe the relationships between the functional components of the CPM Enabler. The CPM System Description is intended as a supporting document that helps to provide the understanding and overview of the CPM features and the architecture used to realize them."}]}}