{"input":{"cteatedAt":"2021-02-18T12:29:09.770Z","url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/OMA-AD-Mobile_Advertising-V1_0-20120320-A.pdf","file":"OMA-AD-Mobile_Advertising-V1_0-20120320-A.pdf","status":"Approved","version":"V1.0","date":"2012-03-20","contentMediaType":"application/pdf","description":"This document defines the architecture of Mobile Advertising (MobAd) Enabler. This architecture is based on the requirements listed in the MobAd Requirement Document [OMA-MOBAD-RD]. The objective of the MobAd Enabler architecture is to define network-side and device-side MobAd Enabler components, the interface(s) between them and the interface(s) exposed by those components to some entities that rely on MobAd Enabler (i.e. device-side Ad Apps as well as network-side SP Apps). The needs of external entities such as Content Providers, Advertisers, etc are not considered when defining interfaces for MobAd Enabler components, because those external entities are out of scope of MobAd AD and TS. The MobAd Enabler architecture is designed to support the core functionalities related to mobile advertising, in particular Ad Selection, Ad Delivery and Ad Metrics data handling."},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/OMA-ERELD-MobAd-V1_0-20120320-A.pdf","file":"OMA-ERELD-MobAd-V1_0-20120320-A.pdf","status":"Approved","version":"V1.0","date":"2012-03-20","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of MobAd according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/OMA-ERP-MobAd-V1_0-20120320-A.zip","file":"OMA-ERP-MobAd-V1_0-20120320-A.zip","status":"Approved","version":"V1.0","date":"2012-03-20","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/OMA-IOP_RPT-MobAd-V1_0-20120320-A.pdf","file":"OMA-IOP_RPT-MobAd-V1_0-20120320-A.pdf","status":"Approved","version":"V1.0","date":"2012-03-20","contentMediaType":"application/pdf","description":"OMA IOP BRO as a sub-working group (SWG) to OMA IOP WG has compiled this report to summarize the efforts done to prove the interoperability aspects of the Mobile Advertising (MobAd) V1.0 Enabler, as it is being considered for approval by the OMA Technical Plenary as an OMA Enabler Release. This document provides information needed by the OMA Technical Plenary to consider the approval of Mobile Advertising v1.0 Enabler Releases from an IOP perspective."},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/OMA-RD-Mobile-Advertising-V1_0-20120320-A.pdf","file":"OMA-RD-Mobile-Advertising-V1_0-20120320-A.pdf","status":"Approved","version":"V1.0","date":"2012-03-20","contentMediaType":"application/pdf","description":"This Requirement Document (RD) contains use cases and defines the requirements for the Mobile Advertisement Enabler. The following areas will be covered in this RD: \u0001 Personalisation of the Advertisements \u0001 Interactivity of Advertisements \u0001 Advertising Metrics The Mobile Advertisement Enabler will reuse as much as possible existing technologies. Some requirements may be covered by other OMA Enablers."},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/OMA-SUP-XSD_mobad_messages-V1_0-20120320-A.xsd","file":"OMA-SUP-XSD_mobad_messages-V1_0-20120320-A.xsd","status":"Approved","version":"V1.0","date":"2012-03-20","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/OMA-TS-MobAd_BCAST_Adaptation-V1_0-20120320-A.pdf","file":"OMA-TS-MobAd_BCAST_Adaptation-V1_0-20120320-A.pdf","status":"Approved","version":"V1.0","date":"2012-03-20","contentMediaType":"application/pdf","description":"This document specifies how the OMA Mobile Advertising (MobAd) Version 1.0 Enabler would interwork with the OMA Mobile Broadcast Services (BCAST) Enabler, so that BCAST can be used to support MobAd in the following ways: 1. Providing broadcast distribution of Advertisements (Ads) and Ad Metadata to BCAST-enabled MobAd terminals, and 2. Assisting the Ad Engine in selective Ad reception and storage, for subsequent delivery to Ad App(s). The scope of this document comprises the following aspects: • Interfaces and metadata required to achieve interoperability between the MobAd Ad Server operating over BCAST at the network side, and the MobAd Ad Engine operating beneath BCAST at the terminal side. • Utilization of the BCAST Service Guide [BCAST11-SG] specification which defines an Ad service, for carrying Ads and Ad Metadata, and its file broadcast schedule.  In the Ad service, the Service Guide also provides network-defined criteria for Ad filtering by the terminal."},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/OMA-TS-MobAd_Core-V1_0-20120320-A.pdf","file":"OMA-TS-MobAd_Core-V1_0-20120320-A.pdf","status":"Approved","version":"V1.0","date":"2012-03-20","contentMediaType":"application/pdf","description":"This document aims at specifying the functions and interfaces of MobAd Ad Server and MobAd Ad Engine as well as describing expected behaviors from Ad Engine, Ad Server, Ad App and SP App. These functions and behaviors relate to: • Ad Selection functions (e.g. based on criteria such as rules, metadata, C&P data) • Delivery of selected Ad(s) • Support for interactivity capabilities  • Reporting, measurement and validation of user actions with ads. (e.g. for the purpose of metrics consolidation) • Ad pre-fetching, caching, and managing Ad • Notification • Applying rules and Policy This document specifies the message flows, message patterns and data formats used for message exchanges between: • Ad Server and Ad Engine • Ad Server and SP App • Ad Engine and Ad App. This document further specifies the parameters used for Ad Metadata and Ad Metrics data by MobAd components and Ad App and SP App."},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20120320-A/OMA-TS-MobAd_DCD_Adaptation-V1_0-20120320-A.pdf","file":"OMA-TS-MobAd_DCD_Adaptation-V1_0-20120320-A.pdf","status":"Approved","version":"V1.0","date":"2012-03-20","contentMediaType":"application/pdf","description":"This document describes the additional functionalities necessary to enable MobAd services by using and leveraging the DCD Enabler.  These functionalities comprise at least the Registration and Deregistration of the Ad Engine to the DCD enabler, Channel Subscription and Unsubscription, the usage of Application Profile(s) and Subscription Filter(s) to personalize and contextualize the Ad channel delivery. This document defines the mapping of [MobAd-Core-TS] messages to [DCD-TSS] messages and specifies the usage of administrative messages over additional interfaces that have no equivalent in the [MobAd-Core-TS]. This document supplements the Core MobAd technical specification."}]}}