{"input":{"cteatedAt":"2021-02-18T12:28:50.856Z","url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20090707-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20090707-C/OMA-AD-Mobile_Advertising-V1_0-20090707-C.pdf","file":"OMA-AD-Mobile_Advertising-V1_0-20090707-C.pdf","status":"Candidate","version":"V1.0","date":"2009-07-07","contentMediaType":"application/pdf","description":"This document defines the architecture of Mobile Advertising (MobAd) Enabler. This architecture is based on the requirements listed in the MobAd Requirement Document [OMA-MOBAD-RD]. The objective of the MobAd Enabler architecture is to define network-side and device-side MobAd Enabler components, the interface(s) between them and the interface(s) exposed by those components to some entities that rely on MobAd Enabler (i.e. device-side Ad Apps as well as network-side SP Apps). The needs of external entities such as Content Providers, Advertisers, etc are not considered when defining interfaces for MobAd Enabler components, because those external entities are out of scope of MobAd AD and TS. The MobAd Enabler architecture is designed to support the core functionalities related to mobile advertising, in particular Ad Selection, Ad Delivery and Ad Metrics data handling."},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20090707-C/OMA-ERELD-MobAd-V1_0-20090707-C.pdf","file":"OMA-ERELD-MobAd-V1_0-20090707-C.pdf","status":"Candidate","version":"V1.0","date":"2009-07-07","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of MobAd according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20090707-C/OMA-ERP-MobAd-V1_0-20090707-C.zip","file":"OMA-ERP-MobAd-V1_0-20090707-C.zip","status":"Candidate","version":"V1.0","date":"2009-07-07","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MobAd/V1_0-20090707-C/OMA-RD-Mobile_Advertising-V1_0-20080805-C.pdf","file":"OMA-RD-Mobile_Advertising-V1_0-20080805-C.pdf","status":"Candidate","version":"V1.0","date":"2008-08-05","contentMediaType":"application/pdf","description":"This Requirement Document (RD) contains use cases and defines the requirements for the Mobile Advertisement Enabler. The following areas will be covered in this RD: \u0001Personalisation of the Advertisements \u0001Interactivity of Advertisements \u0001Advertising Metrics The Mobile Advertisement Enabler will reuse as much as possible existing technologies. Some requirements may be covered by other OMA Enablers."}]}}