{"input":{"cteatedAt":"2021-02-17T22:07:52.475Z","url":"http://www.openmobilealliance.org/release/DWAPI_3DP/V1_0-20171114-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/DWAPI_3DP/V1_0-20171114-C/OMA-ER-Device_WebAPIs_3DP-V1_0-20171114-C.pdf","file":"OMA-ER-Device_WebAPIs_3DP-V1_0-20171114-C.pdf","status":"Candidate","version":"V1.0","date":"2017-11-14","contentMediaType":"application/pdf","description":"This Enabler Release (ER) document is a combined document that includes requirements, architecture and technical specification of the Device WebAPIs Enabler. The scope of OMA Device WebAPI enabler will include:  Requirements, architecture and specifications for web-based APIs to expose services available from external devices and internal enablers through Extension Plug-Ins to applications.  The web-based APIs that will work in the framework that GotAPI (Generic Open Terminal API Framework) defines, where the web-based APIs are implemented in the Extension Plug-Ins and exposing the services from the external devices or internal enablers that are connected with the Extension Plug-Ins.  The framework provided by the combination of GotAPI and Device WebAPI to enable applications to work through standardized APIs with external devices or internal enablers, as GotAPI itself does not standardize the APIs to be implemented in the Extension Plug-Ins.  Web-based APIs that will initially address such areas as healthcare devices, DWAPI-PCH (Personal Connected Healthcare), DWAPI-3DP(3-Dimension Printer) and other areas where standardization will help solving application interoperability problems. OMA will continue expanding the coverage of the standaridized Device WebAPIs in areas where standardization helps the markets to expand and innovate."},{"url":"http://www.openmobilealliance.org/release/DWAPI_3DP/V1_0-20171114-C/OMA-ERELD-DWAPI_3DP-V1_0-20171114-C.pdf","file":"OMA-ERELD-DWAPI_3DP-V1_0-20171114-C.pdf","status":"Candidate","version":"V1.0","date":"2017-11-14","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Device Web API for 3DP, DWAPI-3DP according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/DWAPI_3DP/V1_0-20171114-C/OMA-ERP-DWAPI_3DP-V1_0-20171114-C.zip","file":"OMA-ERP-DWAPI_3DP-V1_0-20171114-C.zip","status":"Candidate","version":"V1.0","date":"2017-11-14","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DWAPI_3DP/V1_0-20171114-C/OMA-TS-3D_Printer_APIs-V1_0-20171114-C.pdf","file":"OMA-TS-3D_Printer_APIs-V1_0-20171114-C.pdf","status":"Candidate","version":"V1.0","date":"2017-11-14","contentMediaType":"application/pdf","description":"3D Printer is one of the most potential devices will be popular in the near future. And it has power to change the daily life. The GotAPI provides a multi-purpose web-based framework to enable interwork applications, external devices and external services including 3D printing service. The GotAPI for 3D printer consists of the GotAPI Server and the 3D Printer Extension Plug-Ins. A smartphone application communicates with the specific Extension Plug-In to control and use 3D printing service. In the flow of the 3D printing, the application could simply use 3D printer not only proximately but also remotely via Web technology by GotAPI Server and Contents Server of 3D Printing service. In the GotAPI framework, the 3D Printer Extension Plug-In interacts with a 3D printer as an external device and Contents Server as an external service, and exposes interfaces to the GotAPI Server as well. Due to the framework, a smartphone application could interact with various kinds of 3D printers using consistent APIs as defined in this specification."}]}}