{"input":{"cteatedAt":"2021-02-17T21:54:09.288Z","url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-AD-ConnMO-V1_0-20081024-A.pdf","file":"OMA-AD-ConnMO-V1_0-20081024-A.pdf","status":"Approved","version":"V1.0","date":"2008-10-24","contentMediaType":"application/pdf","description":"This document describes the use of Connectivity Management Objects in combination with the OMA Device Management Enabler to provide a Device Management Authority the facility to provision and maintain connectivity settings in a mobile terminal used for data applications to access network services over a variety of bearer types."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-DDS-DM_ConnMO-V1_0-20081107-A.pdf","file":"OMA-DDS-DM_ConnMO-V1_0-20081107-A.pdf","status":"Approved","version":"V1.0","date":"2008-11-07","contentMediaType":"application/pdf","description":"This document defines a set of managed objects which offer a standardized way to represent connectivity settings in a mobile device OMA Device Management tree. There were three main requirements that guided the drafting of this specification: •All connectivity parameters bootstrapped using OMA Client Provisioning can be subsequently addressed and managed via an OMA DM server; •An OMA DM server can add new or managing existing proxies and network access points using this enabler; •It should be possible to extend management objects with proprietary extensions. While these objects are optional for any OMA DM implementation, their widespread use will simplify the management of basic connectivity parameters in mobile terminals. The objects are defined using the OMA DM Device Description Framework [DMTND]. And each of the objects has standardized points of extension to permit implementation-specific parameters to accompany the standardized parameters. This added flexibility is intended to encourage the use of the standardized object while not unnecessarily restricting individual vendor innovations."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-DDS-DM_ConnMO_3GPP2-V1_0-20081024-A.pdf","file":"OMA-DDS-DM_ConnMO_3GPP2-V1_0-20081024-A.pdf","status":"Approved","version":"V1.0","date":"2008-10-24","contentMediaType":"application/pdf","description":"1.1     Connectivity     Object     –     CDMA     Bearer     This document defines CDMA bearer-specific parameters that are used together with the standardized connectivity management object [CONNMO] in order to have a complete standardized Network Access Point definition for CDMA connectivity settings in the OMA DM management tree. While this CDMA object is optional for any OMA DM implementation, its widespread use will simplify the management of basic CDMA connectivity parameters in devices. The object is defined using the OMA DM Device Description Framework [DMTND]. The object has standardized points of extension to permit implementation-specific parameters to accompany the standardized parameters. This added flexibility is intended to encourage the use of the standardized object while not unnecessarily restricting individual vendor innovations."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-DDS-DM_ConnMO_3GPPCS-V1_0-20081024-A.pdf","file":"OMA-DDS-DM_ConnMO_3GPPCS-V1_0-20081024-A.pdf","status":"Approved","version":"V1.0","date":"2008-10-24","contentMediaType":"application/pdf","description":"1.1     Connectivity Object – 3GPP Circuit-Switched Bearer This document defines a 3GPP Circuit-Switched (e.g. HSCSD) bearer specific parameters that are used together with the standardized connectivity management object [CONNMO] in order to have a complete standardized Network Access Point definition for 3GPP Circuit-Switched connectivity settings in the OMA DM management tree. While this 3GPP Circuit-Switched object is optional for any OMA DM implementation, their widespread use will simplify the management of basic 3GPP Circuit-Switched connectivity parameters in devices. The object is defined using the OMA DM Device Description Framework [DMTND]. The object has standardized points of extension to permit implementation-specific parameters to accompany the standardized parameters. This added flexibility is intended to encourage the use of the standardized object while not unnecessarily restricting individual vendor innovations."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-DDS-DM_ConnMO_3GPPPS-V1_0-20081024-A.pdf","file":"OMA-DDS-DM_ConnMO_3GPPPS-V1_0-20081024-A.pdf","status":"Approved","version":"V1.0","date":"2008-10-24","contentMediaType":"application/pdf","description":"1.1     Connectivity Object – 3GPP Packet Switched Bearer This document defines a 3GPP Packet Switched (e.g. WCDMA) bearer specific parameters used together with the standardized connectivity management object [CONNMO] in order to have a complete standardized Network Access Point definition for 3GPP Packet Switched connectivity settings in the OMA DM management tree. While this 3GPP Packet Switched object is optional for any OMA DM implementation, their widespread use will simplify the management of 3GPP Packet Switched connectivity parameters in devices. The object is defined using the OMA DM Device Description Framework [DMTND]. The object has standardized points of extension to permit implementation-specific parameters to accompany the standardized parameters. This added flexibility is intended to encourage the use of the standardized object while not unnecessarily restricting individual vendor innovations."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-DDS-DM_ConnMO_EAP-V1_0-20081024-A.pdf","file":"OMA-DDS-DM_ConnMO_EAP-V1_0-20081024-A.pdf","status":"Approved","version":"V1.0","date":"2008-10-24","contentMediaType":"application/pdf","description":"This document defines EAP specific parameters that are used together with the standardized connectivity management object [CONNMO] in order to have a complete standardized EAP management object for WLANand other bearers in the OMA DM management tree. While this EAP object is optional for any OMA DM implementation, their widespread use will simplify the management of basic EAP parameters in mobile devices. The object is defined using the OMA DM Device Description Framework [DMTND]. The object has standardized points of extension to permit implementation-specific parameters to accompany the standardized parameters. This added flexibility is intended to encourage the use of the standardized object while not unnecessarily restricting individual vendor innovations."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-DDS-DM_ConnMO_HTTPProxy-V1_0-20081024-A.pdf","file":"OMA-DDS-DM_ConnMO_HTTPProxy-V1_0-20081024-A.pdf","status":"Approved","version":"V1.0","date":"2008-10-24","contentMediaType":"application/pdf","description":"1.1     Connectivity Object – HTTP Proxy This document defines HTTP Proxy specific parameters that are used together with the standardized connectivity management object [CONNMO] in order to have a complete standardized Proxy management object for HTTP Proxy in the OMA DM management tree. While this HTTP Proxy object is optional for any OMA DM implementation, their widespread use will simplify the management of basic HTTP Proxy parameters in mobile terminals. The object is defined using the OMA DM Device Description Framework [DMTND]. The object has standardized points of extension to permit implementation-specific parameters to accompany the standardized parameters. This added flexibility is intended to encourage the use of the standardized object while not unnecessarily restricting individual vendor innovations."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-DDS-DM_ConnMO_WAPProxy-V1_0-20081024-A.pdf","file":"OMA-DDS-DM_ConnMO_WAPProxy-V1_0-20081024-A.pdf","status":"Approved","version":"V1.0","date":"2008-10-24","contentMediaType":"application/pdf","description":"1.1     Connectivity Object – WAP Proxy This document defines WAP Proxy specific parameters that are used together with the standardized connectivity management object [CONNMO] in order to have a complete standardized Proxy management object for WAP Proxy in the OMA DM management tree. While this WAP Proxy object is optional for any OMA DM implementation, their widespread use will simplify the management of basic WAP Proxy parameters in mobile terminals. The object is defined using the OMA DM Device Description Framework [DMTND]. The object has standardized points of extension to permit implementation-specific parameters to accompany the standardized parameters. This added flexibility is intended to encourage the use of the standardized object while not unnecessarily restricting individual vendor innovations."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-DDS-DM_ConnMO_WLAN-V1_0-20081024-A.pdf","file":"OMA-DDS-DM_ConnMO_WLAN-V1_0-20081024-A.pdf","status":"Approved","version":"V1.0","date":"2008-10-24","contentMediaType":"application/pdf","description":"1.1     Connectivity Object – WLAN Bearer This document defines a Wireless LAN (WLAN) bearer specific parameters used together with the standardized connectivity management object [CONNMO] in order to have a complete standardized Network Access Point definition for WLAN connectivity settings in the OMA DM management tree. While this WLAN object is optional for any OMA DM implementation, their widespread use will simplify the management of WLAN connectivity parameters in devices. The object is defined using the OMA DM Device Description Framework [DMTND]. The object has standardized points of extension to permit implementation-specific parameters to accompany the standardized parameters. This added flexibility is intended to encourage the use of the standardized object while not unnecessarily restricting individual vendor innovations."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-RD-ConnMO-V1_0-20081024-A.pdf","file":"OMA-RD-ConnMO-V1_0-20081024-A.pdf","status":"Approved","version":"V1.0","date":"2008-10-24","contentMediaType":"application/pdf","description":"This document defines the requirements for Device Management Connectivity Management Object, which is based on OMA DM v1.1.2 [OMA-DM] specifications and makes use of the functionalities provided by OMA DM v1.1.2 specifications to define standardized Management Object for connectivity parameter settings."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-RRELD-ConnMO-V1_0-20081107-A.pdf","file":"OMA-RRELD-ConnMO-V1_0-20081107-A.pdf","status":"Approved","version":"V1.0","date":"2008-11-07","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of ConnMO according to OMA Release process and the Reference Release document baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/ConnMO/V1_0-20081107-A/OMA-RRP-ConnMO-V1_0-20081107-A.zip","file":"OMA-RRP-ConnMO-V1_0-20081107-A.zip","status":"Approved","version":"V1.0","date":"2008-11-07","contentMediaType":"application/zip"}]}}