{"input":{"cteatedAt":"2021-02-17T22:14:35.372Z","url":"http://www.openmobilealliance.org/release/GwMO/V1_1-20130625-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/GwMO/V1_1-20130625-C/OMA-AD-GwMO-V1_1-20130625-C.pdf","file":"OMA-AD-GwMO-V1_1-20130625-C.pdf","status":"Candidate","version":"V1.1","date":"2013-06-25","contentMediaType":"application/pdf","description":"The scope of the Gateway Management Object architecture document is to define the architecture for the DM Gateway Management Object v1.1 enabler. This document fulfills the functional capabilities and information flows needed to support this enabler as described in the Gateway Management Object requirements document [GwMO-RD]."},{"url":"http://www.openmobilealliance.org/release/GwMO/V1_1-20130625-C/OMA-ERELD-GwMO-V1_1-20130625-C.pdf","file":"OMA-ERELD-GwMO-V1_1-20130625-C.pdf","status":"Candidate","version":"V1.1","date":"2013-06-25","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Gateway Management Object (GwMO v1.1) according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/GwMO/V1_1-20130625-C/OMA-ERP-GwMO-V1_1-20130625-C.zip","file":"OMA-ERP-GwMO-V1_1-20130625-C.zip","status":"Candidate","version":"V1.1","date":"2013-06-25","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/GwMO/V1_1-20130625-C/OMA-RD-GwMO-V1_1-20130226-C.pdf","file":"OMA-RD-GwMO-V1_1-20130226-C.pdf","status":"Candidate","version":"V1.1","date":"2013-02-26","contentMediaType":"application/pdf","description":"This document lists the complete set of requirements for the OMA DM Gateway Management Object Enabler v1.1. It includes all the requirement of the OMA DM GatewayMO v1.0. It mainly focuses on requirements to enable a DM Server to manage devices that are not directly accessible to the OMADM Server (for example, because the devices are deployed behind a firewall or because the devices do not support the OMA DM protocol).  This document also provides requirements for management of devices in a Machine to Machine (M2M) ecosystem (for example, fanning out DM commands from a DM Server to multiple End Devices and aggregating responses from multiple End Devices so that a consolidated response is sent back to the DM Server).   The following issues are outside the scope of this document:  Device discovery mechanisms  Management protocol adaptation rules"}]}}