{"input":{"cteatedAt":"2021-02-17T21:51:07.906Z","url":"http://www.openmobilealliance.org/release/Charging/V1_1-20090728-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Charging/V1_1-20090728-C/OMA-AD-Charging-V1_1-20090728-C.pdf","file":"OMA-AD-Charging-V1_1-20090728-C.pdf","status":"Candidate","version":"V1.1","date":"2009-07-28","contentMediaType":"application/pdf","description":"For the growth of the mobile service market, it is important to facilitate the deployment of various kinds of new applications. Charging has been determined to be an important and necessary enabler for all these new applications. Applications can be provided by third parties, either within or outside the trusted domain of an infrastructure provider. Easy, flexible and secure charging for service provider applications that reside outside an infrastructure provider’s trusted domain is thought to be particularly important for realizing new market opportunities. This document defines the architecture to enable charging for applications that use OMA enablers, both inside and outside of the trusted domain of the infrastructure provider. OMA’s Charging Enabler follows the OSE principles and coordinates the charging data triggers, and flow from OMA enablers or other resources into an underlying charging infrastructure. The charging architecture supports not only legacy charging for network resources, but also new charging types triggered by OMA enablers or other resources. The requirements for these charging primitives/mechanisms must be applicable to any offered mobile service that is commercially deployed.  Defining the architecture for charging of services which are not defined by OMA (e.g. 3GPP/2 services) is outside the scope of this document. These services include but are not limited to voice calls and SMS, IP access in 2.5G and WLAN/Wi-Fi 1as well as charging for access and IMS session in 3G. Solutions covered by this architecture document are not limited to communicate with a 3GPP/2 network, although it will be the first objective to manage interoperability between OMA, and 3GPP/2 in charging. This work aims to shrink the gap between standards, products and implementations. For further clarification, and in any uncertainties, please refer to the charging worksplit agreement between the OMA and 3GPP/2 laid out in [CHRG_WRKSPLT].  1©2004 Wi-Fi Alliance. All rights reserved. Wi-Fi® is a registered trademark of the Wi-Fi Alliance. Wi-Fi CERTIFIED(tm), WMM(tm), WPA(tm), WPA2(tm) and Wi-Fi ZONE(tm) are certification marks of the Wi-Fi Alliance."},{"url":"http://www.openmobilealliance.org/release/Charging/V1_1-20090728-C/OMA-ERELD-Charging-V1_1-20090728-C.pdf","file":"OMA-ERELD-Charging-V1_1-20090728-C.pdf","status":"Candidate","version":"V1.1","date":"2009-07-28","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of the Charging Enabler V1.1 according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/Charging/V1_1-20090728-C/OMA-ERP-Charging-V1_1-20090728-C.zip","file":"OMA-ERP-Charging-V1_1-20090728-C.zip","status":"Candidate","version":"V1.1","date":"2009-07-28","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/Charging/V1_1-20090728-C/OMA-RD-Charging-V1_0-20070904-A.pdf","file":"OMA-RD-Charging-V1_0-20070904-A.pdf","status":"Approved","version":"V1.0","date":"2007-09-04","contentMediaType":"application/pdf","description":"This Requirement Document (RD) contains market driven, interoperable charging requirements for OMA defined mobile service enablers. This document captures the overall charging needs on mobile service enablers, from the perspective of service subscriber, user, mobile network operator, service provider, application provider and content provider. The information contained in this RD is applicable to service providers (i.e. network operators), application/content developers and infrastructure/terminal manufacturers. The Use Cases in this document illustrate the market need for the various charging principles that requires support from mobile service enablers’s interworking charging capabilities. In scope: •Charging functionality requirements across the various service enablers, capturing device, clients, service platforms, connectivity and content. •Requirements to facilitate event / time / session / subscription charging for each service type (communications, content and applications). •Requirements to support online and offline charging methods (i.e. prepay and postpay payment methods), real-time charging and mechanisms for ‘A’ party pays. •Requirements for charging interfaces between content provider, service provider and mobile operator. •Requirements for the management of charging events, which are closely related to identification, authorisation and security mechanisms. Out of scope: Billing and payment is outside the scope of this Work Item."},{"url":"http://www.openmobilealliance.org/release/Charging/V1_1-20090728-C/OMA-TS-Charging_3GPP_3GPP2-V1_0-20070904-A.pdf","file":"OMA-TS-Charging_3GPP_3GPP2-V1_0-20070904-A.pdf","status":"Approved","version":"V1.0","date":"2007-09-04","contentMediaType":"application/pdf","description":"This Technical Specification (TS) identifies a set of capabilities within the Online Charging System (OCS) and Offline Charging as defined by 3GPP and 3GPP2 that can be utilized for the OMA service enabler implementations.   This TS describes how OMA service enabler implementations interface with an underlying Charging Infrastructure as specified by 3GPP and 3GPP2 in order to ensure interoperability. This Technical Specification is applicable to all OMA service enabler implementations, which use the capabilities of an underlying 3GPP and 3GPP2 infrastructure for charging."},{"url":"http://www.openmobilealliance.org/release/Charging/V1_1-20090728-C/OMA-TS-Charging_Offline-V1_1-20090728-C.pdf","file":"OMA-TS-Charging_Offline-V1_1-20090728-C.pdf","status":"Candidate","version":"V1.1","date":"2009-07-28","contentMediaType":"application/pdf","description":"The charging architecture document [CHRG_AD] describes two different interfaces between the Charging Enabler User and the Charging Enabler: Offline charging interface (CH-1) and online charging interface (CH-2). The scope of this document is to provide the technical specification of the CH-1 interface.  This document defines: •The offline charging models, the logical messages, and messages types on the CH-1 interface.  •The OMA Charging Data Elements used in the logical messages with their descriptions. •The flow of information exchanged between the Charging Enabler User and the Charging Enabler through time in different scenarios. •Bindings of OMA CH-1 logical messages to a specific protocol (e.g. Diameter protocol) and its protocol messages."},{"url":"http://www.openmobilealliance.org/release/Charging/V1_1-20090728-C/OMA-TS-Charging_Online-V1_1-20090728-C.pdf","file":"OMA-TS-Charging_Online-V1_1-20090728-C.pdf","status":"Candidate","version":"V1.1","date":"2009-07-28","contentMediaType":"application/pdf","description":"The charging architecture document [CHRG_AD] identifies two different interfaces between the Charging Enabler User and the Charging Enabler: Offline charging interface (CH-1) and online charging interface (CH-2).  The scope of this document is to provide the technical specification of the CH-2 interface.  This document defines: •The online charging models, the logical messages and message types on the CH-2 interface.  •The OMA Charging Data Elements used in the logical messages with their descriptions. •The flow of information exchanged between the Charging Enabler User and the Charging Enabler through time in different scenarios. •Bindings of OMA CH-2 logical messages to specific protocols (i.e. the IETF Diameter Credit Control and Parlay X Web Services Payment API)."},{"url":"http://www.openmobilealliance.org/release/Charging/V1_1-20090728-C/OMA-WP-Charging_Deployment_Scenarios-20070904-A.pdf","file":"OMA-WP-Charging_Deployment_Scenarios-20070904-A.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This White Paper is related to the OMA Charging Enabler. It shows a number of possible ways to deploy the logical functions of the Charging Enabler with different sets of deployment entities. This White Paper should be regarded as background work for the Charging Enabler that helps the reader to understand the contents of the OMA Charging Enabler. The White Paper may also be useful for readers who are planning to implement the OMA Charging Enabler but it does not give normative deployment guidelines. These can be found from the deployment specifications of the OMA Charging Enabler."}]}}