{"input":{"cteatedAt":"2021-02-17T22:10:52.763Z","url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/OMA-ER-EVC-V1_0-20150602-C.pdf","file":"OMA-ER-EVC-V1_0-20150602-C.pdf","status":"Candidate","version":"V1.0","date":"2015-06-02","contentMediaType":"application/pdf","description":"The scope  of  Enhanced  Visual  Call (EVC)  Enabler  is  to  define  an  interoperable service  framework  that  enables  seamless integration of a call and various enriched information (e.g., visual, text) provided to the EVC User in association with the call. The enriched information can be exchanged during different stages (pre-call, during the call, after the call) of a standard/plain call  or  an  Interactive  Voice  Response  (IVR)  call.  EVC  Enabler  use  cases  connect  together  consumer  type  of  users  and  business users, enabling service reachability to both market segments. This Enabler Release (ER) document is a combined document that contains the requirements, architecture and the detailed technical specifications for the EVC Enabler. High-level requirements and overall system requirements as well as several use cases which provide examples of services that should be enabled by EVC Enabler are specified in this document. This specification also defines the architectural interfaces, functional components, high level flows that address all the requirements in this document. It further includes the technical realization of EVC 1.0 requirements."},{"url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/OMA-ERELD-EVC-V1_0-20150602-C.pdf","file":"OMA-ERELD-EVC-V1_0-20150602-C.pdf","status":"Candidate","version":"V1.0","date":"2015-06-02","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Enhanced Visual Call (EVC) according to OMA Release process and the Enabler Release specification baseline listed in section 5.  Enhanced Visual  Call (EVC) Enabler defines an interoperable service framework that enables seamless integration of a call and  various  enriched  information  (e.g.,  visual,  text)  provided  to  the  EVC  User  in  association  with  the  call.  The enriched information  can  be  exchanged  during  different  stages  (pre-call,  during  the  call,  after  the  call)  of  a  standard/plain  call  or  an  Interactive Voice Response (IVR) call. EVC Enabler use cases connect together consumer type of users and business users, enabling service reachability to both market segments. This Enabler Release (ER) document is a combined document that contains the requirements, architecture and the detailed technical specifications for the EVC Enabler. High-level requirements and overall system requirements as well as several use cases which provide examples of services that should be enabled by EVC Enabler are specified in this document. This specification also defines the architectural interfaces, functional components, high level flows that address all the requirements in this document. It further includes the technical realization of EVC 1.0 requirements."},{"url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/OMA-ERP-EVC-V1_0-20150602-C.zip","file":"OMA-ERP-EVC-V1_0-20150602-C.zip","status":"Candidate","version":"V1.0","date":"2015-06-02","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/OMA-SUP-XSD_EVC_EnrichedInfo-V1_0-20150602-C.txt","file":"OMA-SUP-XSD_EVC_EnrichedInfo-V1_0-20150602-C.txt","status":"Candidate","version":"V1.0","date":"2015-06-02","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/OMA-SUP-XSD_EVC_VisualIVRInfoReq-V1_0-20150602-C.txt","file":"OMA-SUP-XSD_EVC_VisualIVRInfoReq-V1_0-20150602-C.txt","status":"Candidate","version":"V1.0","date":"2015-06-02","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/OMA-SUP-XSD_EVC_VisualIVRInfoRes-V1_0-20150602-C.txt","file":"OMA-SUP-XSD_EVC_VisualIVRInfoRes-V1_0-20150602-C.txt","status":"Candidate","version":"V1.0","date":"2015-06-02","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/OMA-SUP-XSD_VisualIVRMapping-V1_0-20150602-C.txt","file":"OMA-SUP-XSD_VisualIVRMapping-V1_0-20150602-C.txt","status":"Candidate","version":"V1.0","date":"2015-06-02","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/OMA-TS-EVC_MO-V1_0-20150602-C.pdf","file":"OMA-TS-EVC_MO-V1_0-20150602-C.pdf","status":"Candidate","version":"V1.0","date":"2015-06-02","contentMediaType":"application/pdf","description":"This document defines the OMA Enhanced Visual Call (EVC) Management Object (MO). The MO is defined using the OMA Device Description Framework."},{"url":"http://www.openmobilealliance.org/release/EVC/V1_0-20150602-C/OMA-TS-EVC_XDMS-V1_0-20150602-C.pdf","file":"OMA-TS-EVC_XDMS-V1_0-20150602-C.pdf","status":"Candidate","version":"V1.0","date":"2015-06-02","contentMediaType":"application/pdf","description":"This specification describes the data formats and XDM Application Usages for the Enhanced Visual Call (EVC) XML Documents."}]}}