{"input":{"cteatedAt":"2021-02-18T12:19:14.340Z","url":"http://www.openmobilealliance.org/release/MEM/V1_0-20110802-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MEM/V1_0-20110802-A/OMA-AD-Mobile_Email-V1_0-20110802-A.pdf","file":"OMA-AD-Mobile_Email-V1_0-20110802-A.pdf","status":"Approved","version":"V1.0","date":"2011-08-02","contentMediaType":"application/pdf","description":"This document describes the logical architecture of the OMA mobile email enabler to guide the technical specification work. While mobile email is defined in the requirement document [MEM-RD] as access to email from a mobile device, the focus of this document is to describe an architecture that provides an improved user experience over alternate means of access to email like browsing, email notification or message / voice based access. The goal of the MEM Enabler is to provide quasi-instantaneous and secure updates of the MEM Client with new emails and server changes, optimized online and off-line usage and capability to securely send email from the appropriate server."},{"url":"http://www.openmobilealliance.org/release/MEM/V1_0-20110802-A/OMA-ERELD-Mobile_Email-V1_0-20110802-A.pdf","file":"OMA-ERELD-Mobile_Email-V1_0-20110802-A.pdf","status":"Approved","version":"V1.0","date":"2011-08-02","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Mobile Email according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/MEM/V1_0-20110802-A/OMA-ERP-Mobile_Email-V1_0-20110802-A.zip","file":"OMA-ERP-Mobile_Email-V1_0-20110802-A.zip","status":"Approved","version":"V1.0","date":"2011-08-02","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MEM/V1_0-20110802-A/OMA-RD-MobileEmail-V1_0-20110802-A.pdf","file":"OMA-RD-MobileEmail-V1_0-20110802-A.pdf","status":"Approved","version":"V1.0","date":"2011-08-02","contentMediaType":"application/pdf","description":"Mobile email is defined as an email enabler optimized to support email usage in mobile devices and wireless networks.  This document describes various use cases to illustrate key mobile email usage patterns and will also provide a comprehensive set of high level requirements that can be derived from the use cases.  High-level requirements can be used as a basis for more detailed architecture definition work for a Mobile Email enabler This Requirements Document focuses on requirements for the enabler specifications rather than for particular implementations of those.  Whether the described features are optional or mandatory for implementations will be decided at a later stage."},{"url":"http://www.openmobilealliance.org/release/MEM/V1_0-20110802-A/OMA-SUP-MO_MEM-V1_0-20110802-A.txt","file":"OMA-SUP-MO_MEM-V1_0-20110802-A.txt","status":"Approved","version":"V1.0","date":"2011-08-02","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/MEM/V1_0-20110802-A/OMA-TS-Mobile_Email-V1_0-20110802-A.pdf","file":"OMA-TS-Mobile_Email-V1_0-20110802-A.pdf","status":"Approved","version":"V1.0","date":"2011-08-02","contentMediaType":"application/pdf","description":"This document defines the technical specification for the OMA Mobile Email Enabler to ensure an inter-operable solution.  The goal of the MEM Enabler is to provide quasi-instantaneous and secure updates of the MEM Client with new emails and MEM server changes, optimized online and off-line usage and capability to securely send email from the appropriate MEM server.  While mobile email is defined in the requirement document [MEM RD] and the logical architecture is described in architecture document [MEM AD], this document defines technical specification for the fundamental events and notification mechanisms, management interfaces, client capabilities, client configuration, content transcoding, binding of IETF Lemonade based and OMA DS based MEM protocols.  Management Object and charging for the OMA MEM Enabler are defined respectively in two separate technical specifications [MEM MO] [MEM Charging]."},{"url":"http://www.openmobilealliance.org/release/MEM/V1_0-20110802-A/OMA-TS-Mobile_Email_MO-V1_0-20110802-A.pdf","file":"OMA-TS-Mobile_Email_MO-V1_0-20110802-A.pdf","status":"Approved","version":"V1.0","date":"2011-08-02","contentMediaType":"application/pdf","description":"This document defines the OMA Mobile Email (MEM) Management Object (MO)."}]}}