{"input":{"cteatedAt":"2021-02-17T21:44:57.243Z","url":"http://www.openmobilealliance.org/release/CMI/V1_0-20090127-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20090127-C/OMA-ERELD-CMI-V1_0-20090127-C.pdf","file":"OMA-ERELD-CMI-V1_0-20090127-C.pdf","status":"Candidate","version":"V1.0","date":"2009-01-27","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of CMI according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20090127-C/OMA-ERP-CMI-V1_0-20090127-D.zip","file":"OMA-ERP-CMI-V1_0-20090127-D.zip","status":"Draft","version":"V1.0","date":"2009-01-27","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20090127-C/OMA-RD-CMI-V1_0-20090127-C.pdf","file":"OMA-RD-CMI-V1_0-20090127-C.pdf","status":"Candidate","version":"V1.0","date":"2009-01-27","contentMediaType":"application/pdf","description":"This Requirement Document (RD) contains use cases and defines the requirements for the Content Management Interface Enabler. This covers the development of an API between Content Provider and Service Provider (e.g. Operator). The following areas will be covered in this RD: \u0001 Purchase Content Activities \u0001 Download/Upload Content \u0001 Statistical Content Information The scope includes the development of an API only.  The work will not cover the implementation of the API by the Service Providers and will not cover the Content Provider functionalities. The Content Management Interface Enabler will reuse as much as possible existing technologies. Some requirements may be covered by other OMA Enablers. Potential candidate technologies to consider for partially or full re-use may include [3G 29.199-21] [OMA DCD] etc. Further candidates may be identified at architecture and/or interface specification stage."}]}}