{"input":{"cteatedAt":"2021-02-17T21:45:02.215Z","url":"http://www.openmobilealliance.org/release/CMI/V1_0-20110705-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20110705-A/OMA-AD-CMI-V1_0-20110705-A.pdf","file":"OMA-AD-CMI-V1_0-20110705-A.pdf","status":"Approved","version":"V1.0","date":"2011-07-05","contentMediaType":"application/pdf","description":"This Architecture Document (AD) defines the architectural elements of the Content Management Interface (CMI) enabler. The CMI enabler provides mechanisms for the management of content by Content Providers and Service Providers.  This AD describes the CMI architecture in terms of its: \u0001 functional components and the interfaces they provide \u0001 reuse of existing technologies, including partial or full use of other OMA enablers \u0001 security-related aspects  The CMI enabler addresses only the interfaces that can be used by entities for content management purposes. It does not cover the use of these interfaces in services built upon other OMA enablers, or any non-CMI functions provided by Service Providers and Content Providers."},{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20110705-A/OMA-ERELD-CMI-V1_0-20110705-A.pdf","file":"OMA-ERELD-CMI-V1_0-20110705-A.pdf","status":"Approved","version":"V1.0","date":"2011-07-05","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of CMI according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20110705-A/OMA-ERP-CMI-V1_0-20110705-A.zip","file":"OMA-ERP-CMI-V1_0-20110705-A.zip","status":"Approved","version":"V1.0","date":"2011-07-05","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20110705-A/OMA-ETR-CMI-V1_0-20110705-A.pdf","file":"OMA-ETR-CMI-V1_0-20110705-A.pdf","status":"Approved","version":"V1.0","date":"2011-07-05","contentMediaType":"application/pdf","description":"The Enabler Test Requirements (ETR) document for the Enabler under consideration is created and maintained by the Technical Working Group (TWG) responsible for the technical specifications for the corresponding Enabler. The ETR document is intended to cover at least those requirements collected in the Requirements Document (RD) and the Architecture Document (AD) in addition to any other items the TWG has identified as important enough to warrant attention from interoperability perspective and identify any technical functionalities that should be covered by testing."},{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20110705-A/OMA-RD-CMI-V1_0-20110705-A.pdf","file":"OMA-RD-CMI-V1_0-20110705-A.pdf","status":"Approved","version":"V1.0","date":"2011-07-05","contentMediaType":"application/pdf","description":"This Requirement Document (RD) contains use cases and defines the requirements for the Content Management Interface Enabler. This covers the development of an API between Content Provider and Service Provider (e.g. Operator). The following areas will be covered in this RD: \u0001 Purchase Content Activities \u0001 Download/Upload Content \u0001 Statistical Content Information The scope includes the development of an API only.  The work will not cover the implementation of the API by the Service Providers and will not cover the Content Provider functionalities. The Content Management Interface Enabler will reuse as much as possible existing technologies. Some requirements may be covered by other OMA Enablers. Potential candidate technologies to consider for partially or full re-use may include [3G 29.199-21] [OMA DCD] etc. Further candidates may be identified at architecture and/or interface specification stage."},{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20110705-A/OMA-SUP-XSD_cmi_package-V1_0-20110705-A.txt","file":"OMA-SUP-XSD_cmi_package-V1_0-20110705-A.txt","status":"Approved","version":"V1.0","date":"2011-07-05","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/CMI/V1_0-20110705-A/OMA-TS-CMI-V1_0-20110705-A.pdf","file":"OMA-TS-CMI-V1_0-20110705-A.pdf","status":"Approved","version":"V1.0","date":"2011-07-05","contentMediaType":"application/pdf","description":"The CMI enabler provides mechanisms for the management of content by Content Providers and Service Providers. This specification defines the API between Content Provider and Service Provider (e.g. Operator) for managing content. It covers the following areas: \u0001 Purchase Content Activities \u0001 Download/Upload Content \u0001 Statistical Content Information The implementation of the API by the Service Providers and the Content Provider functionalities are out of the scope of this specification."}]}}