{"input":{"cteatedAt":"2021-02-17T22:09:35.862Z","url":"http://www.openmobilealliance.org/release/Download/V1_0-20021219-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Download/V1_0-20021219-C/OMA-Download-OTA-V1_0-20021219-C.pdf","file":"OMA-Download-OTA-V1_0-20021219-C.pdf","status":"Candidate","version":"V1.0","date":"2002-12-19","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the Open Mobile Alliance is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast and flexible service creation, WAP defines a set of protocols in transport, session, and application layers. For additional information on the WAP architecture, refer to [WAPARCH]. This specification defines application-level protocols and behaviours needed to provide both powerful as well as reliable content download functionality. It is anticipated that this will be an enabler for billing, and thus make premium priced content available to mobile users. The specification addresses requirements such as Content Discovery, Authentication, Delivery Negotiation, Content Delivery and Delivery Confirmation. It takes advantage of work that has been done in the above-mentioned areas in both the Open Mobile Alliance as well as in the Java Community Process (sm). The technology defined in this specification provides a consistent download interface and functionality for all generic content types, to complement the download of JavaTM applications that has been defined in [MIDPOTA].  The intended audience of this specification are implementers of Download Agents and download servers, as well as other people who have some in-depth interest in the download procedures. It is not intended to be a tutorial for application authors.    2002, Open Mobile Alliance, Ltd. All rights reserved"},{"url":"http://www.openmobilealliance.org/release/Download/V1_0-20021219-C/OMA-Download_OTA-V1_0-20021219-C.zip","file":"OMA-Download_OTA-V1_0-20021219-C.zip","status":"Candidate","version":"V1.0","date":"2002-12-19","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/Download/V1_0-20021219-C/OMA-ERELD-DL-V1_0-20021104-D.pdf","file":"OMA-ERELD-DL-V1_0-20021104-D.pdf","status":"Draft","version":"V1.0","date":"2002-11-04","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Download according to OMA Release process and the Enabler Release specification baseline listed in section 5.  This Download Enabler defines application-level protocols and behaviours to provide confirmed content download functionality. It is anticipated that this will be an enabler for billing, to help make premium priced content available to mobile users."}]}}