{"input":{"cteatedAt":"2021-02-18T13:12:36.426Z","url":"http://www.openmobilealliance.org/release/STI/V1_0-20050704-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/STI/V1_0-20050704-C/OMA-AD-STI-20050607-C.pdf","file":"OMA-AD-STI-20050607-C.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"The  scope  of  OMA  Standard  Transcoding  Interface  (STI)  is  to  provide  a  standardized  interface  between  Multimedia  Application  Platforms  and  a  Transcoding  Platform  to  allow  transcoding  of  media  Content  files  based  on  Application  specified transcoding parameters and/or User Equipment capabilities. The activity started as a request from some Mobile Network Operators that are OMA members, requesting that an interface for  transcoding  be  standardized.    One  of  the  first  targeted  implementations  of  this  interface  is  between  the  MMSC  and  a  Transcoding  Platform.    Note  however  that  the  work  of  STI  is  not  limited  to  an  interface  between  the  MMSC  and  a  Transcoding  Platform;  it  is  the  goal  to  be  generic  enough  to  allow  other  applications  such  as  browsing,  media  download  services, push services, etc to also make use of such an interface. The  notion  of  “Content  adaptation”  or  “transcoding”  in  this  document  refers  to  the  transformation  and  manipulation  of  Content (images, audio, video, text, presentation, etc.) to meet the desired targets (defined by the User Equipment capabilities and/or the application needs).  Since STI is an interface and not a node per se, the architecture presented here is not the architecture of the interface nor is it the architecture of the Transcoding Platform.  It is a document describing a network architecture in which certain nodes use the STI interface; basically the Architecture of the Environment using the Standard Transcoding Interface. This document is part of the OMA STI version 1.0 specification suite."},{"url":"http://www.openmobilealliance.org/release/STI/V1_0-20050704-C/OMA-ERELD-STI-V1_0-20050704-C.pdf","file":"OMA-ERELD-STI-V1_0-20050704-C.pdf","status":"Candidate","version":"V1.0","date":"2005-07-04","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of  STI (Standard Transcoding Interface) according to OMA Release process and the Enabler Release specification baseline listed in section 5.  This document presents the normative and informative elements of a transcoding interface between the Transcoding Platform and the Application Platforms. The primary purpose of the interface is to request transcoding of media Content files based on specified transcoding parameters, User Equipment capabilities and Application policies and to return the corresponding transcoded media files."},{"url":"http://www.openmobilealliance.org/release/STI/V1_0-20050704-C/OMA-ERP-STI-V1_0-20050704-C.zip","file":"OMA-ERP-STI-V1_0-20050704-C.zip","status":"Candidate","version":"V1.0","date":"2005-07-04","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/STI/V1_0-20050704-C/OMA-RD-STI-V1_0-20050517-C.pdf","file":"OMA-RD-STI-V1_0-20050517-C.pdf","status":"Candidate","version":"V1.0","date":"2005-05-17","contentMediaType":"application/pdf","description":"This document defines the requirements and boundaries of the first STI (Standard Transcoding Interface) specification within OMA. This first release is referred to as “STI 1.0”. STI is the interface between the Transcoding Platform and the Multimedia Application Platforms; it is primarily used to request transcoding of media Content files based on Application specified transcoding parameters and constraints and/or User Equipment capabilities, and to return the corresponding transcoded media files. STI is not intended to be used directly by end-users. The notion of “Content adaptation” or “transcoding” in this document refers to the transformation and manipulation of Content (images, audio, video, text, presentation...etc.) to meet the desired targets (defined by the terminal capabilities and/or the application needs). Those adaptations include: media format transcoding, scaling, re-sampling, file size compression...etc. The document describes a number of use cases and the list of derived requirements for STI 1.0."},{"url":"http://www.openmobilealliance.org/release/STI/V1_0-20050704-C/OMA-TS-SCHEMA-STI-V1_0-20050607-C.xsd","file":"OMA-TS-SCHEMA-STI-V1_0-20050607-C.xsd","status":"Candidate","version":"V1.0","date":"2005-06-07","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/STI/V1_0-20050704-C/OMA-TS-STI-V1_0-20050704-C.pdf","file":"OMA-TS-STI-V1_0-20050704-C.pdf","status":"Candidate","version":"V1.0","date":"2005-07-04","contentMediaType":"application/pdf","description":"This document presents the normative and informative elements of a transcoding interface between a Transcoding Platform and Application Platforms. The primary purpose of the interface is to request transcoding of media Content files based on specified transcoding parameters, User Equipment capabilities and application policies and to return the corresponding transcoded media files. The notion of “Content Adaptation” or “Transcoding” in this document refers to the transformation and manipulation of Content (images, audio, video, text, presentation...etc.) to meet the desired targets (defined by the terminal capabilities and the application needs). Those adaptations include: media format transcoding, scaling, re-sampling, file size compression...etc. The document describes a number of interface exchange examples and proposes syntax and semantics for the first OMA STI specification."}]}}