{"input":{"cteatedAt":"2021-02-17T21:57:18.977Z","url":"http://www.openmobilealliance.org/release/DM/V1_2-20060309-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/DM/V1_2-20060309-C/OMA-ERELD-DM-V1_2-20060309-C.pdf","file":"OMA-ERELD-DM-V1_2-20060309-C.pdf","status":"Candidate","version":"V1.2","date":"2006-03-09","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of  Device Management according to OMA Release process and the Enabler Release specification baseline listed in section 5. The OMA DM v1.2 specifications are based on the OMA Device Management (DM) v1.1.2 specifications and make use of the OMA SyncML Common v1.2 specifications as specified in the OMA SyncML Common specifications Enabler Release Definition [ERELDSC].  The SyncML Initiative, Ltd. was a not-for-profit corporation formed by a group of companies who co-operated to produce an open specification for data synchronization and device management. Prior to SyncML, data synchronization and device management had been based on a set of different, proprietary protocols, each functioning only with a very limited number of devices, systems and data types. These non-interoperable technologies have complicated the tasks of users, manufacturers, service providers, and developers. Further, a proliferation of different, proprietary data synchronization and device management protocols has placed barriers to the extended use of mobile devices, has restricted data access and delivery and limited the mobility of the users. The  SyncML Initiative merged with the Open Mobile Alliance in November 2002.  The SyncML legacy specifications were converted to the OMA format with the 1.1.2 versions of OMA SyncML Common, OMA Data Synchronization and OMA Device Management  in May 2002.  The relationship between these documents which had been created during the SyncML Initiative  has been preserved and is depicted in Figure 1: OMA DS and DM Specification Structure and Relationship. Figure 1: OMA DS and DM Specification Structure and Relationship"},{"url":"http://www.openmobilealliance.org/release/DM/V1_2-20060309-C/OMA-ERP-DM-V1_2-20060309-C.zip","file":"OMA-ERP-DM-V1_2-20060309-C.zip","status":"Candidate","version":"V1.2","date":"2006-03-09","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DM/V1_2-20060309-C/OMA-RD-DM-V1_2-20060309-C.pdf","file":"OMA-RD-DM-V1_2-20060309-C.pdf","status":"Candidate","version":"V1.2","date":"2006-03-09","contentMediaType":"application/pdf","description":"The  scope  of  this  document  is  a  requirements  description  for  Device  Management  (for  the  definition  of  Device  see  section  3.2). This document describes a set of functional requirements (partly on an abstract level) for the management of a Device’s changeable parameters, as seen from the Management Authority’s points of view. This  document  contains  information  applicable  to  Network  Operators,  terminal  and  network  manufacturers,  enterprises,  independent software vendors, content providers, and service providers. This  document  covers  the  requirements  needed  to  supply  the  core  Device  Management  service.  Additional,  related  functionality not described here may involve requirements outside the scope of this document. This additional functionality shall not interfere with the core service described in this document."},{"url":"http://www.openmobilealliance.org/release/DM/V1_2-20060309-C/OMA-TS-DM-TND-V1_2-20060309-C.pdf","file":"OMA-TS-DM-TND-V1_2-20060309-C.pdf","status":"Candidate","version":"V1.2","date":"2006-03-09","contentMediaType":"application/pdf","description":"This document defines the management tree and the nodes on which the OMA DM protocol acts. A standardized way to describe these nodes is also specified."}]}}