{"input":{"cteatedAt":"2021-02-17T21:57:13.308Z","url":"http://www.openmobilealliance.org/release/DM/V1_2-20050826-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/DM/V1_2-20050826-C/OMA-ERELD-DM-V1_2-20050826-C.pdf","file":"OMA-ERELD-DM-V1_2-20050826-C.pdf","status":"Candidate","version":"V1.2","date":"2005-08-26","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of  Device Management according to OMA Release process and the Enabler Release specification baseline listed in section 5. The OMA DM v1.2 specifications are based on the OMA Device Management (DM) v1.1.2 specifications and make use of the OMA SyncML Common v1.2 specifications as specified in the OMA SyncML Common specifications Enabler Release Definition [ERELDSC].  The SyncML Initiative, Ltd. was a not-for-profit corporation formed by a group of companies who co-operated to produce an open specification for data synchronization and device management. Prior to SyncML, data synchronization and device management had been based on a set of different, proprietary protocols, each functioning only with a very limited number of devices, systems and data types. These non-interoperable technologies have complicated the tasks of users, manufacturers, service providers, and developers. Further, a proliferation of different, proprietary data synchronization and device management protocols has placed barriers to the extended use of mobile devices, has restricted data access and delivery and limited the mobility of the users. The  SyncML Initiative merged with the Open Mobile Alliance in November 2002.  The SyncML legacy specifications were converted to the OMA format with the 1.1.2 versions of OMA SyncML Common, OMA Data Synchronization and OMA Device Management  in May 2002.  The relationship between these documents which had been created during the SyncML Initiative  has been preserved and is depicted in Figure 1: OMA DS and DM Specification Structure and Relationship. Figure 1: OMA DS and DM Specification Structure and Relationship"},{"url":"http://www.openmobilealliance.org/release/DM/V1_2-20050826-C/OMA-ERP-DM-V1_2-20050826-C-pdf.zip","file":"OMA-ERP-DM-V1_2-20050826-C-pdf.zip","status":"","version":"","date":"","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DM/V1_2-20050826-C/OMA-ERP-DM-V1_2-20050826-C.zip","file":"OMA-ERP-DM-V1_2-20050826-C.zip","status":"Candidate","version":"V1.2","date":"2005-08-26","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DM/V1_2-20050826-C/OMA-TS-DM-Protocol-V1_2-20050826-C.pdf","file":"OMA-TS-DM-Protocol-V1_2-20050826-C.pdf","status":"Candidate","version":"V1.2","date":"2005-08-26","contentMediaType":"application/pdf","description":"This document describes a management protocol using the SyncML Representation Protocol [REPPRO]. This protocol is called the OMA Device Management Protocol, abbreviated as OMA DM Protocol, and it defines the protocol for various management procedures."}]}}