{"input":{"cteatedAt":"2021-02-17T22:15:56.797Z","url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-AD-IMPS-V1_3-20070123-A.pdf","file":"OMA-AD-IMPS-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"Instant Messaging and Presence Service (IMPS) is an OMA enabler that is designed for exchanging instant messages and presence information not only between mobile devices but also between mobile and fixed devices. The origins of this enabler lie in the Wireless Village initiative. When Wireless Village was incorporated into OMA, the version 1.1 of its specifications became the OMA IMPS 1.1 enabler. Afterwards the IMPS 1.2 enabler was finalized within OMA.   The IMPS 1.3 enabler is a significant enhancement of the IMPS 1.2 enabler and is not designed to be backwardly compatible with previous IMPS versions. The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence is the key enabling technology for IMPS. It includes client device availability (my phone is on/off, in a call), user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable personal statuses such as mood (happy, angry) and hobbies (football, fishing, computing, dancing). Since presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and two-way paging are all forms of Instant Messaging. IMPS will enable interoperable mobile IM in concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups. Users can invite their friends and family to chat in group discussions. Operators can build common interest groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These features, taken in part or as a whole, provide the basis for innovative new services that build upon a common interoperable framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-ERELD-IMPS-V1_3-20070123-A.pdf","file":"OMA-ERELD-IMPS-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of IMPS according to OMA Release process and the Enabler Release specification baseline listed in section 6."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-ERP-IMPS-V1_3-20070123-A.zip","file":"OMA-ERP-IMPS-V1_3-20070123-A.zip","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-RD-IMPSDelta-V1_3-20070123-A.pdf","file":"OMA-RD-IMPSDelta-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The OMA Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence is the key enabling technology for IMPS. It includes client device availability (my phone is on/off, in a call), user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable personal statuses such as mood (happy, angry) and hobbies (football, fishing, computing, dancing). Since presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and two-way paging are all forms of Instant Messaging. Wireless Village IM will enable interoperable mobile IM in concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups. Users can invite their friends and family to chat in group discussions. Operators can build common interest groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These features, taken in part or as a whole, provide the basis for innovative new services that build upon a common interoperable framework. These features, taken in part or as a whole, provide the basis for innovative new services that build upon a common interoperable framework. The OMA IMPS Specification Version 1.2 is the latest standard that defines technological framework and the protocol to build the IMPS service. The features and functions for OMA IMPS v1.2 are defined in [IMPSF&F] but there is still some room for optimization and improvement. This document identifies some high-level use cases that are not fulfilled in IMPS v1.2 and define the requirements that should be considered as such optimization and improvement possibility – which will be included in OMA IMPS v1.3. The document does not include requirements from the previous versions of the specifications. It is a ‘delta’ requirement document meaning that requirements are included only for those features, which are going to be changed."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-SUP-AC_wA_IMPS-V1_0-20070123-A.txt","file":"OMA-SUP-AC_wA_IMPS-V1_0-20070123-A.txt","status":"Approved","version":"V1.0","date":"2007-01-23","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-SUP-MO_oma_imps-V1_3-20070123-A.txt","file":"OMA-SUP-MO_oma_imps-V1_3-20070123-A.txt","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_CSP-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_CSP-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The present specification introduces the definition of the client/server protocol (CSP) for the IMPS 1.3 enabler. CSP is a session-oriented protocol, as explained in Section 5. An abstract level description of all the CSP Transactions is provided  form  Sections  6  thru  10.  The  description  starts  from  general  primitives  and  continues  through  the  feature-specific ones. The IMPS enabler consists of four primary functional features: •Presence •Instant Messaging •Groups •Shared Content The above features are described in [Arch]. Section 11 describes the Status or Error Codes that are used in response primitive of every IMPS transaction.  Appendix  B  lists  the  Static  Conformance  Requirements  for  CSP,  which  specifies  the  Minimum  Interoperability  requirements as well as the optional features that allow enhancing the IMPS service."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_CSP_Data_Types-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_CSP_Data_Types-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence is the key enabling technology for IMPS. It includes client device availability (my phone is on/off, in a call), user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable personal statuses such as mood (happy, angry) and hobbies (football, fishing, computing, dancing). Since presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and two-way paging are all forms of Instant Messaging. Wireless Village IM will enable interoperable mobile IM in concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups. Users can invite their friends and family to chat in group discussions. Operators can build common interest groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These features, taken in part or as a whole, provide the basis for innovative new services that build upon a common interoperable framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_CSP_PTS-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_CSP_PTS-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence  is  the  key  enabling  technology  for  IMPS.  It  includes  client  device  availability  (my  phone  is  on/off,  in  a  call),  user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable  personal  statuses  such  as  mood  (happy,  angry)  and  hobbies  (football,  fishing,  computing,  dancing).  Since  presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and  two-way  paging  are  all  forms  of  Instant  Messaging.  Wireless  Village  IM  will  enable  interoperable  mobile  IM  in  concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups.  Users  can  invite  their  friends  and  family  to  chat  in  group  discussions.  Operators  can  build  common  interest  groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These  features,  taken  in  part  or  as  a  whole,  provide  the  basis  for  innovative  new  services  that  build  upon  a  common  interoperable framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_CSP_Transport-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_CSP_Transport-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence  is  the  key  enabling  technology  for  IMPS.  It  includes  client  device  availability  (my  phone  is  on/off,  in  a  call),  user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable  personal  statuses  such  as  mood  (happy,  angry)  and  hobbies  (football,  fishing,  computing,  dancing).  Since  presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and  two-way  paging  are  all  forms  of  Instant  Messaging.  Wireless  Village  IM  will  enable  interoperable  mobile  IM  in  concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups.  Users  can  invite  their  friends  and  family  to  chat  in  group  discussions.  Operators  can  build  common  interest  groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These  features,  taken  in  part  or  as  a  whole,  provide  the  basis  for  innovative  new  services  that  build  upon  a  common  interoperable framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_CSP_WBXML-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_CSP_WBXML-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence  is  the  key  enabling  technology  for  IMPS.  It  includes  client  device  availability  (my  phone  is  on/off,  in  a  call),  user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable  personal  statuses  such  as  mood  (happy,  angry)  and  hobbies  (football,  fishing,  computing,  dancing).  Since  presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and  two-way  paging  are  all  forms  of  Instant  Messaging.  Wireless  Village  IM  will  enable  interoperable  mobile  IM  in  concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups.  Users  can  invite  their  friends  and  family  to  chat  in  group  discussions.  Operators  can  build  common  interest  groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These  features,  taken  in  part  or  as  a  whole,  provide  the  basis  for  innovative  new  services  that  build  upon  a  common  interoperable framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_CSP_XMLS-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_CSP_XMLS-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence  is  the  key  enabling  technology  for  IMPS.  It  includes  client  device  availability  (my  phone  is  on/off,  in  a  call),  user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable  personal  statuses  such  as  mood  (happy,  angry)  and  hobbies  (football,  fishing,  computing,  dancing).  Since  presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and  two-way  paging  are  all  forms  of  Instant  Messaging.  Wireless  Village  IM  will  enable  interoperable  mobile  IM  in  concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups.  Users  can  invite  their  friends  and  family  to  chat  in  group  discussions.  Operators  can  build  common  interest  groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These  features,  taken  in  part  or  as  a  whole,  provide  the  basis  for  innovative  new  services  that  build  upon  a  common  interoperable framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_MO-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_MO-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"This document defines the OMA IMPS Management Object. The MO is defined using the OMA DM Device Description Framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_PA-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_PA-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence  is  the  key  enabling  technology  for  IMPS.  It  includes  client  device  availability  (my  phone  is  on/off,  in  a  call),  user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable  personal  statuses  such  as  mood  (happy,  angry)  and  hobbies  (football,  fishing,  computing,  dancing).  Since  presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and  two-way  paging  are  all  forms  of  Instant  Messaging.  Wireless  Village  IM  will  enable  interoperable  mobile  IM  in  concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups.  Users  can  invite  their  friends  and  family  to  chat  in  group  discussions.  Operators  can  build  common  interest  groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These  features,  taken  in  part  or  as  a  whole,  provide  the  basis  for  innovative  new  services  that  build  upon  a  common  interoperable framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_PA_XMLS-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_PA_XMLS-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence  is  the  key  enabling  technology  for  IMPS.  It  includes  client  device  availability  (my  phone  is  on/off,  in  a  call),  user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable  personal  statuses  such  as  mood  (happy,  angry)  and  hobbies  (football,  fishing,  computing,  dancing).  Since  presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and  two-way  paging  are  all  forms  of  Instant  Messaging.  Wireless  Village  IM  will  enable  interoperable  mobile  IM  in  concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups.  Users  can  invite  their  friends  and  family  to  chat  in  group  discussions.  Operators  can  build  common  interest  groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These  features,  taken  in  part  or  as  a  whole,  provide  the  basis  for  innovative  new  services  that  build  upon  a  common  interoperable framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_SSP-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_SSP-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":""},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_SSP_Transport-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_SSP_Transport-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence is the key enabling technology for IMPS. It includes client device availability (my phone is on/off, in a call), user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable personal statuses such as mood (happy, angry) and hobbies (football, fishing, computing, dancing). Since presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and two-way paging are all forms of Instant Messaging. IMPS will enable interoperable mobile IM in concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups. Users can invite their friends and family to chat in group discussions. Operators can build common interest groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These features, taken in part or as a whole, provide the basis for innovative new services that build upon a common interoperable framework."},{"url":"http://www.openmobilealliance.org/release/IMPS/V1_3-20070123-A/OMA-TS-IMPS_SSP_XMLS-V1_3-20070123-A.pdf","file":"OMA-TS-IMPS_SSP_XMLS-V1_3-20070123-A.pdf","status":"Approved","version":"V1.3","date":"2007-01-23","contentMediaType":"application/pdf","description":"The Instant Messaging and Presence Service (IMPS) includes four primary features: •Presence •Instant Messaging •Groups •Shared Content Presence is the key enabling technology for IMPS. It includes client device availability (my phone is on/off, in a call), user status (available, unavailable, in a meeting), location, client device capabilities (voice, text, GPRS, multimedia) and searchable personal statuses such as mood (happy, angry) and hobbies (football, fishing, computing, dancing). Since presence information is personal, it is only made available according to the user's wishes - access control features put the control of the user presence information in the users' hands. Instant Messaging (IM) is a familiar concept in both the mobile and desktop worlds. Desktop IM clients, two-way SMS and two-way paging are all forms of Instant Messaging. IMPS will enable interoperable mobile IM in concert with other innovative features to provide an enhanced user experience. Groups or chat are a fun and familiar concept on the Internet. Both operators and end-users are able to create and manage groups. Users can invite their friends and family to chat in group discussions. Operators can build common interest groups where end-users can meet each other online. Shared Content allows users and operators to setup their own storage area where they can post pictures, music and other multimedia content while enabling the sharing with other individuals and groups in an IM or chat session. These features, taken in part or as a whole, provide the basis for innovative new services that build upon a common interoperable framework."}]}}