{"input":{"cteatedAt":"2021-02-18T12:54:14.037Z","url":"http://www.openmobilealliance.org/release/Privacy/V1_0-20070807-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Privacy/V1_0-20070807-A/OMA-RD-Privacy-V_1_0_1-20070807-A.pdf","file":"OMA-RD-Privacy-V_1_0_1-20070807-A.pdf","status":"Approved","version":"","date":"2007-08-07","contentMediaType":"application/pdf","description":"Privacy has three aspects: personal, territorial and informational. In an IT context, personal privacy is about content filtering and  other  mechanisms  to  ensure  that  end  users  are  not  exposed  to  whatever  violates  their  moral  senses,  while  territorial  privacy is about protecting the user’s property - e.g. the user equipment - from being invaded by undesired content, such as SMS or email messages. Informational privacy is about data protection, and the users right to determine how, when and to what  extent  information  about  her  is  communicated  to  other  parties,  and  the  execution  of  this  right  might  be  based  on  her  knowledge about what the other party’s intention is. This  document  defines  general  privacy  requirements  within  the  OMA  framework.    In  addition  to  general  privacy  requirements,  some  services  or  service  enablers  may  have  specific  requirements,  which  are  addressed  in  respective  specifications.  The requirements contained in this document are limited to the protection of personal data (informational privacy).  Personal data is  •Information that is tied to a Data Subject such as  oAddress,  oTelephone number,  oSocial security numbers  oNetwork data that could uniquely locate a Data Subject oAny other personally identifiable information •Information about a Data Subject such as bio data, calling habits, user preferences, disposition to be contacted, etc •Information which when combined with other information could infer the identity of a Data Subject, e.g. IP address, User Agent profile, etc. •Information which when stored could have specific requirements, e.g. cookies and location data  Even though the following are aspects of IT privacy, they are outside the scopeof this work item:  •Protection from unsolicited communication (territorial privacy); see also the informative section 9•Preventing access to undesirable information, e.g. protecting children (personal privacy) This  document  contains  a  non-exhaustive  list  of  requirements  that  are  mandated  by  legislation,  and  those  that  are  not  necessarily covered by legislation but are nevertheless considered industry best practices. Both the market/social expectations and legislative mandates are captured by use cases."},{"url":"http://www.openmobilealliance.org/release/Privacy/V1_0-20070807-A/OMA-RRELD-Privacy-V1_0-20070807-A.pdf","file":"OMA-RRELD-Privacy-V1_0-20070807-A.pdf","status":"Approved","version":"V1.0","date":"2007-08-07","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of Generic Privacy according to OMA Release process and the Reference Release document baseline listed in section 6."},{"url":"http://www.openmobilealliance.org/release/Privacy/V1_0-20070807-A/OMA-RRP-Privacy-V1_0-20070807-A.zip","file":"OMA-RRP-Privacy-V1_0-20070807-A.zip","status":"Approved","version":"V1.0","date":"2007-08-07","contentMediaType":"application/zip"}]}}