{"input":{"cteatedAt":"2021-02-18T13:21:47.117Z","url":"http://www.openmobilealliance.org/release/URI_Schemes/V1_0-20080626-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/URI_Schemes/V1_0-20080626-A/OMA-ERELD-URI_Schemes-V1_0-20080626-A.pdf","file":"OMA-ERELD-URI_Schemes-V1_0-20080626-A.pdf","status":"Approved","version":"V1.0","date":"2008-06-26","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of URI Schemes according to OMA Release process and the Enabler Release specification baseline listed in section 6."},{"url":"http://www.openmobilealliance.org/release/URI_Schemes/V1_0-20080626-A/OMA-ERP-URI_Schemes-V1_0-20080626-A.zip","file":"OMA-ERP-URI_Schemes-V1_0-20080626-A.zip","status":"Approved","version":"V1.0","date":"2008-06-26","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/URI_Schemes/V1_0-20080626-A/OMA-RD-URI_Schemes-V1_0-20080626-A.pdf","file":"OMA-RD-URI_Schemes-V1_0-20080626-A.pdf","status":"Approved","version":"V1.0","date":"2008-06-26","contentMediaType":"application/pdf","description":"This document defines the requirements for the URI Schemes work item.  URI Schemes are an internet-wide accepted approach to defining entities and their relationship to protocols and applications.  They provide vendors and developers an applications independent way to bind services to identified internet entities. This document provides scope and guidance to the use of a set of these schemes in the mobile environment. While there are some existing URI Schemes in use within the OMA community, this document concentrates on those schemes that are accepted by the IETF and the internet community as a whole. Existing schemes such as wtai: are not discussed."},{"url":"http://www.openmobilealliance.org/release/URI_Schemes/V1_0-20080626-A/OMA-TS-URI_Schemes-V1_0-20080626-A.pdf","file":"OMA-TS-URI_Schemes-V1_0-20080626-A.pdf","status":"Approved","version":"V1.0","date":"2008-06-26","contentMediaType":"application/pdf","description":"This document describes support for a set of URI Schemes that are to be ubiquitous in the mobile environment. By ubiquitous, we mean these schemes may appear and apply anywhere within the set of applications, services and enablers that are the mobile environment. The document specifies a set of technical requirements for these schemes. The intention is to create a high level of interoperability within the mobile industry when implementing these schemes, and to insure that this set of URI schemes is available wherever useful. In those cases where the source standardization may be ambiguous or incompletely defined for the mobile environment, this document may add or clarify technical specifications in the source standard(s). The document does not limit the use of other URI schemes within the mobile application environment. The scope of this specification encompasses all user agents that operate within the OMA Mobile Applications Environment."}]}}