{"input":{"cteatedAt":"2021-02-18T12:19:27.989Z","url":"http://www.openmobilealliance.org/release/MGPC/V1_0-20070625-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MGPC/V1_0-20070625-C/OMA-RRELD-MGPC-V1_0-20070625-C.pdf","file":"OMA-RRELD-MGPC-V1_0-20070625-C.pdf","status":"Candidate","version":"V1.0","date":"2007-06-25","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of Mobile Gaming Evolution according to OMA Release process and the Reference Release document baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/MGPC/V1_0-20070625-C/OMA-RRP-MGPC-V1_0-20070625-C.zip","file":"OMA-RRP-MGPC-V1_0-20070625-C.zip","status":"Candidate","version":"V1.0","date":"2007-06-25","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MGPC/V1_0-20070625-C/OMA-WP-MGPC-20070625-C.pdf","file":"OMA-WP-MGPC-20070625-C.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This white paper aims to stimulate the market for mobile gaming by driving content and devices to better  meet gaming consumer expectations.  The Open Mobile Alliance focus is on achieving industry alignment of mobile handset feature characteristics that impact game user experience and porting costs to increase quality and quantity of premium mobile games.  The guidelines captured in this white paper can be used by content providers, mobile network operators, and handset manufacturers to create devices, content, and services for the mobile gaming market.  As such, it is not in the scope of this paper to define a universal classification system and device appraisal scheme across multiple handset manufacturers.   This white paper is not intended to define standard APIs for game developers or ensure binary portability of games.  There are several industry initiatives such as Khronos Group (with OpenKODE® and OpenGL® ES), WIPI, Java™ and a host of proprietary solutions such as Microsoft’s Direct3D™ Mobile that provide these programmatic interfaces and environments for mobile games.  Rather, this white paper provides guidelines for fundamental architectural and platform considerations that significantly impact application performance regardless of the actual set of APIs that are presented to the game developer."}]}}