{"input":{"cteatedAt":"2021-02-18T12:34:19.728Z","url":"http://www.openmobilealliance.org/release/OSPE/V1_0-20091022-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/OSPE/V1_0-20091022-A/OMA-AD-OSPE-V1_0-20091022-A.pdf","file":"OMA-AD-OSPE-V1_0-20091022-A.pdf","status":"Approved","version":"V1.0","date":"2009-10-22","contentMediaType":"application/pdf","description":"This document provides the architecture and functional components description for OMA Service Provider Environment (OSPE). The relationship between each of the OSPE components and the interfaces to fulfill the requirements from OSPE Requirements Document (RD) are described.  The OSPE focuses on Life Cycle Management (LCM), Service Level Tracing (SLT), and Service Model Management (SMM)."},{"url":"http://www.openmobilealliance.org/release/OSPE/V1_0-20091022-A/OMA-RD-OSPE-V1_0-20091022-A.pdf","file":"OMA-RD-OSPE-V1_0-20091022-A.pdf","status":"Approved","version":"V1.0","date":"2009-10-22","contentMediaType":"application/pdf","description":"This specification defines the use cases and requirements for the OMA Service Provider Environment (OSPE). The OSPE addresses the need for a standardized environment/infrastructure for developing and deploying services, and addresses the need to quickly and efficiently identify and diagnose faults associated with services that are offered by a Service Provider. Lower service life cycle costs can be achieved by reducing administration (service and subscription provisioning, O&M, etc.) and integration costs of the components used to construct services.  In addition, service manageability can be improved by defining service level diagnostics to enhance the Service Provider's ability to determine whether their complex services are working correctly and if a fault arises in any part of the service chain, that this fault is easily and efficiently traceable and rectifiable. The key objective for the OSPE is to fulfill the following design principles: •Allow component interchangeability;  •Allow the multi-vendor mixing-and-matching of components by identifying their interfaces and having consistent semantics of shared data/schema across these components. To achieve such replaceability/reusability of components, we must provide mechanisms to support the full life cycle of components. This can be achieved by identifying standard component interfaces to handle aspects such as installation, configuration, administration, versioning, etc. Note that since OSPE is a Reference Release, the architecture will identify the interfaces, but there will be no interface specifications as part of the OSPE Reference Release.OSPE will focus standardization efforts in the following areas: •Service Level Diagnostic capabilities including identifying interfaces between components and other Service Provider environments; •Capabilities and identifying interfaces to achieve life-cycle management, including plug & play, of components, applications and services. Section 5 of this document contains use cases describing the issues related with enabler development, deployment, integration, administration, maintenance, etc. Section 6 contains requirements extracted from the use cases presented in section 5."},{"url":"http://www.openmobilealliance.org/release/OSPE/V1_0-20091022-A/OMA-RRELD-OSPE-V1_0-20091022-A.pdf","file":"OMA-RRELD-OSPE-V1_0-20091022-A.pdf","status":"Approved","version":"V1.0","date":"2009-10-22","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of Open Service Provider Environment (OSPE) according to OMA Release process and the Reference Release document baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/OSPE/V1_0-20091022-A/OMA-RRP-OSPE-V1_0-20091022-A.zip","file":"OMA-RRP-OSPE-V1_0-20091022-A.zip","status":"Approved","version":"V1.0","date":"2009-10-22","contentMediaType":"application/zip"}]}}