{"input":{"cteatedAt":"2021-02-17T21:52:59.514Z","url":"http://www.openmobilealliance.org/release/Client_Side_CS_FW/V1_0-20070614-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Client_Side_CS_FW/V1_0-20070614-A/OMA-AD-Client_Side_CS_FW-V1_0-20070614-A.pdf","file":"OMA-AD-Client_Side_CS_FW-V1_0-20070614-A.pdf","status":"Approved","version":"V1.0","date":"2007-06-14","contentMediaType":"application/pdf","description":"The scope of the client side content screening framework architecture is to define the architecture of the content screening framework in mobile terminals to screen malicious content.  The architecture described in this document is restricted to client/terminal deployments only.  Other possible deployments of this architecture (e.g. proxy, server, etc.) are not within the scope of this architecture.  Formal definition of malicious content is not in the scope of this architecture and thus is left to each implementation.  The architecture described in this document includes a Scan Engine functional component.  It is recognized that such a component is likely to have an associated database of profiles to encapsulate information such as its processing rules.  However, such a database and its profiles are not in the scope of this architecture.  This architecture is based on the requirements listed in [CSCSF-RD-v1]."},{"url":"http://www.openmobilealliance.org/release/Client_Side_CS_FW/V1_0-20070614-A/OMA-ERELD-Client_Side_CS_FW-V1_0-20070614-A.pdf","file":"OMA-ERELD-Client_Side_CS_FW-V1_0-20070614-A.pdf","status":"Approved","version":"V1.0","date":"2007-06-14","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Client Side Content Screening Framework according to OMA Release process and the Enabler Release specification baseline listed in section 5. The Client Side Content Screening Framework [CSCSF-TS] defines technical details of interfaces and interaction mechanism necessary for implementing the OMA Client Side Content Screening Framework to screen malicious content at the mobile terminal.  The specification addresses specific requirements enumerated in Error! Reference source not found. and adheres to the architecture described in Error! Reference source not found..  Internal mechanism of the content scanning entity (such as the scan engine, scanning rules, and updating of such engine and rules) are out of the scope of the work."},{"url":"http://www.openmobilealliance.org/release/Client_Side_CS_FW/V1_0-20070614-A/OMA-ERP-Client_Side_CS_FW-V1_0-20070614-A.zip","file":"OMA-ERP-Client_Side_CS_FW-V1_0-20070614-A.zip","status":"Approved","version":"V1.0","date":"2007-06-14","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/Client_Side_CS_FW/V1_0-20070614-A/OMA-RD-Client_Side_CS_FW-V1_0-20070614-A.pdf","file":"OMA-RD-Client_Side_CS_FW-V1_0-20070614-A.pdf","status":"Approved","version":"V1.0","date":"2007-06-14","contentMediaType":"application/pdf","description":"This document presents use cases and requirements for a content screening framework for mobile terminals that detect and screen against malicious content.  This document contains information applicable to terminal manufacturers and independent software vendors.  Additionally, related functionality not described here may involve requirements outside the scope of this document. This additional functionality shall not interfere with the core requirements described in this document."},{"url":"http://www.openmobilealliance.org/release/Client_Side_CS_FW/V1_0-20070614-A/OMA-TS-Client_Side_CS_FW-V1_0-20070614-A.pdf","file":"OMA-TS-Client_Side_CS_FW-V1_0-20070614-A.pdf","status":"Approved","version":"V1.0","date":"2007-06-14","contentMediaType":"application/pdf","description":"This specification defines technical details of interfaces and interaction mechanism necessary for implementing the OMA Client Side Content Screening Framework to screen malicious content at the mobile terminal.  The specification addresses specific requirements enumerated in [CSCSF-RD-v1] and adheres to the architecture described in [CSCSF-AD-v1].  Internal mechanism of the content scanning entity (such as the scan engine, scanning rules, and updating of such engine and rules) are out of the scope of the work."}]}}