{"input":{"cteatedAt":"2021-02-17T22:00:17.970Z","url":"http://www.openmobilealliance.org/release/DNS/V1_0-20060606-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/DNS/V1_0-20060606-A/OMA-ERELD-DNS-V1_0-20060606-A.pdf","file":"OMA-ERELD-DNS-V1_0-20060606-A.pdf","status":"Approved","version":"V1.0","date":"2006-06-06","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of DNS according to OMA Release process and the Enabler Release specification baseline listed in section Error! Reference source not found..Although network interfaces are known by the IP addresses, humans work best using the name of the host.  In the TCP/IP world, the Domain Name System (DNS) is a distributed database that provides the mapping between IP addresses and hostnames.  DNS provides the protocol that allows clients to servers to communicate with each other.  From an application’s point of view, access to the DNS is through a resolver.  The scope covers the functionality of the DNS client on the terminal, while remaining compliant with the IETF specifications listed in section 2.1.  The behaviour of the DNS server is not specified, therefore Wireless Profiled DNS clients will be capable of performing DNS lookups with pre-existing DNS servers (i.e we impose no requirements on the server)."},{"url":"http://www.openmobilealliance.org/release/DNS/V1_0-20060606-A/OMA-ERP-DNS-V1_0-20060606-A.zip","file":"OMA-ERP-DNS-V1_0-20060606-A.zip","status":"Approved","version":"V1.0","date":"2006-06-06","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DNS/V1_0-20060606-A/OMA-WAP-DNS-V1_0-20060606-A.pdf","file":"OMA-WAP-DNS-V1_0-20060606-A.pdf","status":"Approved","version":"V1.0","date":"2006-06-06","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of work defining an industry wide specification for developing applications that operate over wireless communications networks.. The wireless market is growing very quickly, reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP provides a set of open, extensible protocols and content formats as a basis for interoperable implementations.   In one instance of a WAP architecture, a WAP Proxy Gateway may be deployed which performs DNS (Domain Name Server) lookup on behalf of the terminal. . However, network service providers may choose not to install WAP Proxy Gateways, or allow usage patterns that circumvent the WAP Proxy Gateway.   Without the availability of a WAP Proxy Gateway, the WAP terminal is required to perform DNS lookup. The specific reasons for including and profiling a WAP terminal DNS client are: •To support IP address resolution within the direct access scenario depicted in the WAP Architecture specification [WAPARCH]. •To minimise the use of radio resources by controlling the behaviour of the DNS client. •To specify an interoperable lightweight DNS client with minimal footprint, memory and processor requirements. The scope of this document covers the functionality of the DNS client on the terminal, while remaining compliant with the IETF specifications listed in section Error! Reference source not found.. This document will not specify the behaviour of the DNS server, therefore Wireless Profiled DNS clients will be capable of performing DNS lookups with pre-existing DNS servers (i.e we impose no requirements on the server). This specification will also conform to IPv4 and IPv6 addressing schemes."}]}}