{"input":{"cteatedAt":"2021-02-18T12:29:24.195Z","url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20080617-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20080617-C/OMA-RRELD-MobileCodes-V1_0-20080617-C.pdf","file":"OMA-RRELD-MobileCodes-V1_0-20080617-C.pdf","status":"Candidate","version":"V1.0","date":"2008-06-17","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of Mobile Codes according to OMA Release process and the Reference Release document baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20080617-C/OMA-RRP-MobileCodes-V1_0-20080617-C.zip","file":"OMA-RRP-MobileCodes-V1_0-20080617-C.zip","status":"Candidate","version":"V1.0","date":"2008-06-17","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20080617-C/OMA-WP-MobileCodes-20080617-C.pdf","file":"OMA-WP-MobileCodes-20080617-C.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This white paper aims to stimulate a global market in which barcodes act as enablers for camera-equipped handsets to access content and services. Some technologies already exist; for example, in Japan, 2D barcode scanning is in widespread use. However there is fragmentation in the worldwide market currently, due to the variety of approaches to the questions of which barcode symbologies should be supported, what format of data they should contain, and how reader software should behave when barcodes are read.  The Open Mobile Alliance aims to halt fragmentation by providing guidelines on existing standards as well as creating specifications to address interoperability needs as they arise. Once enough mobile code readers that follow those guidelines are deployed on consumer handsets, marketing organisations and publishers will be able to include mobile codes as links to online content and services with confidence, in advertising and promotional campaigns, and in printed and displayed media of many kinds. This white paper does not address barcodes displayed on mobile devices as coupons or tickets (for reading by other devices)."}]}}