{"input":{"cteatedAt":"2021-02-18T12:30:01.201Z","url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20130611-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20130611-A/OMA-AD-MC-V1_0-20130611-A.pdf","file":"OMA-AD-MC-V1_0-20130611-A.pdf","status":"Approved","version":"V1.0","date":"2013-06-11","contentMediaType":"application/pdf","description":"OMA Mobile Codes Enabler aims to stimulate, by the creation of a standard, a global market in which barcodes act as enablers for camera-equipped devices* to access content and services. Some technologies already exist; for example, in Japan, 2D barcode scanning is in widespread use. However there is fragmentation in the worldwide market currently, due to the variety of approaches to the questions of which barcode Symbologies should be supported, what format of data they should contain, and how client software should behave when barcodes are read.  The Open Mobile Alliance aims to halt fragmentation by creating specifications to address interoperability needs as they arise. Once enough Mobile Code Clients that follow those specifications are deployed on mobile devices, marketing organisations and publishers will be able to include Mobile Codes as links to online content and services with confidence, in advertising and promotional campaigns, and in printed and displayed media of many kinds.  For more background information, see [OMAWP].  *Note:  Devices for the Mobile Codes Enabler are intended to be handheld mobile devices (i.e., handsets, PDAs, etc.) used by a human person."},{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20130611-A/OMA-ERELD-MC-V1_0-20130611-A.pdf","file":"OMA-ERELD-MC-V1_0-20130611-A.pdf","status":"Approved","version":"V1.0","date":"2013-06-11","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Mobile Codes (MC) according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20130611-A/OMA-ERP-MC-V1_0-20130611-A.zip","file":"OMA-ERP-MC-V1_0-20130611-A.zip","status":"Approved","version":"V1.0","date":"2013-06-11","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20130611-A/OMA-RD-MC-V1_0-20130611-A.pdf","file":"OMA-RD-MC-V1_0-20130611-A.pdf","status":"Approved","version":"V1.0","date":"2013-06-11","contentMediaType":"application/pdf","description":"OMA Mobile Codes Enabler aims to stimulate, by the creation of a standard, a global market in which barcodes act as enablers for camera-equipped devices* to access content and services. Some technologies already exist; for example, in Japan, 2D barcode scanning is in widespread use. However, there is fragmentation in the worldwide market currently due to the variety of approaches as to which barcode Symbologies should be supported, what format of data they should contain, and how client software should behave when barcodes are read.  The Open Mobile Alliance aims to halt fragmentation by providing a standard by creating specifications to address interoperability needs as they arise. Once enough mobile code clients that follow those specifications are deployed on consumer handsets, marketing organisations and publishers will be able to include mobile codes as links to online content and services with confidence, in advertising and promotional campaigns, and in printed and displayed media of many kinds. *Note:  Devices for the Mobile Codes Enabler (MC Enabler) are intended to be handheld mobile devices (i.e. handsets, PDAs, etc.) used by a human person."},{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20130611-A/OMA-SUP-MC-V1_0-20130611-A.xsd","file":"OMA-SUP-MC-V1_0-20130611-A.xsd","status":"Approved","version":"V1.0","date":"2013-06-11","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20130611-A/OMA-SUP-MO_Mobile_Codes-V1_0-20130611-A.txt","file":"OMA-SUP-MO_Mobile_Codes-V1_0-20130611-A.txt","status":"Approved","version":"V1.0","date":"2013-06-11","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20130611-A/OMA-TS-MC-V1_0-20130611-A.pdf","file":"OMA-TS-MC-V1_0-20130611-A.pdf","status":"Approved","version":"V1.0","date":"2013-06-11","contentMediaType":"application/pdf","description":"Mobile Codes EnablerThis document provides the Technical Specification of the Mobile Codes Enabler to fulfill the requirements outlined in the Mobile Codes Requirements document [MC-RD] for Mobile Codes V1.0 and in compliance to the architecture described in Mobile Codes Architecture document [MC-AD]. The Technical Specification provides the definition of data elements of the Mobile Codes Enabler and the description of the procedures/behaviour for the features supported by the Mobile Codes Enabler."},{"url":"http://www.openmobilealliance.org/release/MobileCodes/V1_0-20130611-A/OMA-TS-MC_MO-V1_0-20130611-A.pdf","file":"OMA-TS-MC_MO-V1_0-20130611-A.pdf","status":"Approved","version":"V1.0","date":"2013-06-11","contentMediaType":"application/pdf","description":"This document defines the OMA Mobile Codes Enabler Management Object that manages Mobile Code Client installation, provisioning and updating."}]}}