{"input":{"cteatedAt":"2021-02-18T12:34:52.593Z","url":"http://www.openmobilealliance.org/release/OWSER_NI/V1_0-20051220-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/OWSER_NI/V1_0-20051220-C/OMA-AD-OWSER_NI-V1_0-20051220-C.pdf","file":"OMA-AD-OWSER_NI-V1_0-20051220-C.pdf","status":"Candidate","version":"V1.0","date":"2005-12-20","contentMediaType":"application/pdf","description":"This document is part of a series of documents [OWSER NI FF], [OWSER NI AD] [OWSER NI WSF] that specifies components of the OMA Web Services Network Identity Enabler (OWSER NI).   “OMA Web Services Network Identity Enabler (OWSER NI): Identity Web Services Framework “ [OWER NI WSF] provides the specification of the components needed to fulfil the requirements in [NI-RD]  related to accessing user-related attributes (e.g., user location, presence status etc.) in a privacy-protected manner in a Liberty enabled Web services environment. “OMA Web Services Network Identity Enabler (OWSER NI): Identity Federation Framework” document [OWSER NI FF] provides the specifications of the components needed to leverage Identity Federation in a Liberty enabled Web services environment. This document namely, “OMA Web Services Network Identity Enabler (OWSER NI): Architecture” document [OWSER NI AD] is informative and describes the architecture of a technical solution to the requirements in [NI RD] based on the Liberty Alliance Identity Federation Framework and Identity Web Services Framework"},{"url":"http://www.openmobilealliance.org/release/OWSER_NI/V1_0-20051220-C/OMA-ERELD-OWSER_NI-V1_0-20051220-C.pdf","file":"OMA-ERELD-OWSER_NI-V1_0-20051220-C.pdf","status":"Candidate","version":"V1.0","date":"2005-12-20","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of OWSER NI according to OMA Release process and the Enabler Release specification baseline listed in section 0."},{"url":"http://www.openmobilealliance.org/release/OWSER_NI/V1_0-20051220-C/OMA-ERP-OWSER_NI-V1_0-20051220-C.zip","file":"OMA-ERP-OWSER_NI-V1_0-20051220-C.zip","status":"Candidate","version":"V1.0","date":"2005-12-20","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/OWSER_NI/V1_0-20051220-C/OMA-RD-OWSER-NI-V1_1-20051220-C.pdf","file":"OMA-RD-OWSER-NI-V1_1-20051220-C.pdf","status":"Candidate","version":"V1.1","date":"2005-12-20","contentMediaType":"application/pdf","description":"This document lists the requirements generated by the OMA Mobile Web Services (MWS) Working Group in the area of Identity Management"},{"url":"http://www.openmobilealliance.org/release/OWSER_NI/V1_0-20051220-C/OMA-TS-OWSER_NI_FF-V1_0-20051220-C.pdf","file":"OMA-TS-OWSER_NI_FF-V1_0-20051220-C.pdf","status":"Candidate","version":"V1.0","date":"2005-12-20","contentMediaType":"application/pdf","description":"This document is part of a series of documents [OWSER NI FF], [OWSER NI AD] [OWSER NI WSF] that will be used to specify components of the OMA Web Services Network Identity Enabler (OWSER NI).  The “OMA Web Services Network Identity Enabler (OWSER NI): Architecture” document  [OWSER NI AD] describes the architecture of a technical  solution to the requirements in [NI RD]based on the Liberty Alliance Identity Federation Framework and Identity Web Services Framework  The “OMA Network Identity Web Services Enabler: (OWSER NI): Identity Web Services  Framework “ [OWER NI WSF] provides the specification of the components needed to fulfil the requirements in [NI-RD]  related to accessing user-related attributes (e.g., user location, presence status etc.) in a privacy-protected manner in a Liberty-enabled Web Services environment. This document, namely the “OMA Network Identity Web Services Enabler: (OWSER NI): Identity Federation  Framework ” document [OWSER NI FF] provides the specifications of the components needed to leverage Identity Federation in a Liberty-enabled Web services environment. This document is intended to provide normative guidance to designers of specific OMA Network Identity Web Services and implementers thereof."},{"url":"http://www.openmobilealliance.org/release/OWSER_NI/V1_0-20051220-C/OMA-TS-OWSER_NI_WSF-V1_0-20051220-C.pdf","file":"OMA-TS-OWSER_NI_WSF-V1_0-20051220-C.pdf","status":"Candidate","version":"V1.0","date":"2005-12-20","contentMediaType":"application/pdf","description":"This document is part of a series of documents [OWSER NI FF], [OWSER NI AD] [OWSER NI WSF] that specifies components of the OMA Web Services Network Identity Enabler (OWSER NI).   “OMA Web Services Network Identity Enabler (OWSER NI): Architecture” [OWSER NI AD] is informative and describes the architecture of a technical solution to the requirements in [NI RD] based on the Liberty Alliance Identity Federation Framework and Identity Web Services Framework  “OMA Network Identity Federation Framework” document [OWSER NI FF] provides the specifications of the components needed to leverage Identity Federation in a Liberty-enabled Web services environment This document namely, “OMA Network Identity Web Services Enabler: (OWSER NI): Identity Web Services  Framework “ [OWSER NI WSF] provides the specification of the components needed to fulfil the requirements in [NI-RD]  related to accessing user-related attributes (e.g., user location, presence status etc.) in a privacy-protected manner in a Liberty-enabled Web Services Environment. This document is intended to provide normative guidance to designers of OMA Network Identity Web Services and implementers thereof."}]}}