{"input":{"cteatedAt":"2021-02-18T12:24:26.510Z","url":"http://www.openmobilealliance.org/release/MMS/V1.1-29949715-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MMS/V1.1-29949715-A/OMA-ERELD-MMS-V1_1-20040715-A.pdf","file":"OMA-ERELD-MMS-V1_1-20040715-A.pdf","status":"Approved","version":"V1.1","date":"2004-07-15","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Multimedia Messaging Service according to OMA Release process and the Enabler Release specification baseline listed in section 5.  Multimedia Messaging Service (MMS) is a system application by which a client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as an Origin Server for this specialised service. [MMSARCH] provides the overall architectural picture of MMS and its protocol entities."},{"url":"http://www.openmobilealliance.org/release/MMS/V1.1-29949715-A/OMA-IOP-MMSCONF-V2_0_0-20040715-A.pdf","file":"OMA-IOP-MMSCONF-V2_0_0-20040715-A.pdf","status":"Approved","version":"V2.0.0","date":"2004-07-15","contentMediaType":"application/pdf","description":"The scope of this document is in accordance with the charters of  OMA IOP and OMA IOP MM Groups. The MMS conformance document  defines the minimum set of requirements and guidelines for end-to-end interoperability of  MMS handsets and servers. It further serves as a baseline for MMS interoperability testing. The test environment and the test cases that need to be created for MMS interoperability testing will be based on the definition from this document. Thus the scope of this document is is, to serve as the fundament for MMS end-to-end interoperability testing. Another significant intent of this document is also to be used as a base for discussions between vendors, operators and value added service providers to explore any such requirements that might not be clearly defined in the specifications of  3GPP or WAP Forum with respect to interoperability."},{"url":"http://www.openmobilealliance.org/release/MMS/V1.1-29949715-A/OMA-MMS-V1_1-20040715-A.zip","file":"OMA-MMS-V1_1-20040715-A.zip","status":"Approved","version":"V1.1","date":"2004-07-15","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MMS/V1.1-29949715-A/OMA-WAP-MMS-ARCH-V1_1-20040715-A.pdf","file":"OMA-WAP-MMS-ARCH-V1_1-20040715-A.pdf","status":"Approved","version":"V1.1","date":"2004-07-15","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work, provided by the WAP Forum originally and succeeded by the Open Mobile AllianceTM (OMA), to define an industry-wide specification for developing applications that operate over wireless communication networks.  The scope for the OMA is to define a set of specifications to be used by service applications.  The wireless market is growing very quickly, and reaching new customers and services.  To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation, the OMA defines a set of protocols in transport, security, transaction, session and application layers.  For additional information on the WAP/OMA architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Multimedia Messaging Service (MMS) is a system application by which a client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as a WAP Origin Server for this specialised service.  Additional service aspects are supported by the MMS Server as well as other messaging servers, such as an email server and wireless messaging systems (e.g. SMSC).  This specification defines application-level protocol activities that take place to realise the MMS service within the OMA environment.  This document is part of the OMA MMS version 1.1 specification suite and complies with the requirements and service behaviours described in the technical specifications of the 3rd Generation Partnership Project (3GPP). These include the service aspects of MMS and the functional description of MMS which are contained in [TS23140]."},{"url":"http://www.openmobilealliance.org/release/MMS/V1.1-29949715-A/OMA-WAP-MMS-CTR-V1_1-20040715-A.pdf","file":"OMA-WAP-MMS-CTR-V1_1-20040715-A.pdf","status":"Approved","version":"V1.1","date":"2004-07-15","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation WAP Forum defines a set of protocols in transport, security, transaction, session and application layers. For additional information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Multimedia Messaging Service (MMS) is a system application by which a WAP client is able to provide a messaging operation with a variety of media types. The service is described in terms of actions taken by the WAP MMS Client and its service partner, the MMS Proxy-Relay, a device that operates as a WAP Origin Server for this specialised service. This specification defines the operational flow of the MMS Protocol Data Units (PDUs) that transit between the MMS Client and the MMS Proxy-Relay.  The format of the specific PDUs is described in the “WAP MMS Encapsulation Protocol” [MMSENCAPS].  This document is part of the WAP MMS version 1.1 specification suite and complies with the requirements and service behaviours described in the technical specifications of the 3rd Generation Partnership Project (3GPP). These include the service aspects of MMS and the functional description of MMS which are contained in [TS23140].  For information about the MMS Architecture, the reader is advised to become familiar with the “WAP MMS Architecture Overview” [MMSARCH]."},{"url":"http://www.openmobilealliance.org/release/MMS/V1.1-29949715-A/OMA-WAP-MMS-ENC-V1_1-20040715-A.pdf","file":"OMA-WAP-MMS-ENC-V1_1-20040715-A.pdf","status":"Approved","version":"V1.1","date":"2004-07-15","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation WAP Forum defines a set of protocols in transport, security, transaction, session, and application layers. For additional information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Multimedia Messaging Service (MMS) is a system application by which a WAP client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the WAP MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as a WAP Origin Server for this specialised service. This document is part of the WAP MMS specification suite and complies with the requirements and service behaviour descriptions described in the technical specifications of the 3rd Generation Partnership Project (3GPP). These include the service aspects of MMS and the functional description of MMS, which are contained in [TS23140].  The transaction between MMS Client and MMS Proxy-Relay for the multimedia messaging service can be found in [MMSCTR]. This specification defines the message encapsulation, i.e., the message structure and encodings for the multimedia messaging service."}]}}