{"input":{"cteatedAt":"2021-02-18T12:24:48.143Z","url":"http://www.openmobilealliance.org/release/MMS/V1_2-20040623-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20040623-C/OMA-ERELD-MMS-V1_2-20040623-C.pdf","file":"OMA-ERELD-MMS-V1_2-20040623-C.pdf","status":"Candidate","version":"V1.2","date":"2004-06-23","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Multimedia Messaging Service according to OMA Release process and the Enabler Release specification baseline listed in section 5.  Multimedia Messaging Service (MMS) is a system application by which a client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as an Origin Server for this specialised service. [MMSARCH] provides the overall architectural picture of MMS and its protocol entities."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20040623-C/OMA-MMS-ARCH-V1_2-20031217-C.pdf","file":"OMA-MMS-ARCH-V1_2-20031217-C.pdf","status":"Candidate","version":"V1.2","date":"2003-12-17","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work, provided by the WAP Forum originally and succeeded by the Open Mobile AllianceTM (OMA), to define an industry-wide specification for developing applications that operate over wireless communication networks.  The scope for the OMA is to define a set of specifications to be used by service applications.  The wireless market is growing very quickly, and reaching new customers and services.  To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation, the OMA defines a set of protocols in transport, security, transaction, session and application layers.  For additional information on the WAP/OMA architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Multimedia Messaging Service (MMS) is a system application by which a client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as a WAP Origin Server for this specialised service.  Additional service aspects are supported by the MMS Server as well as other messaging servers, such as an email server and wireless messaging systems (e.g. SMSC).  This specification defines application-level protocol activities that take place to realise the MMS service within the OMA environment.  This document is part of the OMA MMS version 1.2 specification suite for the client transaction framework and complies with the requirements and service behaviours described in the technical specifications of the 3rd Generation Partnership Project (3GPP) and the 3rd Generation Partnership Project 2 (3GPP2). These include the service aspects of MMS and the functional description of MMS which are contained in [TS22140] and [TS23140] from 3GPP, and [SR0064] and [XS0016200] from 3GPP2."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20040623-C/OMA-MMS-CONF-V1_2-20040623-C.pdf","file":"OMA-MMS-CONF-V1_2-20040623-C.pdf","status":"Candidate","version":"V1.2","date":"2004-06-23","contentMediaType":"application/pdf","description":"The  scope  of  this  document  is  in  accordance  with  the  charters  of  OMA  IOP,  OMA  MMSG  and  OMA  IOP  MM  Groups.  The  MMS  conformance  document  defines  the  minimum  set  of  requirements  and  guidelines  for  end-to-end interoperability of MMS handsets and servers. It further serves as a baseline for MMS interoperability testing. The test environment and the test cases that need to be created for MMS interoperability testing will be based on the definition from this document. Thus the scope of this document is is, to serve as the fundament for MMS end-to-end  interoperability  testing.  Another  significant  intent  of  this  document  is  also  to  be  used  as  a  base  for  discussions between vendors, operators and value added service providers to explore any such requirements that might not be clearly defined in the specifications of 3GPP, 3GPP2 or OMA with respect to interoperability."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20040623-C/OMA-MMS-CTR-V1_2-20031215-C.pdf","file":"OMA-MMS-CTR-V1_2-20031215-C.pdf","status":"Candidate","version":"V1.2","date":"2003-12-15","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation WAP Forum defines a set of protocols in transport, security, transaction, session and application layers. For additional information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Multimedia Messaging Service (MMS) is a system application by which a WAP client is able to provide a messaging operation with a variety of media types. The service is described in terms of actions taken by the WAP MMS Client and its service partner, the MMS Proxy-Relay, a device that operates as a WAP Origin Server for this specialised service. This specification defines the operational flow of the MMS Protocol Data Units (PDUs) that transit between the MMS Client and the MMS Proxy-Relay.  The format of the specific PDUs is described in the “WAP MMS Encapsulation Protocol” [MMSENCAPS].  This document is part of the OMA MMS version 1.2 specification suite and complies with the requirements and service behaviours described in the technical specifications of the 3rd Generation Partnership Project (3GPP) and the 3rd Generation partnership Project 2 (3GPP2) . These include the service aspects of MMS and the functional description of MMS which are contained in [TS23140] for 3GPP and [XS0016200] for 3GPP2 .  For information about the MMS Architecture, the reader is advised to become familiar with the “WAP MMS Architecture Overview” [MMSARCH]."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20040623-C/OMA-MMS-ENC-V1_2-20040323-C.pdf","file":"OMA-MMS-ENC-V1_2-20040323-C.pdf","status":"Candidate","version":"V1.2","date":"2004-03-23","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation WAP Forum defines a set of protocols in transport, security, transaction, session, and application layers. For additional information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Multimedia Messaging Service (MMS) is a system application by which a WAP client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the WAP MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as a WAP Origin Server for this specialised service. This document is part of the OMA MMS specification suite and complies with the requirements and service behaviour descriptions described in the technical specifications of the 3rd Generation Partnership Project (3GPP) and the 3rd Generation Partnership Project 2 (3GPP2). These include the service aspects of MMS and the functional description of MMS, which are contained in [TS23140] for 3GPP and [XS0016200] for 3GPP2.  The transaction between MMS Client and MMS Proxy-Relay for the multimedia messaging service can be found in [MMSCTR]. This specification defines the message encapsulation, i.e., the message structure and encodings for the multimedia messaging service."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20040623-C/OMA-MMS-RD-CONF-V1_2-20030609-C.pdf","file":"OMA-MMS-RD-CONF-V1_2-20030609-C.pdf","status":"Candidate","version":"V1.2","date":"2003-06-09","contentMediaType":"application/pdf","description":"This document sets the requirements for defining a set of guidelines to achieve interoperability for MMS. Four broad areas of interoperability have been identified for MMS. They are: • Peer to peer and content provider to peer with respect to generation, rendering and presentation of media.  • Network to network of different types, e.g. 3GPP to 3GPP2. • Network to network of same types, e.g. support of optional features such as address hiding and delivery reporting. • Forward-lock as defined by OMA Digital Rights Management. The scope of this document is focused on setting the requirements to achieve interoperability for MMS enabler realease v1.2. More specifics of the requirements to realize this interoperability and the specific level of this interworking is defined in the subsections of this manuscript."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20040623-C/OMA-MMS-V1_2-20040623-C.zip","file":"OMA-MMS-V1_2-20040623-C.zip","status":"Candidate","version":"V1.2","date":"2004-06-23","contentMediaType":"application/zip"}]}}