{"input":{"cteatedAt":"2021-02-18T12:24:41.233Z","url":"http://www.openmobilealliance.org/release/MMS/V1_2-20030923-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20030923-C/OMA-ERELD-MMS-V1_2-20030923-C.pdf","file":"OMA-ERELD-MMS-V1_2-20030923-C.pdf","status":"Candidate","version":"V1.2","date":"2003-09-23","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Multimedia Messaging Service according to OMA Release process and the Enabler Release specification baseline listed in section 5.  Multimedia Messaging Service (MMS) is a system application by which a client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as an Origin Server for this specialised service. [MMSARCH] provides the overall architectural picture of MMS and its protocol entities."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20030923-C/OMA-MMS-ARCH-V1_2-20030920-C.pdf","file":"OMA-MMS-ARCH-V1_2-20030920-C.pdf","status":"Candidate","version":"V1.2","date":"2003-09-20","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work, provided by the WAP Forum originally and succeeded by the Open Mobile AllianceTM (OMA), to define an industry-wide specification for developing applications that operate over wireless communication networks.  The scope for the OMA is to define a set of specifications to be used by service applications.  The wireless market is growing very quickly, and reaching new customers and services.  To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation, the OMA defines a set of protocols in transport, security, transaction, session and application layers.  For additional information on the WAP/OMA architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Multimedia Messaging Service (MMS) is a system application by which a client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as a WAP Origin Server for this specialised service.  Additional service aspects are supported by the MMS Server as well as other messaging servers, such as an email server and wireless messaging systems (e.g. SMSC).  This specification defines application-level protocol activities that take place to realise the MMS service within the OMA environment.  This document is part of the OMA MMS version 1.2 specification suite for the client transaction framework and complies with the requirements and service behaviours described in the technical specifications of the 3rd Generation Partnership Project (3GPP). These include the service aspects of MMS and the functional description of MMS which are contained in [TS22140] and [TS23140] respectively."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20030923-C/OMA-MMS-CONF-V1_2-20030929-C.pdf","file":"OMA-MMS-CONF-V1_2-20030929-C.pdf","status":"Candidate","version":"V1.2","date":"2003-09-29","contentMediaType":"application/pdf","description":"The scope of this document is in accordance with the charters of OMA IOP, OMA MMSG and OMA IOP MM Groups. The MMS conformance document defines the minimum set of requirements and guidelines for end-to-end interoperability of MMS handsets and servers. It further serves as a baseline for MMS interoperability testing. The test environment and the test cases that need to be created for MMS interoperability testing will be  based  on  the  definition  from  this  document.  Thus  the  scope  of  this  document  is  is,  to  serve  as  the  fundament for MMS end-to-end interoperability testing. Another significant intent of this document is also to be used as a base for discussions between vendors, operators and value added service providers to explore any such requirements that might not be clearly defined in the specifications of 3GPP, 3GPP2 or OMA with respect to interoperability.   OMA-MMS-CONF-v1_2-20030929-C Page 6 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  2. References 2.1. Normative References CP0045 “MMS Media Formats and Codecs”, 3rd Generation Partnership Project 2, C.P0045, URI: http://www.3gpp2.org/ (DRAFT) IOPProc “OMA Interoperability Policy and Process”, Open Mobile Alliance™, OMA-IOP-Process-v1_0. URL:http//www.openmobilealliance.org/ ISO8859-1 “8-bit single byte coded graphic character sets, Part 1: Latin Alphabet No. 1.”, ISO/IEC 8859-1:1998(E). MMSCONF “MMS Conformance Document, Version 2.0.0”, Open Mobile Alliance™, OMA-IOP-MMSCONF-2_0_0-20020206C. URI: http://www.openmobilealliance.org/ MMSCTR \"MMS Client Transactions\", OMA-WAP-MMS-CTR-v1_2, Open Mobile Alliance™. URL: http://www.openmobilealliance.org. MMSENC “OMA MMS Encapsulation Protocol”, Open Mobile Alliance™, OMA-WAP-MMS-ENC-v1.2. URI: http://www.openmobilealliance.org/ OMADRM “Digital Rights Management version 1.0”, Open Mobile Alliance ™, OMA-DRM-v1_0-20021104-C. URI; http://www.openmobilealliance/documents.asp PIM                                    “Personal                                    Data                                    Interchange”, The Internet Mail Consortium,  URL: http://www.imc.org/pdi/ RFC2387 “The MIME Multipart/Related Content-type”, IETF, RFC 2387, URL: http://www.ietf.org/rfc/rfc2387.txt  RFC2557 “MIME Encapsulation of Aggregate Documents, such as HTML (MHTML)”, IETF, RFC 2557, URL: http://www.ietf.org/rfc/rfc2557.txt  RFC2821 “Simple Mail Transfer Protocol”, IETF, RFC 2821, URL: http://www.ietf.org/rfc/rfc2821.txt SMIL “Synchronized Multimedia Integration Language (SMIL 2.0)”, W3C Recommendation 07 August 2001, URL: http://www.w3.org/TR/smil20/ TS23140 “Multimedia Messaging Service: Functional description; Stage 2”, 3rd Generation Partnership Project, TS 23.140 Release 5.  URI: http://www.3gpp.org/ftp/Specs/ TS26140 \"Multimedia Messaging Service; Media formats and codecs\", 3rd Generation Partnership Project, TS 26.140 Release 5.  URI: http://www.3gpp.org/ftp/Specs/ UAProf “User Agent Profile version 2.0”, Open Mobile Alliance™, URI: http://www.openmobilealliance.org/. Unicode “The Unicode Standard Version 3.0”, The Unicode Consortium, Addison-Wesley, Reading (MA), January 2000. ISBN 0-201-61633-5. WAPWSP “OMA Wireless Session Protocol”, Open Mobile Alliance™, WAP-203-WSP-20000504-a. URI: http://www.openmobilealliance.org/. WAPWTP “OMA Wireless Transport Protocol”, Open Mobile Alliance™, OMA-WAP-224-WTP-20010710-a. URI: http://www.openmobilealliance.org/ XS0016200 “Multimedia Messaging Service Stage 2, Service Description”, 3rd Generation Partnership Project 2, X.S0016-200, URI: http://www.3gpp2.org/  2.2. Informative References RFC2046 “MIME Part Two: Media Types”, IETF, RFC 2046, URL: http://www.ietf.org/rfc/rfc2046.txt RFC2781 “UTF-16, an encoding of ISO 10646”, IETF, RFC 2781, URL: http://www.ietf.org/rfc/rfc2781.txt OMA-MMS-CONF-v1_2-20030929-C Page 7 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  RFC2822 “Internet Message Format”, IETF, RFC 2822, URL: http://www.ietf.org/rfc/rfc2046.txt SR0064 “Multimedia Messaging Service Stage 1, Requirements”, 3rd Generation Partnership Project 2, S.R0064, URI: http://www.3gpp2.org/Public_html/specs/S.R0064-0_v1.0.pdf TS22140 “Multimedia Messaging Service; Stage 1, Requirements”, 3rd Generation Partnership Project, TS 22.140 Release 5.  URI: http://www.3gpp.org/ftp/Specs/ WAPARCH “Wireless Application Protocol Architecture”, Open Mobile Alliance™, OMA-WAP-210-WAPArch-20010712-a, URI: http://www.openmobilealliance.org/ XS0016000A “MMS Specification Overview Multimedia Messaging System Specification”, 3rd Generation Partnership Project 2, X.S0016.000-A v1.0, URI:http://www.3gpp2.org/Public_html/specs/X.S0016-000-A.pdf XS0016310 “MMS MM1 Stage 3 Using OMA/WAP”, 3rd Generation Partnership Project 2, X.S0016.310 v1.0, URI: http://www.3gpp2.org/Public_html/specs/X.S0016-310.pdf  OMA-MMS-CONF-v1_2-20030929-C Page 8 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  3. Terminology and Conventions 3.1. Conventions The key words “MUST”, “MUST NOT”, “REQUIRED”, “SHALL”, “SHALL NOT”, “SHOULD”, “SHOULD NOT”, “RECOMMENDED”,  “MAY”,  and  “OPTIONAL”  in  this  document  are  to  be  interpreted  as  described  in  [RFC2119]. All  sections  and  appendixes,  except  “Scope”  and  “Introduction”,  are  normative,  unless  they  are  explicitly  indicated to be informative. 3.2. Definitions Creation - The action to create an MM, e.g., via the terminal MMI  Man-Machine Interface - The interface between terminal and user  MMS SMIL – A SMIL subset defined for MMS interoperability purposes in this document.  Multimedia Message Content Class (MM Content Class) - A Multimedia Message Content Class is a set of Multimedia Messages defined in terms of media types, size, media formats, presentation formats and applicable DRM mechanisms  Presentation - The presentation of the MM to the user as defined in [TS23140] or [XS0016200], e.g., via the terminal MMI.   Retrieval - The download of the MM as defined in [MMSCTR]  Submission - The sending of the MM to the MMS Relay/Server as defined in [MMSCTR]. This includes the case where the MM submitted had been earlier retrieved in the terminal  Message Size - The message size of an MM, as defined for the MM Content Class concept (section 7), SHALL be determined as defined in [TS23140] or [XS0016200].   Kilobyte – One kilobyte equals 1024 bytes.  3.3. Abbreviations  AMR Adaptive Multi Rate  BMP                      Bit                      Map                      DRM Digital Rights Management GIF Graphics Interchange Format GIF 87a/89a GIF with animations MIDI Musical Instrument Digital Interface MIME Multipurpose Internet Mail Extension MM                       Multimedia                       Message                       MMI                      Man-Machine                      Interface                      MMS Multimedia Messaging Service MMSIOP MMS Interoperability between MMS handsets and MMS Servers MSISDN Mobile Station Integrated Services Digital Network OMA-MMS-CONF-v1_2-20030929-C Page 9 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  OMA                     Open                     Mobile                     Alliance                     PIM Personal Information Management QCIF Quarter Common Intermediate Format SMIL Synchronized Multimedia Integration Language UI                          User                          Interface                          UTF-8 Unicode Transformation Format WAP Wireless Application Protocol WBMP Wireless Bit Map  OMA-MMS-CONF-v1_2-20030929-C Page 10 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  4. Introduction  This document is an interoperability document, aiming at identifying the issues that need to be addressed in order   to   ensure   interoperability   of   MMS   functionalities   between   terminals   produced   by   different   manufacturers.  In  particular,  this  document  focuses  on  the  management  of  the  content  of  multimedia  messages, addressing in particular the coding and the presentation of multimedia messages.  In order to achieve interoperability, a minimum set of requirements needs to be defined at four levels:  •     Content of the message •     Allowed elements and attributes of the presentation language. •     Media content format.  •     Lower level capabilities  4.1. Usage of SMIL The  MMS  messages  compliant  with  this  interoperability  document  will  use  the  Synchronized  multimedia  Integration Language (SMIL) as the presentation language. [SMIL] In  this  first  phase  the  limited  displays  of  mobile  terminals  may  not  allow  us  to  take  full  advantage  of  the  presentation  capabilities  offered  by  SMIL  2.0  or  even  by  its  simplest  profile  \"SMIL  Basic\"  (see  Sec.  8).  However,  the  messages  that  are  produced  should  be  valid  and  complete  SMIL  messages,  and  should  be  displayed properly on non-mobile terminals (e.g., PCs).  In  this  document,  we  identify  a  very  limited  subset  of  SMIL  elements  (\"MMS  SMIL\")  which  are  needed  to  achieve  the  minimal  presentation  capabilities  required  by  the  first  phase  of  the  Multimedia  Messaging  Service MMS (see Sec. 8).  This  proposal  does  not  intend  to  constitute  a  conformance  statement  for  the  \"MMS  SMIL\"  subset.  The  interoperability is ensured by compliance to the guidelines about the overall content and organization of the message.  No  assumption  is  made  about  the  capability  of  MMS  clients  to  handle  correctly  any  SMIL  presentation that uses \"MMS SMIL\" elements. 4.2. Organization of the document Section 5 describes the overall structure of multimedia messages. Sections 6 and 7 defines the concepts of MM  Content  Domains  and  MM  Content  Classes.  The  means  to  format  an  MM  is  described  in  section  8.  Content  adaptation  between  different  MM  Content  Classes  and  which  requirements  that  put  on  MMS  are  described in 9. Section 10 describes conformance requirements on lower layers and technical requirements in the MM. In section 11 it is defined what an MMS Client has to follow to be compliant to a particular MM Content Class. Section 12 contains user interface guidelines in the form of creation modes.   OMA-MMS-CONF-v1_2-20030929-C Page 11 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  5. Structure of Multimedia Messages 5.1. Introduction This   section   defines   the   limitations   on   the   appearance   of   multimedia   messages   that   will   ensure   interoperability among different terminals. 5.2. Structure The  multimedia  messages  that  will  be  exchanged  during  the  first  phase  of  MMS  SHALL  consist  of  a  \"slide  show\", i.e. a succession of pages, each one containing at most two regions. One of the regions contains text and the other contains either an image or a video clip. A simple scheme of the organization of a multimedia message is depicted in Figure 1. The discussion about the coding formats to be used for the images and the text will be presented in section 7  Slide 1Slide 2Slide 3Slide nImage text + sound  Figure 1: Structure of a multimedia message  Each  multimedia  message  SHALL  be  represented  by  one  SMIL  presentation.  All  the  slides  in  the  presentation SHALL have the same layout. OMA-MMS-CONF-v1_2-20030929-C Page 12 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  6. MM Content Domains The  Core  MM  Content  Domain  SHALL  include  multimedia  messages  containing  content  that  is  compliant  with  a  subset  of  the  media  defined  in  3GPP  or  3GPP2  standards  (specifications  [TS26.140]  and  [CP0045]  respectively).  This  subset  SHALL  consist  of  several  MM  Content  Classes  defined  for  the  domain.  Each  multimedia message within the Core MM Content Domain MUST be compliant with one of the MM Content Classes  in  the  domain.  By  definition,  each  MM  belonging  to  the  Core  MM  Content  Domain  SHALL  also  belong to the Standard MM Content Domain. Within the Core MM Content Domain, the maximum size of the MMs SHALL be restricted to the defined values for the MM Content Classes. The Standard  MM  Content  Domain  SHALL  include  multimedia  messages  with  content  that  are  compliant  with the 3GPP standard [TS 26.140] or the 3GPP2 standard [CP0045]. This document does not specify MM Content  Classes  for  the  Standard  MM  Content  Domain.  Consequently,  the  maximum  size  of  the  MMs  SHALL be unlimited in Standard MM Content Domain. The Unclassified MM Content Domain SHALL include multimedia messages with content that is not compliant or is only partially compliant with the 3GPP or 3GPP2 standards. They MAY comply with other specifications, for instance IETF or W3C specifications. Within the Unclassified MM Content Domain, the maximum size of the MMs SHALL be unlimited.  OMA-MMS-CONF-v1_2-20030929-C Page 13 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  7. MM Content Classes  MM Content Classes are used to define the Core MM Content domain, see Table 1 and section 7.1.  Table 1, section 7.1 and its subsections are normative. MM  Content Class Size (kB) Text      Still      Image Bitmap    Video    Speech    Audio Synth. Audio PIM           DRM           PresentationText ≤30 US-ASCII, UTF-8, UTF-16 N/A             N/A              N/A             N/A               N/A             N/A                N/A             MMS             SMIL             Image Basic ≤30 US-ASCII, UTF-8, UTF-16 Baseline JPEG GIF87a, GIF89a, WBMP N/A            AMR-NB            or 13K N/A             vCard             2.1, vCalendar 1.0 N/A         MMS         SMIL         Image Rich ≤100 US-ASCII, UTF-8, UTF-16 Baseline JPEG GIF87a, GIF89a, WBMP N/A            AMR-NB            or 13K SP-MIDI     vCard     2.1, vCalendar 1.0 Fwd-Lock MMS SMIL Video Basic ≤100 US-ASCII, UTF-8, UTF-16 Baseline JPEG GIF87a, GIF89a, WBMP H.263  & AMR (.3GP) or (.3G2) AMR-NB or 13K  SP-MIDI     vCard     2.1, vCalendar 1.0 Fwd-Lock  MMS SMIL with video support Video Rich ≤300 US-ASCII, UTF-8, UTF-16 Baseline JPEG GIF87a, GIF89a, WBMP H.263  & AMR (.3GP) or (.3G2) AMR-NB or 13K  SP-MIDI     VCard     2.1, vCalendar 1.0 Fwd-Lock  MMS SMIL with video support Table 1, MM Content Classes Note: The purpose of MM Content Class Text is to enhance technical interoperability on text-only multimedia messaging. For detailed information and references to media formats mentioned in Table 1, please see [TS26140] or [CP0045]. The MM Content Classes defined in Table 1 are hierarchical, but this does not establish a principle for additional classes. An MMS Client conforming to this document SHALL support MM Content Class Text and at least one other MM Content Class. For more details about conformance please refer to chapter 11. An MM specified in [MMSCONF] belongs to either MM Content Class Text or MM Content Class Image Basic. In [MMSCONF], support of the speech codecs described in Table 1, SMIL and PIM objects are conditional (respectively under condition of support of audio, presentation part of the multimedia message and PIM). On the other hand, an MMS Client supporting MM Content Class Image Basic has to support presentation of speech codec attachments described in Table 1, SMIL as well as PIM objects in the limits as defined in this section. OMA-MMS-CONF-v1_2-20030929-C Page 14 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  7.1. Refinement of MM Content Classes This section gives further details of the MM Content Classes that are outlined in Table 1. 7.1.1. Image Resolution The maximum image resolutions for which interoperability is guaranteed are defined for the MM Content Classes Image Basic, Image Rich, Video Basic and Video Rich below. The receiving MMS Client MUST be able to receive, if necessary, downscale, and render the images with maximum resolution. The values are: 160*120 pixels for MM Content Class Image Basic  640*480 pixels for MM Content Classes Image Rich, Video Basic and Video Rich  7.1.2. PIM  The following PIM (Personal Information Management) [PIM] objects SHALL be supported as attachments to an MM. vCard version 2.1 (mime-type: text/x-vCard) vCalendar version 1.0 (mime-type: text/x-vCalendar) 7.1.3. Video The video encoder and decoder SHALL be compliant with the mandatory video codecs as defined in [TS26140] or [CP0045]. If a slide contains a video element, separate audio elements (speech, synthetic audio or audio) SHALL NOT be part of the same slide. This is valid even if the video element does not contain any audio information. 7.1.4. DRM Clients that support MM Content Classes with forward lock functionality SHALL support the OMA DRM forward lock functionality as defined in [OMADRM].  For more details about MMS and DRM see the informative Appendix A. 7.1.5. Message Size Each MM Content Class defines a minimum supported message size, for the definition of message size see section 3.2.  From a terminal manufacturer’s point of view this means that the terminal SHALL support receiving of multimedia messages of the minimum size to be conformant to a particular MM Content Class. From a content provider’s point of view this means that the maximum message size for which interoperability is guaranteed to a particular MM Content Class is the minimum supported message size of that MM Content Class. For more details about conformance, see section 11. OMA-MMS-CONF-v1_2-20030929-C Page 15 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  7.1.6. Speech Audio MMS Clients that are compliant to the MMS suite of specifications defined by 3GPP (e.g., [TS23140]) SHALL support AMR-NB as mentioned in Table 1 and referenced in [TS26140]. MMS Clients that are compliant to the MMS suite of specifications defined by 3GPP2 (e.g., [XS0016200]) SHALL support at least one of13K or AMR-NB as mentioned in Table 1 and referenced in [CP0045]. 7.1.7. Presentation MMS SMIL is OPTIONAL in submission of MM Content Class Text. Support for presentation of MM Content Classes Text and Image Basic multimedia messages with MMS SMIL and without MMS SMIL SHALL both be mandatory. MMS Clients that are compliant to the MMS suite of specifications defined by 3GPP (e.g., [TS23140]) SHALL support presentation by using MMS SMIL, for submission MMS SMIL SHALL be included in MMs that belong to the MM Core Content Domain but do not conform to MM Content Class Text. 7.1.8. Text The SMIL part is encoded text and the character set shall be UTF-8 [Unicode] with lower half of ISO 8859-1 character set (us-ascii set). The text parts (text/plain) of submitted MM SHALL support at least one of the following character encodings: •     us-ascii (IANA MIBEnum 3) •     utf-8 (IANA MIBenum 106) [Unicode] Character encoding utf-16 SHOULD NOT be used in “text/plain” media parts for submitted MM.   Note: Use of utf-16 within a “text/plain” media part may entail interoperability problems when the MM may be transported over the MMSE (MM3 in 3GPP terminology), MMSR (MM4 in 3GPP terminology) interfaces, or other transport protocols as detailed in [RFC2781]. MMS Clients SHALL support received MM with text parts (text/plain) encoded in us-ascii and utf-8. MMS Clients that are compliant to the MMS suite of specifications defined by 3GPP (e.g., [TS23140]) SHALL support received MM with text parts (text/plain) encoded in utf-16 (IANA MIBenum 1015) with explicit Byte Order Mark (BOM) [Unicode]. A MMS Proxy-Relay that identifies a text/plain part encoded in utf-16 that is intended for transfer over MMSE or MMSR SHALL adapt the content to comply with the appropriate transport protocol. In the text parts, the supported characters (glyphs) shall be at least those in [ISO8859-1]. OMA-MMS-CONF-v1_2-20030929-C Page 16 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  8. Presentation Methods  SMIL is a presentation language, i.e. a SMIL page contains information about the appearance of different multimedia elements on a display. When SMIL is used to represent content on a PC screen, normally a window is opened whose size is defined by the layout element of the SMIL page to be displayed. In this way, the appearance of the SMIL page on the screen will reflect exactly the organization of the content as the author had created it.   When SMIL is used for the presentation of multimedia messages on mobile terminals, the size of the window is severely limited by the resolution and appearance of the terminal display. The layout of a multimedia message represents the content as created by the originator, but it is well possible that the original layout simply does not fit into the display of the receiving terminal. Therefore, SMIL exchange must be simple enough to ensure that -if the displays of the originator and receiver terminal are different- the content can still be displayed, possibly by changing the relative position of the different elements.   RegardsRegards Figure 2: The same message needs to be reorganized for display on different displays.  Due to the limited processing power of the first generation of MMS-enabled devices, this adaptation process must be achieved without the need of complex content analysis and interpretation. In order to achieve this goal, the layout of the outgoing message SHOULD reflect (in terms of size and orientation) the display characteristics of the originating terminal, and MUST always contain at most two regions one labeled as \"Text\", the other as \"Image\".  Region labeled as “Text” MUST contain only text media, whereas region labeled as “Image” MUST contain only Image or Video media. If the receiving terminal can fit the SMIL layout in its screen as is, no change will be necessary. Otherwise, if the display of the receiving terminal does not allow the fitting of the layout as specified in the incoming message, the receiving MMS client MAY replace the layout section with a terminal-specific one in which the size and the position of the \"Text\" and \"Image\" regions are appropriately redefined.  The following example (Example 1) shows a simple multimedia message composed by three slides, described in the <body> part of the message. There are two different <layout> parts, one corresponding to the \"landscape\" orientation of the display, one to the \"portrait\" orientation.  OMA-MMS-CONF-v1_2-20030929-C Page 17 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]   <smil>                  <head>                                                   <meta name=\"title\" content=\"mms\" />                                   <meta name=\"author\" content=\"John Smith\" />                                    <layout>  <! --This an \"landscape\" screen (2*qcif)-->                                                    <root-layout width=\"352\" height=\"144\"/>                                                      <region id=\"Image\" width=\"176\" height=\"144\" left=\"0\" top=\"0\" />                                         <region id=\"Text\" width=\"176\" height=\"144\" left=\"176\" top =\"0\"/>                    </layout>    <!--   <layout>   // This is a \"portrait\" screen --> <!--                                  <root-layout width=\"176\" height=\"216\"/>  --> <!--           <region id=\"Image\" width=\"176\" height=\"144\" left=\"0\" top=\"0\" />  --> <!--                 <region id=\"Text\" width=\"176\" height=\"72\" left=\"0\" top =\"144\"/>  --> <!--   </layout>  -->                   </head>                                  <body>                                     <par dur = \"8000ms\">                        <img  src = \"FirstImage.jpg\" region=\"Image\" />                        <text src = \"FirstText.txt\" region=\"Text\" />           <audio src = \"FirstSound.amr\"/>                       </par>                     <par dur = \"7000ms\" >                        <img   src = \"SecondImage.jpg\" region=\"Image\" />                        <text  src = \"SecondText.txt\" region=\"Text\" />                          <audio src = \"SecondSound.amr\"/>                      </par>                     <par dur = \"4000ms\" >            <img   src = \"ThirdImage.jpg\" region=\"Image\"/>           <text  src =  \"ThirdText.txt\" region=\"Text\"/>           <audio src = \"ThirdSound.amr\"/>        </par>     </body> </smil> Example 1, A multimedia message containing three slides  Even if low end terminals might disregard completely the incoming <layout> section and replace it with a terminal specific one, it is important that all outgoing messages are constructed in such way that they will be displayed properly on non-mobile terminals (such as PCs), and on more capable mobile terminals when they are available in the future. OMA-MMS-CONF-v1_2-20030929-C Page 18 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  A slide that contains video SHALL contain only video and text components. An example of slide containing video is given below in Example 2: <smil>    <head>       <layout>          <root-layout height=\"200\" width=”176\" />          <region id=\"Image\" height=\"144\" width=\"176” />          <region id=\"Text\" height=\"56\" width=\"176\" fit=\"scroll\" />       </layout>    </head>    <body>       <par dur=\"20000ms\">          <video src=\"videoclipname.3gp\" region=\"Image\" />          <text src=\"Text1.txt\" region=\"Text\" />       </par>       <par dur=\"2000ms\">          <img src=\"image.gif\" region=\"Image\" />          <text src=\"cid:Text2\" region=\"Text\" />       </par>    </body> </smil> Example 2, A multimedia message slide containing a slide with a video clip 8.1. MMS SMIL This section presents a minimum selection of SMIL elements that allow the presentation of multimedia messages, as described in section 5. The elements of \"MMS SMIL\" are grouped by functionality, in analogy to the approach followed in the SMIL specification of W3C [SMIL]. 8.1.1. Collections used in the tables For simplicity, some of the elements and attributes that appear more commonly in the definitions are here grouped in \"collections\" that are referred to in the following tables. The grouping of MMS SMIL elements in this specification SHALL be according to Table 2. Collection Name Elements in Collection MMSSchedule                                 par,                                                                  MMSMediaContent text, img, audio, video, ref Table 2, MMS SMIL grouping of elements 8.1.2. Elements used in MMS SMIL 8.1.2.1. Layout Modules The Layout Modules provides a framework for spatial layout of visual components. MMS SMIL SHALL adopt parts of the SMIL 2.0 BasicLayout module as shown in Table 3.  Elements                                         Attributes                                         Content                                         Model                                         Layout                                                                                          region,                                             root-layout                                             Region left, top, height, width, fit, id     EMPTY OMA-MMS-CONF-v1_2-20030929-C Page 19 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  root-layout  width, height EMPTY Table 3, The MMS SMIL layout module Default dimensions of the root-layout are the dimensions of terminal display area. Sizes of regions are calculated as is SMIL BasicLayout. The dimensions of the regions inside the root-layout can be expressed in absolute terms (i.e. in pixels) or  in percentages relative to the dimensions of the root-layout. For the sake of clarity, mixed absolute/relative notations SHOULD be avoided. 8.1.2.2. Media Object Modules The Media Object Modules provide a framework for declaring media, which constitute the contents of a SMIL presentation. MMS SMIL includes parts of the SMIL BasicMedia module. The begin and end attributes belong to the BasicInlineTiming module. The media object modules of MMS SMIL SHALL be defined according to Table 4. Elements                               Attributes                               Content Model Text src, region, alt,  begin, end, dur EMPTY Img src, region, alt , begin, end, dur EMPTY Audio src, alt, begin, end, dur EMPTY Video src, region, alt, begin, end, dur EMPTY ref,  src, region, alt, begin, end, dur EMPTY Table 4, The MMS SMIL media object modules The media type referred to by src MUST match that of the element to which it refers. In other words expressions like <img src = \"text_object\"> , although permitted by SMIL, are not allowed in SMIL MMS. img elements can only refer to images, txt to text, and video to video media. According to the rendering capabilities of the receiving terminals, the timing attributes begin and end associated to single media elements MAY be neglected or overridden by user control. The Video tag SHALL be present only in multimedia messages conforming to MM Content Classes Video Basic and/or Video Rich. 8.1.2.3. Structure Modules The Structure Modules describe the structure of the SMIL document. The structure modules of MMS SMIL SHALL be defined according to the parts of the SMIL Structure module listed in Table 5. Elements                                               Attributes                                                 Content                                               Model                                               Smil                                          head,                     body                     Head                                        layout                    Body                                        MMSSchedule                    OMA-MMS-CONF-v1_2-20030929-C Page 20 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Table 5, The MMS SMIL structure modules 8.1.2.4. Timing and Synchronization Modules The Timing and Synchronization Module provides a framework for describing timing structure, timing control properties, and temporal relationships between elements.  The MMS SMIL includes the par element from the BasicTimeContainer module and the begin, end, dur attributes form the BasicInlineTiming module. The begin, end and dur attributes can be used in conjunction with the media object elements (see section 8.1.2.2). Some constraints are added in order to achieve a simple scheduled timeline. MMS SMIL SHALL NOT adopt nesting of time containers, as mentioned in the section of Timing and Synchronization Module, and only allows a single level of explicit time container elements.  An MMS message using MMS SMIL SHOULD have one or more (non nested) <par>....</par> time container(s) child(ren) of the  body element, each one corresponding to one \"slide\" (see section 5.2). The structure element  body is implicitly defined to be a seq time container in SMIL1.0 and SMIL Boston language profile, and MMS SMIL follows this definition. The succession of <par> ... </par> clauses will therefore achieve the \"slide show\" presentation effect. The MMS SMIL timing and synchronization module SHALL be defined according to Table 6. Elements                        Attributes                        Content                        Model                        Par               dur               MMSMediaContent               Table 6, The MMS SMIL timing and synchronization module The  receiving  terminal  MAY  override  the  duration  of  the  single  slides  specified  in  he  SMIL  page,  e.g.,  by  controlling the passage to the next slide with phone key.  Time SHALL be expressed in integer milliseconds. 8.1.2.5. Meta information modules This module contains elements and attributes allowing to describe SMIL documents. The MMS messages MAY contain meta-information, included in the message by means of the meta element.  The MMS terminal MUST be able to parse the meta element, but the processing of the meta element is OPTIONAL. The MMS SMIL meta information module SHALL be defined according to Table 7. Elements                        Attributes                        Content                        Model                        Meta            Name,            content            EMPTY            Table 7, The MMS SMIL meta information module OMA-MMS-CONF-v1_2-20030929-C Page 21 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  9. Content Adaptation 9.1. Overview The  MM  Content  Classes  defined  for  the  Core  MM  Content  Domain  lay  out  basis  for  interoperable  messaging  with  simple  but  mandatory  requirements  for  multimedia  support.  However,  the  MM  Content  Classes  provide  seamless  interoperability  only  within  each  content  class,  in  other  words,  if  the  sender  and  recipient both support the same content class. Although  there  are  carefully  considered  multimedia  support  in  each  MM  Content  Class  and  relation  of  the  supported multimedia formats between the classes, seamless interoperability cannot be guaranteed between the  classes.  There  is  no  end-to-end  capability  negotiation  with  MMS  that  would  let  the  sender  to  know  the  exact MMS support of the recipient. The  term  content  adaptation  consists  of  a  series  of  functions  and  definitions,  which  alter  the  content  not  supported  by  the  recipient  MMS  Client  to  a  content  which  is  supported  by  the  recipient  yet  preserving  the  original information content to the extent possible. These functions, called transcoding functions, may resize multimedia  objects,  perform  conversion  between  media  formats,  perform  conversion  between  media  types  and, ultimately, even drop off some unsupported media objects. The purpose of content adaptation is to bridge the gaps between MM Content Classes in core MM Content Domain  to  minimise  the  requirement  for  sending  MMS  Client  to  know  the capabilities of the recipient MMS Client. The content adaptation is divided into two categories, minor adaptation and major adaptation. “Minor adaptation” refers to transcoding functions, which mainly adapt the message size, image resolution, sound  and  video  quality  to  match  the  capabilities  of  the  receiving  MMS  Client  while  preserving  the  information  content  of  the  multimedia  message.  Minor  adaptation  does  not  in  general  contain  removal  of  media content or media type conversions. Adaptations between media formats are considered minor if end-user perceives no drastic loss of quality or loss of content. “Major  adaptation”  refers  to  transcoding  functions,  which  perform  more  drastic  message  size,  image  resolution,  sound  and  video  quality  adaptations  which  generally  result  to  loss  of  information  content.  Major  adaptation may include removal of media content and media type conversions. Adaptations between media formats are considered major if end-user perceives drastic loss of quality or content. In  this  document,  the  media  aspects  of  content  adaptation  are  discussed.  The  related  message  flows  are  discussed in [MMSCTR]. 9.2. Transcoding Policy between MM Content Classes The  MM  Content  Classes  in  core  MM  content  domain  do  not  provide  seamless  interoperability,  since  different  classes  have  different  requirements  for  media  type  support.  Thus,  it  is  necessary  to  introduce  content adaptation policy between the MM Content Classes. Messaging between the classes are described in Table 8 and below that, a transcoding policy is introduced in each case. In practice, the content adaptation rules listed here result in the minimum conformant multimedia message. Additional  knowledge  of  the  terminal  capabilities  (e.g.,  learned  through  UAProf  [UAProf])  SHALL  be  used  when making the content adaptation decision.  For example: if a terminal will support a download larger than the minimum allowed by its supported content class, this is encouraged. If more detailed information than the supported MMS Content Class(es) is not available through UAProf, the rules in bullets 1-7 below SHALL be used.  OMA-MMS-CONF-v1_2-20030929-C Page 22 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Supported class Æ Received         class                              È Image basic Image rich Video basic Video rich Text N/A N/A N/A N/A Image basic N/A N/A N/A N/A Image rich 1, 2,3,5 N/A N/A N/A Video basic 1, 2,3,5,6 7 N/A N/A Video rich 1, 2,3,5,6 4,7 4 N/A Table 8. Content adaptation within core MM content domain  1.      Major:   for the purpose of size reduction, GIF89a (animated) is converted to object(s) of any mandatory image format(s) with related presentation and GIF89a part is removed. 2.   Minor: The image resolutions is reduced to 160*120 pixels. 3.   Minor:   The  message  size  is  reduced  to  30  kB  using  resolution  and  quality  reduction  techniques for image and speech. 4.   Minor:  The  message  size  is  reduced  to  100  kB  using  resolution,  frame-rate  and  other  quality reduction techniques for image, speech and video objects. 5.   Major: The SP-MIDI media type is removed. 6.   Major:  One  or  more  video  frame(s)  are  converted  to  object(s)  of  any  mandatory  image  format  with  related  presentation  and  video  part  is  removed.  QCIF  resolution  is  scaled  to  160*120 pixels. 7.   Major:   One  or  more  video  frame(s)  are  converted  to  object(s)  of  any  mandatory  image  format with related presentation and video part is removed. The rules in bullets 1-7 above do not imply any priority order. 9.3. Transcoding Matrices In the following tables, content adaptation between media formats and types are classified as minor or major. Guidelines  and  reasoning  are  given  as  notes  below  the  tables.  The  content  adaptation  is  marked  non-applicable when the original format is already supported as part of the target format or when original format is mandatory in all MM Content Classes. 9.3.1. Still Image and Graphics Transcoding Still image and graphics transcoding SHALL be classified according to Table 9. To:From: JPEG baseline OMA-MMS-CONF-v1_2-20030929-C Page 23 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  JPEG Baseline Minor Table 9, Classification of still image and graphics transcoding 9.3.2. Bitmap Graphics Transcoding Bitmap graphics transcoding SHALL be classified according to Table 10. To: From: GIF87a            GIF89a             WBMP               JPEG            GIF87a Minor                 N/A                   N/A                  Minor                 GIF89a (animated) Major (1) Minor N/A Major (1) WBMP N/A                  N/A                  Minor                  Minor                  Table 10, Classification of bitmap graphics transcoding GIF89a  contains  GIF87  +  animations  +  transparent  mode  (allowing  one  part  of  the  image  to  be  on  top  of  transparent background). (1)  Driven  by  file  size  reduction  only.  If  animated,  one  or  more  frame(s)  of  animation  converted to any mandatory image format. 9.3.3. Speech Audio Transcoding Speech audio transcoding SHALL be classified according to Table 11. To:From: AMR AMR Minor (1) Table 11, Classification of speech audio transcoding (1)   The   size   reduction   with   bearable   quality   loss   is   modest   considering   the   required   processing. 9.3.4. Synthetic Audio Transcoding Synthetic audio transcoding SHALL be classified according to Table 12. To:From: SP-MIDI                    AMR                    SP-MIDI Major (1) Major (2) Table 12, Classification of synthetic audio transcoding (1)  Reduction  of  size  requires  dropping  of  instruments  which  may  result  in  major  loss  of  quality. SP-MIDI itself is compact format. Thus, increase of file size may result. (2)  Considering the SP-MIDI approach of synthetised instruments, this transcoding may result in significant loss of informantion. OMA-MMS-CONF-v1_2-20030929-C Page 24 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  9.3.5. Video Transcoding Video transcoding SHALL be classified according to Table 13. To: From: H.263 baseline profile 0 level 10 JPEG                    GIF87                    GIF89a                    H.263     baseline     profile 0 level 10 Minor Major (1) Major (1) Major (1) Table 13, Classification of video transcoding (1)   Video  to  image  transcoding  involved  conversion  of  one  or  more  video  frame(s)  to  one  or  more  objects  of  the  mandatory  image  formats  (one  JPEG,  GIF89a  (animated),  SMIL  incl.  several JPEG attachments), depending on the size constraint). .. 9.4. Requirements for Content Adaptation 9.4.1. MMS Client Requirements The requirements for MMS Client to support content adaptation are: •     The  recipient  MMS  client  SHALL  NOT  reject  the  multimedia  message  based  on  the  message size indicated in the MMS notification •     MMS client SHALL support UAProf [UAProf] for MMS client capability negotiation. 9.4.2. MMS Proxy-Relay Requirements The MMS Proxy-Relay requirements for the content adaptation are: •     MMS Proxy-Relay SHALL support UAProf [UAProf] for MMS client capability negotiation •     MMS  Proxy-Relay  SHALL  be  able  to  perform  minor  content  adaptation  as  specified  in  this document. •     MMS Proxy-Relay MAY be able to perform major content adaptation •     If  the  MMS  Proxy-Relay  is  able  to  perform  major  content  adaptation  it  SHALL  provide  means   to   the   MMS   service   provider   to   enable   or   disable   the   major   content   adaptationfunction. •     When major content adaptation is or needs to be applied to an MM, the original content of the MM SHOULD be available to the end-user through subsequent MMS transactions or  by  other  means  (e.g.,  web  or  IMAP  interface  store  or  forwarding  to  e-mail).  No  additional constraints on multimedia message retention time are implied. When a media format/type adaptation is accomplished, the extension of the files and the MIME types MUST be  modified  accordingly  in  the  corresponding  header  fields.  These  changes  MUST  be  reflected  in  the  presentation element. When a media type adaptation is accomplished, the labels in the presentation element MUST be modified if appropriate (e.g., <video> to <img> in the adaptation from video to image) OMA-MMS-CONF-v1_2-20030929-C Page 25 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  If major content adaptation was performed or a media element is dropped during the content adaptation the MMS Proxy-Relay SHALL insert information in the MM (e.g., by modification of the text element contained in the same slide) to inform the user of this fact. OMA-MMS-CONF-v1_2-20030929-C Page 26 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  10. Technical Interoperability The OMA MMSM interface SHALL adhere to the technical definitions in the following subsections of section 10. 10.1. WAP Flow Control WTP SAR, using relevant TPIs (at least \"PSN\" and \"Option Maximum Group\"), SHALL be supported as described in [WAPWTP] sections 8.10 and 8.14. 10.2. MMS Encoding 10.2.1. Encoding and Values in MMS Headers The Content-Type in M-Send.req and M-Retrieve.conf SHALL be application/vnd.wap.multipart.mixed when there is no presentation, and application/vnd.wap.multipart.related SHALL be used when there is SMIL presentation available. Use of other content types is outside the scope of this specification. Some of the MMS headers have been defined as \"Encoded-string-value\". The character set IANA MIBEnum value in these headers SHALL be encoded as Integer-value ([WAPWSP] section 8.4.2.3). The character set us-ascii (IANA MIBenum 3) SHALL always be accepted. If the character set is not specified (simple Text-string encoding) the character set SHALL be identified as us-ascii (lower half of ISO 8859-1 [ISO8859-1]). When the text string cannot be represented as us-ascii, the character set SHALL be encoded as utf-8 (IANA MIBenum 106) which has unique byte ordering. In the MMS headers the supported characters SHALL be at least those in ISO 8859-1. The headers whose definition is Text-string (Content-Location, Message-ID, etc.) SHALL contain only us-ascii characters (lower half of ISO 8859-1 [ISO8859-1]). 10.2.2. Message Content Encoding WSP multipart encoding SHALL be used [WAPWSP]. The shortest encoding of integer-values SHALL be used. Content types in WSP multipart headers SHALL be encoded using WSP binary values whenever available. If they are not available in [WAPWSP], text encoding SHALL be used. When no parameters are present, the content type values SHALL be encoded according to Constrained-media = Constrained-encoding = Extension-Media | Short-integer, see [WAPWSP] 8.4.2.24. Content type for SMIL SHALL be application/smil. Techniques from [RFC2557] SHALL be used when referencing to multimedia objects from SMIL presentation (Content-Id and Content-Location). The maximum size of Content-Id or Content-Location SHALL be 100 characters. Character encoding with WSP multipart headers (Content-Id, Content-Location, etc.) SHALL be us-ascii (lower half of ISO 8859-1), as there is no WSP specific definition for the character set encoding in part headers. The use of WSP multipart headers to other than referencing purposes (Content-Id, etc.) and character set definition SHALL be outside of the scope of this specification OMA-MMS-CONF-v1_2-20030929-C Page 27 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]   10.2.3. Start Parameter Referring to Presentation The presentation part in an application/vnd.wap.multipart.related structure SHALL be identified by a Content-ID header in the multipart structure. ([WAPWSP] 8.5.3). According to [RFC2387] Content-ID in start parameter contains < and > characters: Content-Type: Multipart/Related;   start=\"<950120.aaCC@XIson.com>\";                             type=\"application/smil\"                            These < and > SHALL be retained in the header, but quotes SHALL be omitted. Also, quotes SHALL NOT be used in the content type specification of SMIL. The corresponding Content-ID header of the SMIL body part SHOULD contain the same string with < and > included. 10.2.4. SMIL Part Referring to Multimedia Objects Within SMIL part the reference to the media object parts SHALL use either Content-ID or Content-Location mechanism [RFC2557] and the corresponding WSP part headers in media object parts contain the corresponding definitions. In case of Content-ID, the URI:s SHALL be without < and > (compare to [RFC2557], <IMG SRC=\"cid:950120.aaCC@XIson.com\">). To resolve a CID reference, \"cid:\" part SHALL be removed from the string, and the remaining string enclosed within < > marks. After this it can be compared to the value obtained from Content-ID header. As the CID reference is only used within a single message, there is no need to create globally unique values for the content-ids, and there SHALL be no requirement for a legal address definition for the CID. The Content-Location reference in the SMIL part SHALL be represented as relative URI, e.g., <img src=”myimage.jpg”>). The corresponding definition in media object parts shall be: Content-Location: myimage.jpg The content-location header MAY be used by the MMS Client as a hint when generating a filename for the media object. However, as different operating systems have different rules for valid filenames, there is no guarantee that a filename generated by one operating system is valid in another operating system. 10.2.5. Maximum values of MMS parameters As id:s and references may vary a lot in different implementations this cspecification will also cover some of these as well as some other length dependent values, in order to achieve interoperability. The maximum values of MMS parameters SHALL be specified according to Table 14. Constraints SHALL NOT be put on the actual values, only on their lengths counted in us-ascii characters.  Message ID 40 characters Transaction ID 40 characters X-MMS-Content-Location         100         characters         MMSC URL length 50 characters OMA-MMS-CONF-v1_2-20030929-C Page 28 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Subject 40 characters (Max subject length in M_Notification.ind)  X-Mms-Response-text 30 characters To, Cc and Bcc 312 characters total, including phrase and mailbox. Note that the mailbox portion, including punctuation (“<>@”), is limited to 256 characters per [RFC2821]. Table 14, Maximum values of MMS parameters A minimum of 20 addresses SHALL be supported within the “To”, “Cc”and “Bcc” header fields. These MAY be split up in the three field categories in any desired way but SHALL result in a total number  less or equal to 20 addresses but no less than one address. The support of the “Bcc” field upon submission of an MM is OPTIONAL for the originating MMS Client. In addition the maximum number of characters per address SHALL be less or equal to 312 characters total, including phrase and mailbox; the mailbox portion, including punctuation (“<>@”), SHALL follow the limitations described in [RFC 2821]. OMA-MMS-CONF-v1_2-20030929-C Page 29 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  11. MMS Client Conformance 11.1. Conformance Requirements It is recognised that an MMS Client declares MMS creation conformance, MMS submission conformance, MMS retrieval conformance and MMS presentation conformance (see section 11.3) to enable an interoperable MMS mass market. Declaration of partial conformance may be needed for devices where not all MMS functionalities are necessary, for instance, accessories. The MMS Client can reach two levels of conformance to this document (for the definition of MM Content Class, see section 7): (1) Full Conformance to an MM Content Class A fully conformant MMS Client to an MM Content Class SHALL satisfy the following requirements: •     the MMS Client is MMS creation conformant (as specified in section 11.3.1) to that MM Content Class •     the MMS Client is MMS submission conformant (as specified in section 11.3.2) to that MM Content Class •     the MMS Client is MMS retrieval conformant (as specified in section 11.3.3) to that MM Content Class •     the MMS Client is MMS presentation conformant (as specified in section 11.3.4) to that MM Content Class.  An MMS Client SHALL NOT be able to declare full conformance to MM Content Class Text alone. (2) Partial Conformance to an MM Content Class The MMS Client is partially conformant to an MM Content Class, if the following requirements  (A) and (B) are both fulfilled: A.   At least one of the following requirements SHALL be fulfilled: 1.   The MMS Client is MMS creation conformant (as specified in section 11.3.1) to that MM Content Class 2.   The MMS Client is MMS submission conformant (as specified in section 11.3.2) to that MM Content Class 3.   The MMS Client is MMS retrieval conformant (as specified in section 11.3.3) to that MM Content Class 4.   The MMS Client is MMS presentation conformant (as specified in section 11.3.4) to that MM Content Class B.   Each of the following requirements SHALL be fulfilled: 1.   If the MMS Client supports the Stage 2 functions defined in [TS23140] or [XS0016200] for creation of MM, the MMS Client is MMS creation conformant to that MM Content Class.  OMA-MMS-CONF-v1_2-20030929-C Page 30 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  2.   If the MMS Client supports the functions defined in[MMSCTR] for submission of MM, the MMS Client is MMS submission conformant to that MM Content Class.  3.   If the MMS Client supports the functions defined in[MMSCTR] for retrieval of MM, the MMS Client is MMS retrieval conformant to that MM Content Class.  4.   If the MMS Client supports the Stage 2 functions defined in [TS23140] or [XS0016200] for presentation of MM, the MMS Client is MMS presentation conformant to that MM Content Class.  Note: [TS23140] and [XS0016200] specifiy that support of retrieval of MM is mandatory in the MMS Client, whereas creation, submission and presentation are optional. 11.2. Content Conformance  11.2.1. Media Object Conformance For a multimedia element to be media object conformant to a given MM Content Class the media type and format of that multimedia element SHALL belong to the MM Content Class in question and the size, resolution, encoding and other requirements of that MM Content Class SHALL be followed. 11.2.2. Content Class Conformance For a multimedia composite object to be content class conformant to a given MM Content Class all media objects comprising that multimedia composite object SHALL be media object conformant to the given MM Content Class. Additionally, the presentation element SHALL follow the rules and definitions of the MM Content Class in question. 11.2.3. Message Conformance For an MM to be message conformant to given MM Content Class the following requirements SHALL be fulfilled: 1.   The multimedia message is content class conformant to the given MM Content Class, 2.    The  multimedia  message  is  encoded  according  to  relevant  OMA  specifications  (see  [MMSENC] and section 10.2), 3.    The  size  of  the  MM  (as  defined  in  [TS23140]  or  [XS0016200])  is  less  than  or  equal  to  the maximum size defined for the given MM Content Class. 11.3. Functional Conformance  11.3.1. MMS Creation Conformance For an MMS Client to be MMS creation conformant to a given MM Content Class, the following conditions SHALL all fulfilled: 1.   The MMS Client SHALL support the insertion, of all media formats for all media types defined in the given MM Content Class, to an MM. 2.   If the MMS Client supports also creation of MM that do not belong to that given MM Content Class, the MMS Client SHALL follow the rules defined in section 12 for the current creation mode. OMA-MMS-CONF-v1_2-20030929-C Page 31 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  11.3.2. MMS Submission Conformance For an MMS Client to be MMS submission conformant to a given MM Content Class the following conditions SHALL all fulfilled: 1.   The MMS Client SHALL support the submission of any MM being message conformant to the given MM Content Class from the MMS Client to the MMS Proxy-Relay according to [MMSCTR]. 2.    The MMS Client SHALL follow the rules defined in section 12 for the current creation mode. 11.3.3. MMS Retrieval Conformance For an MMS Client to be MMS retrieval conformant to a given MM Content Class it SHALL support the retrieval of any MM being message conformant to the given MM Content Class from the MMS Proxy-Relay to the MMS Client, according to [MMSCTR]. 11.3.4. MMS Presentation Conformance For an MMS Client to be MMS presentaion conformant to a given MM Content Class it SHALL be able to present all the media objects of any MM being message conformant to the MM Content Class, according to the presentation object and additional rules and definitions given in this document. OMA-MMS-CONF-v1_2-20030929-C Page 32 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  12. Creation Modes MMS Clients that are compliant to the MMS suite of specifications defined by 3GPP (e.g., [TS23140]) SHALL support the requirements in this section. To facilitate creation and submission of interoperable MMs, three creation modes are defined as follows. The terms ‘creation’ and ‘submission’ are defined in section 3.2 of this document. Creation mode RESTRICTED. In this mode, a terminal SHALL only create and submit MMs compliant with the MM Content Classes as defined in section 7.. Creation mode WARNING. In this mode, a terminal SHALL guide the user to create and submit only MMs that  are  message  conformant  to  the  MM  Content  Classes  as  defined  in  section  7.  This  guidance  may,  for  instance, be implemented as warnings to the user. If the user chooses to create and submit an MM which is compliant  with  the  MM  Content  Classes,  the  MM  shall  be  conformant  with  the  MM  Content  Classes  as  defined in section 7. The form of the guidance and choice is not specified. Creation mode FREE. In this mode, a terminal MAY allow the user to add any content to the MM. The terminal SHALL support the Creation mode RESTRICTED. The terminal MAY support the other creation modes, WARNING and FREE. The requirements for all supported creation modes SHALL be mandatory. The creation mode SHOULD be configurable. Examples of methods of configuration are: •     Preconfiguration at manufacturing phase •     Configuration via user menu •     Configuration via device management •     Configuration via (U)SIM In the future, the number of MM Content Classes may increase. Thus, in the configuration for creation modes it is important to attach information to which version of this specification the RESTRICTED and WARNING modes apply to.     OMA-MMS-CONF-v1_2-20030929-C Page 33 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Appendix A.   OMA DRM (Informative) A.1 Introduction The scope of OMA Digital Rights Management [OMADRM] is to enable the controlled consumption of digital media objects by allowing content providers to express usage rights, e.g., the ability to preview DRM content, to prevent downloaded DRM content from being illegally forwarded (copied) to other users, and to enable superdistribution of DRM content. By encapsulating the media object inside a forward-lock message, which is part of OMA DRM, the content owners can prevent users from copying objects outside the target device. The forward-locked object is wrapped in a forward-lock envelope to invoke a DRM agent in the target device. When the device receives an object inside a forward-lock message, the device disables the ability to copy the protected object outside the device. This means that the user cannot redistribute the object to other devices and other users. The object is locked inside the device, until deleted by the user.  OMA DRM shall be used to protect individual parts of content in a multimedia message. Multipart objects shall not be included in this forward-lock envelope. The multimedia message as a whole shall not be protected using OMA DRM. The SMIL presentation shall not be OMA DRM protected. A.2 OMA DRM Message Format The OMA DRM media type supports one parameter, the boundary parameter, which is part of the boundary delimiter. Using the boundary is mandatory with a MIME compliant transfer mechanism, as defined in [OMADRM]. The OMA DRM format follows the MIME multipart specification closely, and the message body must be formatted according to [RFC2046]. Multimedia message format or protocol layers should not be aware of this internal structure, only the MMS presentation playback requires knowledge on how to interpret OMA DRM content. A.2.1 Supported transfer encodings Mandatory transfer encodings according to [OMADRM] are the default 7-bit, 8-bit and binary. Those encodings should be used to achieve best possible interoperability.  A.2.2 Referencing OMA DRM content in MMS The presentation part of the MM shall reference OMA DRM protected content through Content-Location or Content-ID applied to the DRM body part in the MMS (please note that this is a header field different from the Content-ID inside the OMA DRM format – but may contain the same value). Content-Location may therefore contain an OMA DRM file extension, such as .dm (forward-lock).  A.2.2.1 One forward-locked media object Example 3 below shows the textual representation of a multimedia message with a forward-locked media object (a jpg image).  From:user@example.com  To:+40123456789/TYPE=PLMN  Subject:Hi!  X-MMS-Version:1.0  Content-Type:multipart/related;boundary=ID_1234567                                                              --ID_1234567  OMA-MMS-CONF-v1_2-20030929-C Page 34 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Content-Type:application/smil                                                                                                        <smil>    :  </smil>  --ID_1234567  Content-Type:application/vnd.oma.drm.message;boundary=PUTJTBYRBYTYBV                                            Content-Location:drmimage.dm     --PUTJTBYRBYTYBV  Content-Type:image/jpeg  Content-Transfer-Encoding:binary                                                                                                  XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX                                      XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX                                      XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX                                      XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX                                      XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX                                      XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX                                      --PUTJTBYRBYTYBV--  --ID_1234567--  Example 3, Multimedia message with DRM protected content The textual representation follows [RFC2822] very closely. When the message is sent to the client the MMS protocol specifies a binary format [MMSENC] where the MMS format uses WSP rules to encode headers and multipart objects. In this encoding process, OMA DRM content and headers shall not be altered in any way.   OMA-MMS-CONF-v1_2-20030929-C Page 35 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Appendix B.   Static Conformance Requirements (Normative) The notation used in this appendix is specified in [IOPProc]. B.1 MMS client B.1.1 General client requirements All the requirements in Table 15 SHALL NOT be valid for MMS Clients that are compliant to the MMS suite of specifications defined by 3GPP2 (e.g., [XS0016200]). Item Function Reference Status Requirement MMSCONF- GEN-C-001  Support for WAP flow control 10.1                       M                                              MMSCONF- GEN-C-002  Messages are encoded as specified 10.2                       M                                              MMSCONF- GEN-C-003 Support for maximum values for MMS parameters 10.2.5                    M                                        Table 15, General client requirements  B.1.2 General content class conformance requirements  Item Function Reference Status Requirement MMSCONF-CCC-C-001 Conformance to at least one MM content class in addition from the text class 7                            M                            MMSCONF-CCC-C-003 OR MMSCONF-CCC-C-004 MMSCONF-CCC-C-002 Conformance to the text class 7                            M                            MMSCONF-CCC-C-013 OR MMSCONF-CCC-C-014 MMSCONF-CCC-C-003 Full conformance to at least one MM content class 11.1                       O                       MMSCONF-CCC-C-005 OR MMSCONF-CCC-C-006 OR MMSCONF-CCC-C-007 OR MMSCONF-CCC-C-011 MMSCONF-CCC-C-004 Partial conformance to at least one MM content class 11.1                       O                       MMSCONF-CCC-C-008 OR MMSCONF-CCC-C-009 OR MMSCONF-CCC-C-010 OR MMSCONF-CCC-C-012  MMSCONF- CCC-C-005 Full conformance to image basic class 11.1                       O                       MMSCONF-IBC-C-001                       AND                       MMSCONF-IBC-C-002 AND MMSCONF-IBC-C-003 AND MMSCONF-IBC-C-004  MMSCONF-CCC-C-006 Full conformance to image rich class 11.1                       O                       MMSCONF-IRC-C-001                       AND                       MMSCONF-IRC-C-002 AND MMSCONF-IRC-C-003 AND MMSCONF-IRC-C-004 AND MMSCONF-CCC-C-005 OMA-MMS-CONF-v1_2-20030929-C Page 36 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Item Function Reference Status Requirement MMSCONF-CCC-C-007 Full conformance to video basic class 11.1                       O                       MMSCONF-VBC-C-001                       AND                       MMSCONF-VBC-C-002 AND MMSCONF-VBC-C-003 AND MMSCONF-VBC-C-004 AND MMSCONF-CCC-C-006 MMSCONF-CCC-C-008 Partial conformance to image basic class 11.1                       O                       MMSCONF-IBC-C-001                       OR                       MMSCONF-IBC-C-002 OR MMSCONF-IBC-C-003 OR MMSCONF-IBC-C-005 MMSCONF-CCC-C-009 Partial conformance to image rich class 11.1                       O                       MMSCONF-IRC-C-001                       OR                       MMSCONF-IRC-C-002 OR MMSCONF-IRC-C-003 OR MMSCONF-IRC-C-004 MMSCONF-CCC-C-010 Partial conformance to video basic class 11.1                       O                       MMSCONF-VBC-C-001                       OR                       MMSCONF-VBC-C-002 OR MMSCONF-VBC-C-003 OR MMSCONF-VBC-C-004 MMSCONF-CCC-C-011 Full conformance to video rich class 11.1                       O                       MMSCONF-VRC-C-001                       AND                       MMSCONF-VRC-C-002 AND MMSCONF-VRC-C-003 AND MMSCONF-VRC-C-004 AND MMSCONF-CCC-C-005 MMSCONF-CCC-C-012 Partial conformance to video rich class 11.1                       O                       MMSCONF-VRC-C-001                       OR                       MMSCONF-VRC-C-002 OR MMSCONF-VRC-C-003 OR MMSCONF-VRC-C-004 MMSCONF-CCC-C-013 Full conformance to text class 11.1                       O                       MMSCONF-TXC-C-001                       AND                       MMSCONF-TXC-C-002 AND MMSCONF-TXC-C-003 AND MMSCONF-TXC-C-004 MMSCONF-CCC-C-014 Partial conformance to text class 11.1                       O                       MMSCONF-TXC-C-001                       OR                       MMSCONF-TXC-C-002 OR MMSCONF-TXC-C-003 OR MMSCONF-TXC-C-004 Table 16, General content class conformance requirements B.1.3 Functional conformance to the image basic class  Item Function Reference Status Requirement MMSCONF-IBC-C-001 Creation conformance to image basic class 11.3.1                    O                    MMSCONF-IBC-C-005                    AND                                        MMSCONF-CMO-C-001 MMSCONF-IBC-C-002 Submission conformance to image basic class 11.3.2                    O                    MMSCONF-IBC-C-006                    AND                                        MMSCONF-CMO-C-001 AND MMSCTR-SND-C-001 MMSCONF-IBC-C-Retrieval conformance to 11.3.3                    O                    MMSCONF-IBC-C-007                    AND                    OMA-MMS-CONF-v1_2-20030929-C Page 37 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Item Function Reference Status Requirement 003 image basic class MMSCTR-FTC-C-001  MMSCONF-IBC-C-004 Presentation conformance to image basic class 11.3.4                    O                    MMSCONF-IBC-C-008                    MMSCONF-IBC-C-005 Support for the insertion in a created message of all media formats for all media types defined in the image basic class 11.3.1                    O                    MMSCONF-MED-C-001 AND MMSCONF-MED-C-006 AND MMSCONF-MED-C-008 AND MMSCONF-MED-C-012 AND MMSCONF-MED-C-015 AND MMSCONF-MED-C-023  MMSCONF-IBC-C-006 Support for the submission of any MM being message conformant to the image basic class 11.3.2                    O                                        MMSCONF-IBC-C-007 Support for the retrieval of any MM being message conformant to the image basic class 11.3.3                    O                                        MMSCONF-IBC-C-008 Ability to present all the media objects of any MM being conformant to the image basic class 11.3.4                    O                    MMSCONF-MED-C-001 AND MMSCONF-MED-C-006 AND MMSCONF-MED-C-008 AND MMSCONF-MED-C-012 AND MMSCONF-MED-C-015 AND MMSCONF-MED-C-023 AND MMSCONF-MED-C-004       Table 17, Functional conformance to the image basic class  B.1.4 Functional conformance to the image rich class  Item Function Reference Status Requirement MMSCONF-IRC-C-001 Creation conformance to image rich class 11.3.1                    O                    MMSCONF-IRC-C-005                    AND                                        MMSCONF-CMO-C-001 MMSCONF-IRC-C-002 Submission conformance to image rich class 11.3.2                    O                    MMSCONF-IRC-C-006                    AND                                        MMSCONF-CMO-C-001 AND MMSCTR-SND-C-001 MMSCONF-IRC-C-003 Retrieval conformance to image rich class 11.3.3                    O                    MMSCONF-IRC-C-007                    AND                    MMSCTR-FTC-C-001  MMSCONF-IRC-C-004 Presentation conformance to image rich class 11.3.4                    O                    MMSCONF-IRC-C-008                    MMSCONF-IRC-C-005 Support for the insertion in a created message of all media formats for all media types defined in 11.3.1                    O                    MMSCONF-MED-C-001 AND MMSCONF-MED-C-006 AND MMSCONF-MED-C-008 AND MMSCONF-MED-C-012 AND OMA-MMS-CONF-v1_2-20030929-C Page 38 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Item Function Reference Status Requirement the image rich class MMSCONF-MED-C-015 AND MMSCONF-MED-C-017AND MMSCONF-MED-C-022 AND MMSCONF-MED-C-023  MMSCONF-IRC-C-006 Support for the submission of any MM being message conformant to the image rich class 11.3.2                    O                                        MMSCONF-IRC-C-007 Support for the retrieval of any MM being message conformant to the image rich class 11.3.3                    O                                        MMSCONF-IRC-C-008 Ability to present all the media object of any MM being conformant to the image rich class 11.3.4                    O                    MMSCONF-MED-C-001 AND MMSCONF-MED-C-006 AND MMSCONF-MED-C-008 AND MMSCONF-MED-C-012 AND MMSCONF-MED-C-015 AND MMSCONF-MED-C-017AND MMSCONF-MED-C-022 AND MMSCONF-MED-C-023 AND MMSCONF-MED-C-004 Table 18, Functional conformance to the image rich class B.1.5 Functional conformance to the video basic class  Item Function Reference Status Requirement MMSCONF-VBC-C-001 Creation conformance to video basic class 11.3.1                    O                    MMSCONF-VBC-C-005                    AND                                        MMSCONF-CMO-C-001 MMSCONF-VBC-C-002 Submission conformance to video basic class 11.3.2                    O                    MMSCONF-VBC-C-006                    AND                                        MMSCONF-CMO-C-001 AND MMSCTR-SND-C-001 MMSCONF-VBC-C-003 Retrieval conformance to video basic class 11.3.3                    O                    MMSCONF-VBC-C-007                    AND                    MMSCTR-FTC-C-001  MMSCONF-VBC-C-004 Presentation conformance to video basic class 11.3.4                    O                    MMSCONF-VBC-C-008                    MMSCONF-VBC-C-005 Support for the insertion in a created message of all media formats for all media types defined in the video basic class 11.3.1                    O                    MMSCONF-MED-C-001 AND MMSCONF-MED-C-006 AND MMSCONF-MED-C-008 AND MMSCONF-MED-C-012 AND MMSCONF-MED-C-015 AND MMSCONF-MED-C-017 AND MMSCONF-MED-C-019 AND MMSCONF-MED-C-022 AND MMSCONF-MED-C-023 AND  MMSCONF-MED-C-026 OMA-MMS-CONF-v1_2-20030929-C Page 39 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Item Function Reference Status Requirement  MMSCONF-VBC-C-006 Support for the submission of any MM being message conformant to the video basic class 11.3.2                    O                                        MMSCONF-VBC-C-007 Support for the retrieval of any MM being message conformant to the video basic class 11.3.3                    O                                        MMSCONF-VBC-C-008 Ability to present all the media object of any MM being conformant to the video basic class 11.3.4                    O                    MMSCONF-MED-C-001 AND MMSCONF-MED-C-006 AND MMSCONF-MED-C-008 AND MMSCONF-MED-C-012 AND MMSCONF-MED-C-015 AND MMSCONF-MED-C-017 AND MMSCONF-MED-C-019 AND MMSCONF-MED-C-022 AND MMSCONF-MED-C-023 AND  MMSCONF-MED-C-026 AND MMSCONF-MED-C-004 Table 19, Functional conformance to the video basic class B.1.6 Functional conformance to the video rich class  Item Function Reference Status Requirement MMSCONF-VRC-C-001 Creation conformance to video rich class 11.3.1                    O                    MMSCONF-VRC-C-005                    AND                                        MMSCONF-CMO-C-001 MMSCONF-VRC-C-002 Submission conformance to video rich class 11.3.2                    O                    MMSCONF-VRC-C-006                    AND                                        MMSCONF-CMO-C-001 AND MMSCTR-SND-C-001 MMSCONF-VRC-C-003 Retrieval conformance to video rich class 11.3.3                    O                    MMSCONF-VRC-C-007                    AND                    MMSCTR-FTC-C-001  MMSCONF-VRC-C-004 Presentation conformance to video rich class 11.3.4                    O                    MMSCONF-VRC-C-008                    MMSCONF-VRC-C-005 Support for the insertion in a created message of all media formats for all media types defined in the video rich class 11.3.1                    O                    MMSCONF-MED-C-001 AND MMSCONF-MED-C-006 AND MMSCONF-MED-C-008 AND MMSCONF-MED-C-012 AND MMSCONF-MED-C-015 AND MMSCONF-MED-C-017 AND MMSCONF-MED-C-019 AND MMSCONF-MED-C-022 AND MMSCONF-MED-C-023 AND  MMSCONF-MED-C-026  OMA-MMS-CONF-v1_2-20030929-C Page 40 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Item Function Reference Status Requirement MMSCONF-VRC-C-006 Support for the submission of any MM being message conformant to the video rich class 11.3.2                    O                                        MMSCONF-VRC-C-007 Support for the retrieval of any MM being message conformant to the video rich class 11.3.3                    O                                        MMSCONF-VRC-C-008 Ability to present all the media object of any MM being conformant to the video rich class 11.3.4                    O                    MMSCONF-MED-C-001 AND MMSCONF-MED-C-006 AND MMSCONF-MED-C-008 AND MMSCONF-MED-C-012 AND MMSCONF-MED-C-015 AND MMSCONF-MED-C-017 AND MMSCONF-MED-C-019 AND MMSCONF-MED-C-022 AND MMSCONF-MED-C-023 AND  MMSCONF-MED-C-026 AND MMSCONF-MED-C-004 Table 20, Functional conformance to the video rich class B.1.7 Functional conformance to the text class  Item Function Reference Status Requirement MMSCONF-TXC-C-001 Creation conformance to text class 11.3.1 O MMSCONF-TXC-C-005 AND  MMSCONF-CMO-C-001 MMSCONF-TXC-C-002 Submission conformance to text class 11.3.2 O MMSCONF-TXC-C-006 AND  MMSCONF-CMO-C-001 AND MMSCTR-SND-C-001 MMSCONF-TXC-C-003 Retrieval conformance to text class 11.3.3                    O                    MMSCONF-TXC-C-007                    AND                    MMSCTR-FTC-C-001  MMSCONF-TXC-C-004 Presentation conformance to text class 11.3.4                    O                    MMSCONF-TXC-C-008                    MMSCONF-TXC-C-005 Support for the insertion in a created message of all media formats for all media types defined in the text class 11.3.1                    O                    MMSCONF-MED-C-001                     MMSCONF-TXC-C-006 Support for the submission of any MM being message conformant to the text class 11.3.2                    O                                        MMSCONF-TXC-C-007 Support for the retrieval of any MM being message conformant to 11.3.3                    O                                        OMA-MMS-CONF-v1_2-20030929-C Page 41 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Item Function Reference Status Requirement the text class MMSCONF-TXC-C-008 Ability to present all the media objects of any MM being conformant to the text class 11.3.4                    O                    MMSCONF-MED-C-001 AND MMSCONF-MED-C-004 AND MMSCONF-MED-C-023 Table 21, Functional conformance to the text class  B.1.8 Creation mode requirements All the requirements in Table 22 SHALL NOT be valid for MMS Clients that are compliant to the MMS suite of specifications defined by 3GPP2 (e.g., [XS0016200]). Item Function Reference Status Requirement MMSCONF-CMO-C-001 Support for requirements defined by the current creation mode 12                          M                                                    MMSCONF-CMO-C-002 Support for creation mode RESTRICTED as current creation mode 12                          M                                                    MMSCONF-CMO-C-003 Support for creation mode WARNING as current creation mode 12                          O                                                    MMSCONF-CMO-C-004 Support for creation mode FREE as current creation mode 12                          O                                                    MMSCONF-CMO-C-005 Support for configuration methods for selecting the creation mode 12                          O                                                    Table 22, Creation mode requirements B.1.9 Media type and format requirements Requirement MMSCONF-MED-C-004 in Table 23 SHALL NOT be valid for MMS Clients that are compliant to the MMS suite of specifications defined by 3GPP2 (e.g., [XS0016200]). Item Function Reference Status Requirement MMSCONF-MED-C-001  Support for media type text 7.1.8                      M                                            MMSCONF-MED-C-002  Support for us-ascii as media type text 7.1.8                      M                                            MMSCONF-MED-C-003  Support for utf-8 as media type text 7.1.8                      M                                            MMSCONF-MED-C-004  Support for presentation of utf-16 as media type text 7.1.8                      O                                            OMA-MMS-CONF-v1_2-20030929-C Page 42 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Item Function Reference Status Requirement MMSCONF-MED-C-005  Support for at least characters from ISO-8859-1 with media type text 7.1.8                      M                                            MMSCONF-MED-C-006  Support for media type still image 7                            M                                                        MMSCONF-MED-C-007  Support for baseline JPEG as media type still image 7                            M                                                        MMSCONF-MED-C-008 Support for media type bitmap 7                            M                                                        MMSCONF-MED-C-009  Support for GIF87a as media type bitmap 7                            M                                                        MMSCONF-MED-C-010  Support for GIF89a as media type bitmap 7                            M                                                        MMSCONF-MED-C-011  Support for WBMP as media type bitmap 7                            M                                                        MMSCONF-MED-C-012  Support for media type speech 7                            M                            MMSCONF-MED-C-013 OR MMSCONF-MED-C-014 MMSCONF-MED-C-013  Support for AMR-NB as media type speech 7                            O                                                        MMSCONF-MED-C-014 Support for 13K as media type speech 7                            O                                                        MMSCONF-MED-C-015  Support for PIM objects 7 M MMSCONF-MED-C-016 AND MMSCONF-MED-C-027 MMSCONF-MED-C-016  Support for vCard 2.1 as PIM object 7                            O                                                        MMSCONF-MED-C-017 Support for media type synthetic audio 7                            O                            MMSCONF-MED-C-018                            MMSCONF-MED-C-018 Support for SP-MIDI as media type synthetic audio 7                            O                                                        MMSCONF-MED-C-019 Support for media type video 7                            O                            MMSCONF-MED-C-020 OR MMSCONF-MED-C-021 MMSCONF-MED-C-020 Support for mandatory  video codecs as media type video defined in [TS26140] 7                            O                                                        MMSCONF-MED-C-021 Support for mandatory  video codecs as media type video defined in [CP0045] 7                            O                                                        OMA-MMS-CONF-v1_2-20030929-C Page 43 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Item Function Reference Status Requirement MMSCONF-MED-C-022 Support of OMA DRM forward-lock functionality 7.1.4                      O                      DRM-GEN-C-001  MMSCONF-MED-C-023  Support for presentation part of the message 7.1.7                      O                      MMSCONF-MED-C-024 AND MMSCONF- MED-C-025 MMSCONF-MED-C-024  Support for SMIL in presentation part 7.1.7                      O                                            MMSCONF- MED-C-025  Support for defined SMIL tags (without video tag) in presentation part 8                            O                                                        MMSCONF- MED-C-026 Support for the SMIL video tag in presentation part 8                            O                                                        MMSCONF-MED-C-027 Support for vCalendar 1.0 as PIM object 7                            O                                                        Table 23, Media type and format requirements B.1.10 Content adaptation requirements Requirement MMSCONF-CAD-C-002 in Table 24 SHALL NOT be valid for MMS Clients that are compliant to the MMS suite of specifications defined by 3GPP2 (e.g., [XS0016200]). Item Function Reference Status Requirement MMSCONF-CAD-C-001 Non-rejection of MMs based on the message size indicated in the MMS notification 9.4.1                      M                                            MMSCONF-CAD-C-002 Support of UAProf for MMS client capability negotiation 9.4.1                      M                      UAProf:                      MCF                      Table 24, Content adaptation requirements    B.2 MMS Proxy-Relay  B.2.1 General server requirements All the requirements in Table 25 SHALL NOT be valid for MMS Proxy-Relays that are compliant to the MMS suite of specifications defined by 3GPP2 (e.g., [XS0016200]). Item Function Reference Status Requirement OMA-MMS-CONF-v1_2-20030929-C Page 44 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  MMSCONF-GEN-S-001 Support of UAProf for MMS client capability negotiation 9.4.2                   M                   UAProf:                   MSF                   MMSCONF-GEN-S-002 Use of additional knowledge of terminal capabilities when making the content adapation decision. 9.2                      M                                            MMSCONF-GEN-S-003  Support for WAP flow control 10.1                    M                                        MMSCONF-GEN-S-004  Messages are encoded as specified 10.2                    M                                        Table 25, General server requirements  B.2.2 Content Adaptation - General  Item Function Reference Status Requirement MMSCONF-CAG-S-001 Support of minor content adaptation 9.4.2                   M                   MMSCONF-MIN-S-001 AND MMSCONF-MIN-S-002 AND MMSCONF-MIN-S-003 AND MMSCONF-MIN-S-004 AND MMSCONF-MIN-S-005 MMSCONF-CAG-S-002 Ability to perform major content adaptation 9.4.2                   O                   MMSCONF-CAG-S003 AND MMSCONF-CAG-S-004  MMSCONF-CAG-S-003 Function to enable or disable major content adaptation 9.4.2                   O                                      MMSCONF-CAG-S-004 Support of major content adaptation when enabled 9.4.2                   O                   MMSCONF-MAJ-S-001 AND MMSCONF-MAJ-S-002 AND MMSCONF-MAJ-S-003 AND MMSCONF-MAJ-S-004 AND MMSCONF-MAJ-S-005 MMSCONF-CAG-S-005 Availability of the original content of the MM to the end-user  when major content adaptation is or needs to be applied  9.4.2                   O                                      OMA-MMS-CONF-v1_2-20030929-C Page 45 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  MMSCONF-CAG-S-006 Function to insert information in the MM that major content adaptation was performed or a media element was dropped during content adaptation if major content adaptation is applied  9.4.2                   M                                      MMSCONF-CAG-S-007 Function to update labels in the presentation if media type adaptation is applied 9.4.2                   M                                      MMSCONF-CAG-S-008 Function to update file extensions and MIME types if media format/type adaptation is applied 9.4.2                   M                                      Table 26, General content adaptation requirements B.2.3 Functions for Minor Content Adaptation Item Function Reference Status Requirement MMSCONF-MIN-S-001 Adapting Image Rich to Image Basic 9.2                      O                      MMSCONF-AMN-S-001 AND MMSCONF-AMN-S-002 MMSCONF-MIN-S-002 Adapting Video Basic to Image Basic 9.2                      O                      MMSCONF-AMN-S-001 AND MMSCONF-AMN-S-002 MMSCONF-MIN-S-003 Adapting Video Rich to Image Basic 9.2                      O                      MMSCONF-AMN-S-001 AND MMSCONF-AMN-S-002 MMSCONF-MIN-S-004 Adapting Video Rich to Image Rich 9.2                      O                      MMSCONF-AMN-S-003                      MMSCONF-MIN-S-005 Adapting Video Rich to Video Basic 9.2                      O                      MMSCONF-AMN-S-003                      Table 27, Minor content adaptation function requirements  B.2.4 Functions for Major Content Adaptation  Item Function Reference Status Requirement MMSCONF-MAJ-S-001 Adapting Image Rich to Image Basic 9.2                      O                      MMSCONF-AMJ-S-001 AND MMSCONF-AMJ-S-004 MMSCONF-MAJ-S-002 Adapting Video Basic to Image Basic 9.2                      O                      MMSCONF-AMJ-S-001 AND MMSCONF-AMJ-S-003 AND MMSCONF-AMJ-S-004 OMA-MMS-CONF-v1_2-20030929-C Page 46 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  MMSCONF-MAJ-S-003 Adapting Video Rich to Image Basic 9.2                      O                      MMSCONF-AMJ-S-001 AND MMSCONF-AMJ-S-003 AND MMSCONF-AMJ-S-004 MMSCONF-MAJ-S-004 Adapting Video Basic to Image Rich 9.2                      O                      MMSCONF-AMJ-S-002                      MMSCONF-MAJ-S-005 Adapting Video Rich to Image Rich 9.2                      O                      MMSCONF-AMJ-S-002                      Table 28, Major content adaptation function requirements  B.2.5 Actions for Minor Content Adaptation  Item Function Reference Status Requirement MMSCONF-AMN-S-001 For any Image attachment in the MM: Reduction of image resolutions to 160*120 pixels 9.2                      M                                            MMSCONF-AMN-S-002 If MM size exceeds 30 kB: Reduction of message size to 30 kB using resolution and quality reduction techniques for image and speech, if possible 9.2                      M                                            MMSCONF-AMN-S-003 If MM size exceeds 100 kB: Reduction of message size to 100 kB using resolution, frame-rate and other quality reduction techniques for image, speech and video objects, if possible 9.2                      M                                            Table 29, Minor content adaptation action requirements   B.2.6 Actions for Major Content Adaptation  Item Function Reference Status Requirement MMSCONF-AMJ-S-001 For any SP-MIDI attachment in the MM: Removal of SP-MIDI attachment 9.2                      O                                            OMA-MMS-CONF-v1_2-20030929-C Page 47 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  MMSCONF-AMJ-S-002 For any video attachment in the MM: Converting one or more video frame(s) to any mandatory image format with related presentation, removing video part 9.2                      O                                            MMSCONF-AMJ-S-003 For any video attachment in the MM: Converting one or more video frame(s) to any mandatory image format,  removing video part, scaling QCIF resolution to 160*120 pixels 9.2                      O                                            MMSCONF-AMJ-S-004 For the purpose of size reduction, converting GIF89a (animated) to object(s) of any mandatory image format(s) with related presentation and GIF89a part is removed.  9.2                      O                                            Table 30, Major content adaptations requirements     OMA-MMS-CONF-v1_2-20030929-C Page 48 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Appendix C.   Change History (Informative) C.1 Approved Version History Reference Date Description n/a n/a No previous version within OMA C.2 Draft/Candidate Version1.2 History Document Identifier Date Section Description Candidate Version OMA-IOP-MMSCONF-v2_0_0-20020206-C 2 Feb 2002  Conversion from MMS IOP Group format to OMA document format. (Note: The orginal approval date in MMS IOP Group was left unchanged) OMA TP Approved Candidate version Draft Versions 29 April 2003 2, 3.2, 5, 8, 10, 6, 7, 11 Creation of v 3.0.0 Inclusion of document OMA-MAG-MMSG-2003-0088 to create the first (unapproved) draft v3.0.0 of this document.  2 May 2003 2.1, 3.2, 7.1 Inclusion of CRs and editorial changes The contents of these documents were included: OMA-MAG-MMSG-2003-0065R1 OMA-MAG-MMSG-2003-0068R1 OMA-MAG-MMSG-2003-0069R1 OMA-MAG-MMSG-2003-0078R1  9 May 2003 3.3, 6, 7, 11 Editorial changes Incorporated editorial changes that were proposed on the OMA-MMS mailing list on 2003-05-05 and 2003-05-06.  Editorial changes and text formatting to section 11  23 May 2003 6, 11, 12 Inclusion of CR and editorial changes The contents of this document was included : OMA-MAG-MMSG-2003-0107 Editorial changes to sections 6, 11 and 12   3 June 2003 cover sheet Change of document ID The document ID was changed from OMA-IOP-MMSCONF-3_0_0 to OMA-MMS-CONF-v1_2 as per decision from the Release Plannning Committee. See e-mail sent to the OMA-MMS mailing list dated 2003-06-02.  3 June 2003 2.1, 10.2.2, 10.2.5 Inclusion of CRs and editorial changes The contents of these documents were included: OMA-MAG-MMSG-2003-0049R2 OMA-MAG-MMSG-2003-0051R1 OMA-MAG-MMSG-2003-0061R2 Editorial changes to the format of the references in section 2.1.  5 June 2003 1, 2.1, 3.3, 11.2.3 Editorial changes Incorporated editorial changes that were proposed on the OMA-MMS mailing list on 2003-06-05.  5 June 2003 7.1.5 Section moved The contents of the section General Definitions was made more generic and moved to section 7.1.5. See e-mail on the OMA-MMS mailing list dated 2003-06-05.  6 June 2003 5.2, 8, 8.1.2.2 Inclusion of CR The contents of this document was included : OMA-MAG-MMSG-2003-0091R1  1 June 2003 Appendix A, 2, 6, 7, 9, 10, 11 Inclusion of CRs The contents of these document were included : OMA-MAG-MMSG-2003-0048R2 OMA-MAG-MMSG-2003-0057R6 OMA-MAG-MMSG-2003-0106R2 OMA-MAG-MMSG-2003-0135R1 OMA-MAG-MMSG-2003-0138R1 OMA-MMS-CONF-v1_2-20030929-C Page 49 (49)  2003 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document  .                         [OMA-Template-Spec-20030824]  Document Identifier Date Section Description Editor’s notes were removed throughout the document.  12 June 2003 Appendix B Update of SCR tables OMA-MAG-MMSG-2003-0132R4 was included to make the necessary changes to the SCR tables.  17 june 2003 cover sheet,  2.1, 7, 8, Appendix A, Appendix B Editorial changes Incorporated editorial changes that were proposed on the OMA-MMS mailing list on 2003-06-12. Minor editorial comments throughout the specification.  19 June 2003 Table 1, 11.1.2 Editorial changes Incorporation of changes as agreed upon in MMSG conference call on 19-June-2003  23 June 2003 8.1.2.2, 8.1.2.4, Appendix B Editorial changes Incorporated editorial changes that were proposed on the OMA-MMS mailing list on 2003-06-23.  27 June 2003 Table 1, 7.1.2, Appendix B Review comment At the MMSG telephone conference 20030626 it was identified that the vCalendar element must be included in the MM Content Classes. See OMA-MAG-MMSG-2003-0148  27 June 2003 all sections Review comments Incorporated review comments as proposed on the OMA-RELEASE mailing list on 2003-06-26.  27 June 2003 8.1.2.4, 3.3 Review comments Incorporated review comments as proposed on the OMA-MMS mailing list on 2003-06-26.  30 June 2003 Appendix B Review comment Incorporated updates to the SCR-tables as proposed on the OMA-MMS mailing list on 2003-06-26 Draft Version OMA-MMS-CONF-v1_2-20030630-D 30 June 2003  Draft for TP approval Candidate Version OMA-MMS-CONF-v1_2-20030716-C 16 July 2003  Status Changed to Candidate by TP. TP ref# OMA-TP-2003-0303                                                                              18                                                                             September                                                                             2003 7.1.1, Appendix B, 12 The contents of these documents was included: OMA-MAG-MMSG-2003-0157R1 OMA-MAG-MMSG-2003-0170R2 OMA-MAG-MMSG-2003-0172"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20030923-C/OMA-MMS-CTR-V1_2-20030916-C.pdf","file":"OMA-MMS-CTR-V1_2-20030916-C.pdf","status":"Candidate","version":"V1.2","date":"2003-09-16","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation WAP Forum defines a set of protocols in transport, security, transaction, session and application layers. For additional information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Multimedia Messaging Service (MMS) is a system application by which a WAP client is able to provide a messaging operation with a variety of media types. The service is described in terms of actions taken by the WAP MMS Client and its service partner, the MMS Proxy-Relay, a device that operates as a WAP Origin Server for this specialised service. This specification defines the operational flow of the MMS Protocol Data Units (PDUs) that transit between the MMS Client and the MMS Proxy-Relay.  The format of the specific PDUs is described in the “WAP MMS Encapsulation Protocol” [MMSENCAPS].  This document is part of the WAP MMS version 1.2 specification suite and complies with the requirements and service behaviours described in the technical specifications of the 3rd Generation Partnership Project (3GPP). These include the service aspects of MMS and the functional description of MMS which are contained in [TS23140].  For information about the MMS Architecture, the reader is advised to become familiar with the “WAP MMS Architecture Overview” [MMSARCH]."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20030923-C/OMA-MMS-ENC-V1_2-20030915-C.pdf","file":"OMA-MMS-ENC-V1_2-20030915-C.pdf","status":"Candidate","version":"V1.2","date":"2003-09-15","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation WAP Forum defines a set of protocols in transport, security, transaction, session, and application layers. For additional information on the WAP architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH].  Multimedia Messaging Service (MMS) is a system application by which a WAP client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the WAP MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as a WAP Origin Server for this specialised service. This document is part of the WAP MMS specification suite and complies with the requirements and service behaviour descriptions described in the technical specifications of the 3rd Generation Partnership Project (3GPP). These include the service aspects of MMS and the functional description of MMS, which are contained in [TS23140].  The transaction between MMS Client and MMS Proxy-Relay for the multimedia messaging service can be found in [MMSCTR]. This specification defines the message encapsulation, i.e., the message structure and encodings for the multimedia messaging service."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_2-20030923-C/OMA-MMS-v1_2-20030923-C.zip","file":"OMA-MMS-v1_2-20030923-C.zip","status":"Candidate","version":"V1.2","date":"2003-09-23","contentMediaType":"application/zip"}]}}