{"input":{"cteatedAt":"2021-02-18T12:25:39.358Z","url":"http://www.openmobilealliance.org/release/MMS/V1_3-20051027-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20051027-C/OMA-ERELD-MMS-V1_3-20051027-C.pdf","file":"OMA-ERELD-MMS-V1_3-20051027-C.pdf","status":"Candidate","version":"V1.3","date":"2005-10-27","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Multimedia Messaging Service according to OMA Release process and the Enabler Release specification baseline listed in section 5.  Multimedia Messaging Service (MMS) is a system application by which a client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the MMS Client and its service partner, the MMS Proxy-Relay, a device that operates as an Origin Server for this specialised service. [MMSARCH] provides the overall architectural picture of MMS and its protocol entities."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20051027-C/OMA-ERP-MMS-V1_3-20051027-C.zip","file":"OMA-ERP-MMS-V1_3-20051027-C.zip","status":"Candidate","version":"V1.3","date":"2005-10-27","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20051027-C/OMA-TS-MMS-CONF-V1_3-20051027-C.pdf","file":"OMA-TS-MMS-CONF-V1_3-20051027-C.pdf","status":"Candidate","version":"V1.3","date":"2005-10-27","contentMediaType":"application/pdf","description":"The scope of this document is in accordance with the charters of OMA IOP, OMA MMSG and OMA IOP MM Groups. The MMS conformance document defines the minimum set of requirements and guidelines for end-to-end interoperability of MMS handsets and servers. It further serves as a baseline for MMS interoperability testing. The test environment and the test cases that need to be created for MMS interoperability testing will be based on the definition from this document. Thus the scope of this document is to serve as the basis for MMS end-to-end interoperability testing. Another significant intent of this document is to be used as a basis for discussions between vendors, operators and value added service providers to explore any such requirements that might not be clearly defined in the specifications of 3GPP, 3GPP2 or OMA with respect to interoperability."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20051027-C/OMA-TS-MMS-TEMP-V1_3-20051027-C.pdf","file":"OMA-TS-MMS-TEMP-V1_3-20051027-C.pdf","status":"Candidate","version":"V1.3","date":"2005-10-27","contentMediaType":"application/pdf","description":"The  Open  Mobile  Alliance  (OMA)  specifications  are  the  result  of  an  ongoing  effort  to  define  mechanisms  for  enabling  industry-wide interoperable applications and services for deployment over wireless networks. To  continue  the  enhancement  and  evolution  of  the  Multimedia  Messaging  Service  OMA  is  developing  a  new  set  of  specifications  that  will  define  the  MMS  v1.3  release.  This  release  will  expand  and  build  upon  the  existing  MMS  v1.2  specifications.  The  functionality  of  the  MMS  1.3  release,  while  emphasizing  backward  compatibility  and  interoperability,  is  enhanced  to  improve the user experience with richer content capability, especially with regard to imaging and presentation features. The concept  of  Template  is  introduced  in  MMS  1.3  as  an  enabling  mechanism  to  facilitate  implementation  of  applications  utilizing many of the new features in the release. This  document  describes  the  MMS  Message  Template  profile  specification  and  its  conformance.    The  MMS  Message  Template  Profile  specifies  a  new  frame  work  to  enable  template  functionality  for  MMS.  This  new  functionality  provides  a  simple method for end users to compose rich MM and for service providers to widely distribute new services by leveraging the interoperability guaranteed by MMS 1.3."}]}}