{"input":{"cteatedAt":"2021-02-18T12:25:09.839Z","url":"http://www.openmobilealliance.org/release/MMS/V1_3-20040930-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20040930-C/OMA-RD_MMS-V1_3-20040930-C.pdf","file":"OMA-RD_MMS-V1_3-20040930-C.pdf","status":"Candidate","version":"V1.3","date":"2004-09-30","contentMediaType":"application/pdf","description":"The Open Mobile Alliance (OMA) specifications are the result of an ongoing effort to define mechanisms for enabling industry-wide interoperable applications and services for deployment over wireless networks. To continue the enhancement and evolution of the Multimedia Messaging Service OMA is developing a new set of specifications that will define the MMS v1.3 release. This release will expand and build upon the existing MMS v1.2 specifications.  The scope of work for the MMS 1.3 release can be briefly outlined as: 1. Guaranteeing the uninterrupted evolution of the MMS Enabler Release v1.2 into MMS Enabler Release v1.3 based on the requirements  (stage  1)  and  functional  service  behaviour  description  (stage  2)  specified  by  3GPP.  V1.3  shall  be  based  on  3GPP  MMS  Rel-6  and  efforts  will  be  made  to  consolidate  and  collaborate  with  other  relevant  MMS  standardisation  fora,  in  particular with 3GPP2. 2. Enabling  the  MMSG  to  fulfill  its  duties  with  respect  to  maintenance  of  previous  MMS  release  packages  that  have  been  developed either in the WAP Forum (MMS v1.0) or inside OMA (OMA MMS Enabler Releases v1.1, v1.2 and later). 3. Investigating and developing mechanisms and frameworks for extending MMS in a manner that maintains compatibility with existing MMS implementations.  4. Investigating and developing service aspects for MMS that include:   Functionalities for Content-to-Person use  Functionalities for Person-to-Person use  Functionalities for Person-to-Service use  Improvements to contents/presentation language  Need and, if required, solutions for support of larger pictures in MMS  Need and, if required, solutions for simplifying the authoring/downloading/distribution of templates in MMS    The release realizes end-to-end interoperability as requested in 3GPP requirements and functional behavior descriptions ([TS22140] and [TS23140]) and relevant 3GPP2 documents ([SR0064] and [XS0016-200])"}]}}