{"input":{"cteatedAt":"2021-02-18T12:25:44.313Z","url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-AD-MMS-V1_3-20080128-C.pdf","file":"OMA-AD-MMS-V1_3-20080128-C.pdf","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work, provided by the WAP Forum originally and succeeded by the Open Mobile AllianceTM (OMA), to define an industry-wide specification for developing applications that operate over wireless communication networks.  The scope for the OMA is to define a set of specifications to be used by service applications.  The wireless market is growing very quickly, and reaching new customers and services.  To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation, the OMA defines a set of protocols in transport, security, transaction, session and application layers.  For additional information on the WAP/OMA architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. Multimedia Messaging Service (MMS) is a system application by which a client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as a WAP Origin Server for this specialised service.  Additional service aspects are supported by the MMS Server as well as other messaging servers, such as an email server and wireless messaging systems (e.g. SMSC).  This specification defines application-level protocol activities that take place to realise the MMS service within the OMA environment. This document is part of the OMA MMS version 1.3 specification suite for the client transaction framework and complies with the requirements and service behaviours described in the technical specifications of the 3rd Generation Partnership Project (3GPP) and the 3rd Generation Partnership Project 2 (3GPP2). These include the service aspects of MMS and the functional description of MMS which are contained in [TS22140] and [TS23140] from 3GPP, and [SR0064] and [XS0016200] from 3GPP2."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-ERELD-MMS-V1_3-20080128-C.pdf","file":"OMA-ERELD-MMS-V1_3-20080128-C.pdf","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Multimedia Messaging Service according to OMA Release process and the Enabler Release specification baseline listed in section 0.  Multimedia Messaging Service (MMS) is a system application by which a client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the MMS Client and its service partner, the MMS Proxy-Relay, a device that operates as an Origin Server for this specialised service. [MMSARCH] provides the overall architectural picture of MMS and its protocol entities."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-ERP-MMS-V1_3-20080128-C.zip","file":"OMA-ERP-MMS-V1_3-20080128-C.zip","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-RD-MMS-V1_3-20050519-C.pdf","file":"OMA-RD-MMS-V1_3-20050519-C.pdf","status":"Candidate","version":"V1.3","date":"2005-05-19","contentMediaType":"application/pdf","description":"The Open Mobile Alliance (OMA) specifications are the result of an ongoing effort to define mechanisms for enabling industry-wide interoperable applications and services for deployment over wireless networks. To continue the enhancement and evolution of the Multimedia Messaging Service OMA is developing a new set of specifications that will define the MMS v1.3 release. This release will expand and build upon the existing MMS v1.2 specifications.  The scope of work for the MMS 1.3 release can be briefly outlined as: 1. Guaranteeing the uninterrupted evolution of the MMS Enabler Release v1.2 into MMS Enabler Release v1.3 based on the requirements (stage 1) and functional service behaviour description (stage 2) specified by 3GPP. V1.3 shall be based on 3GPP MMS Rel-6 and efforts will be made to consolidate and collaborate with other relevant MMS standardisation fora, in particular with 3GPP2. 2. Enabling the MMSG to fulfill its duties with respect to maintenance of previous MMS release packages that have been developed either in the WAP Forum (MMS v1.0) or inside OMA (OMA MMS Enabler Releases v1.1, v1.2 and later). 3. Investigating and developing mechanisms and frameworks for extending MMS in a manner that maintains compatibility with existing MMS implementations. 4. Investigating and developing service aspects for MMS that include:  \u0001Functionalities for Content-to-Person use \u0001Functionalities for Person-to-Person use \u0001Functionalities for Person-to-Service use \u0001Improvements to contents/presentation language \u0001Need and, if required, solutions for support of larger pictures in MMS \u0001Need and, if required, solutions for simplifying the authoring/downloading/distribution of templates in MMS  The release realizes end-to-end interoperability as requested in 3GPP requirements and functional behavior descriptions ([TS22140] and [TS23140]) and relevant 3GPP2 documents ([SR0064] and [XS0016-200])"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-RD-MMS-V1_3-20080128-C.pdf","file":"OMA-RD-MMS-V1_3-20080128-C.pdf","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"application/pdf","description":"The Open Mobile Alliance (OMA) specifications are the result of an ongoing effort to define mechanisms for enabling industry-wide interoperable applications and services for deployment over wireless networks. To continue the enhancement and evolution of the Multimedia Messaging Service OMA is developing a new set of specifications that will define the MMS v1.3 release. This release will expand and build upon the existing MMS v1.2 specifications.  The scope of work for the MMS 1.3 release can be briefly outlined as: 1. Guaranteeing the uninterrupted evolution of the MMS Enabler Release v1.2 into MMS Enabler Release v1.3 based on the requirements (stage 1) and functional service behaviour description (stage 2) specified by 3GPP. V1.3 shall be based on 3GPP MMS Rel-6 and efforts will be made to consolidate and collaborate with other relevant MMS standardisation fora, in particular with 3GPP2. 2. Enabling the MMSG to fulfill its duties with respect to maintenance of previous MMS release packages that have been developed either in the WAP Forum (MMS v1.0) or inside OMA (OMA MMS Enabler Releases v1.1, v1.2 and later). 3. Investigating and developing mechanisms and frameworks for extending MMS in a manner that maintains compatibility with existing MMS implementations. 4. Investigating and developing service aspects for MMS that include:  \u0001Functionalities for Content-to-Person use \u0001Functionalities for Person-to-Person use \u0001Functionalities for Person-to-Service use \u0001Improvements to contents/presentation language \u0001Need and, if required, solutions for support of larger pictures in MMS \u0001Need and, if required, solutions for simplifying the authoring/downloading/distribution of templates in MMS  The release realizes end-to-end interoperability as requested in 3GPP requirements and functional behavior descriptions ([TS22140] and [TS23140]) and relevant 3GPP2 documents ([SR0064] and [XS0016-200])"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-SUP-AC_ap0005_mms-V1_3-20080128-C.txt","file":"OMA-SUP-AC_ap0005_mms-V1_3-20080128-C.txt","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-SUP-DTD_mms_mtd-V1_3-20080128-C.txt","file":"OMA-SUP-DTD_mms_mtd-V1_3-20080128-C.txt","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-SUP-MO_mms-V1_3-20080128-C.txt","file":"OMA-SUP-MO_mms-V1_3-20080128-C.txt","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-SUP-RDF_ccppschema_mms-V1_3-20080128-C.txt","file":"OMA-SUP-RDF_ccppschema_mms-V1_3-20080128-C.txt","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-SUP-XSD_mms_mtd-V1_3-20080128-C.txt","file":"OMA-SUP-XSD_mms_mtd-V1_3-20080128-C.txt","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-TS-MMS-CONF-V1_3-20080128-C.pdf","file":"OMA-TS-MMS-CONF-V1_3-20080128-C.pdf","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"application/pdf","description":"The scope of this document is in accordance with the charters of OMA IOP, OMA MMSG and OMA IOP MM Groups. The MMS conformance document defines the minimum set of requirements and guidelines for end-to-end interoperability of MMS handsets and servers. It further serves as a baseline for MMS interoperability testing. The test environment and the test cases that need to be created for MMS interoperability testing will be based on the definition from this document. Thus the scope of this document is to serve as the basis for MMS end-to-end interoperability testing. Another significant intent of this document is to be used as a basis for discussions between vendors, operators and value added service providers to explore any such requirements that might not be clearly defined in the specifications of 3GPP, 3GPP2 or OMA with respect to interoperability."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-TS-MMS-CTR-V1_3-20080128-C.pdf","file":"OMA-TS-MMS-CTR-V1_3-20080128-C.pdf","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work, provided by the WAP Forum originally and succeeded by the Open Mobile AllianceTM (OMA), to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the OMA is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation OMA defines a set of protocols in transport, security, transaction, session and application layers. For additional information on the WAP/OMA architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. Multimedia Messaging Service (MMS) is a system application by which a WAP client is able to provide a messaging operation with a variety of media types. The service is described in terms of actions taken by the WAP MMS Client and its service partner, the MMS Proxy-Relay, a device that operates as a WAP Origin Server for this specialised service. This specification defines the operational flow of the MMS Protocol Data Units (PDUs) that transit between the MMS Client and the MMS Proxy-Relay.  The format of the specific PDUs is described in the “MMS Encapsulation Protocol”[MMSENCAPS]. This document is part of the OMA MMS version 1.3 specification suite and complies with the requirements and service behaviours described in the technical specifications of the 3rd Generation Partnership Project (3GPP) and the 3rd Generation partnership Project 2 (3GPP2). These include the service aspects of MMS and the functional description of MMS which are contained in [TS23140] for 3GPP and [XS0016200] for 3GPP2. For information about the MMS Architecture, the reader is advised to become familiar with the “MMS Architecture”[MMSARCH]."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-TS-MMS-ENC-V1_3-20080128-C.pdf","file":"OMA-TS-MMS-ENC-V1_3-20080128-C.pdf","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work, provided by the WAP Forum originally and succeeded by the Open Mobile AllianceTM (OMA), to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the OMA is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation and fast/flexible service creation OMA defines a set of protocols in transport, security, transaction, session, and application layers. For additional information on the WAP/OMA architecture, please refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. Multimedia Messaging Service (MMS) is a system application by which a WAP client is able to provide a messaging operation with a variety of media types.  The service is described in terms of actions taken by the WAP MMS Client and its service partner, the MMS Proxy-Relay, a device which operates as a WAP Origin Server for this specialised service. This document is part of the OMA MMS specification suite and complies with the requirements and service behaviour descriptions described in the technical specifications of the 3rdGeneration Partnership Project (3GPP) and the 3rdGeneration Partnership Project 2 (3GPP2). These include the service aspects of MMS and the functional description of MMS, which are contained in [TS23140] for 3GPP and [XS0016200] for 3GPP2. The transaction between MMS Client and MMS Proxy-Relay for the multimedia messaging service can be found in [MMSCTR]. This specification defines the message encapsulation, i.e., the message structure and encodings for the multimedia messaging service."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-TS-MMS-TEMP-V1_3-20080128-C.pdf","file":"OMA-TS-MMS-TEMP-V1_3-20080128-C.pdf","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"application/pdf","description":"The  Open  Mobile  Alliance  (OMA)  specifications  are  the  result  of  an  ongoing  effort  to  define  mechanisms  for  enabling  industry-wide interoperable applications and services for deployment over wireless networks. To  continue  the  enhancement  and  evolution  of  the  Multimedia  Messaging  Service  OMA  is  developing  a  new  set  of  specifications  that  will  define  the  MMS  v1.3  release.  This  release  will  expand  and  build  upon  the  existing  MMS  v1.2  specifications.  The  functionality  of  the  MMS  1.3  release,  while  emphasizing  backward  compatibility  and  interoperability,  is  enhanced  to  improve the user experience with richer content capability, especially with regard to imaging and presentation features. The concept  of  Template  is  introduced  in  MMS  1.3  as  an  enabling  mechanism  to  facilitate  implementation  of  applications  utilizing many of the new features in the release. This  document  describes  the  MMS  Message  Template  profile  specification  and  its  conformance.    The  MMS  Message  Template  Profile  specifies  a  new  frame  work  to  enable  template  functionality  for  MMS.  This  new  functionality  provides  a  simple method for end users to compose rich MM and for service providers to widely distribute new services by leveraging the interoperability guaranteed by MMS 1.3."},{"url":"http://www.openmobilealliance.org/release/MMS/V1_3-20080128-C/OMA-TS-MMS_MO-V1_3-20080128-C.pdf","file":"OMA-TS-MMS_MO-V1_3-20080128-C.pdf","status":"Candidate","version":"V1.3","date":"2008-01-28","contentMediaType":"application/pdf","description":"This document defines the OMA MMS Management Object (MO)."}]}}