{"input":{"cteatedAt":"2021-02-17T21:33:17.710Z","url":"http://www.openmobilealliance.org/release/Billing/V1-0-20021216-H/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Billing/V1-0-20021216-H/OMA-ERELD-WBF-v1_0-20021216-H.pdf","file":"OMA-ERELD-WBF-v1_0-20021216-H.pdf","status":"Historic","version":"V1.0","date":"2002-12-16","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definiton of Billing according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The scope of Billing includes the ability to generate Charging Detail Records (CDR) for transactions taking place on either the proxy or the content server. Records can be generated for pulling content from a content server and for events related to push services. These recordings (charging) can be event based or, in the case of pulling content, can also be session based. In case of charging on the proxy it is possible for the content server to forward pricing details to the proxy for inclusion in the charging recording.  The charging detail records are send to the billing environment (e.g. mediation system) for further processing.  The latter is out of scope for this enabler release though."},{"url":"http://www.openmobilealliance.org/release/Billing/V1-0-20021216-H/OMA-ERP-WBF-V1_0-20021216-H.zip","file":"OMA-ERP-WBF-V1_0-20021216-H.zip","status":"Historic","version":"V1.0","date":"2002-12-16","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/Billing/V1-0-20021216-H/OMA-WBF-v1_0-20021121-H.pdf","file":"OMA-WBF-v1_0-20021121-H.pdf","status":"Historic","version":"V1.0","date":"2002-11-21","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP), as part of Open Mobile Alliance (OMA), is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for OMA is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAPArch].  The WAP Billing Framework specification defines the recording of service usage for charging purposes and its interfaces to the surrounding logical entities in the WAP Billing Framework architecture. It outlines possibilities to measure service usage by a specifically introduced concept called chargeable operation.The recording can be performed in realtime (Online Charging) or non realtime (Offline Charging). Note The realtime process is not covered in this release of the specification. Bills or direct payments towards for example credit cards or prepaid accounts may be issued as a result of recording service usage. However the WAP Billing Framework does not deal with the generation and presentation of bills or the actual payment and it does not specify specific Billing System features. For example an application performing charging against a pre-paid application is just as likely as one performing against a monthly bill or credit card. It is the goal to define a framework that is flexible and extensible and that focuses on short time to market for deployment of a variety of billing models specifically based on measured service usage."}]}}