{"input":{"cteatedAt":"2021-02-18T12:54:44.621Z","url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/OMA-ERELD-Push-V2_1-20110405-A.pdf","file":"OMA-ERELD-Push-V2_1-20110405-A.pdf","status":"Approved","version":"V2.1","date":"2011-04-05","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Push according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The Push enabler release defines the application level protocols, syntax and behaviours of client and server for the fulfilment of push services. Push service is defined as communication of content toward a client without an explicit request."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/OMA-ERP-Push-V2_1-20110405-A.zip","file":"OMA-ERP-Push-V2_1-20110405-A.zip","status":"Approved","version":"V2.1","date":"2011-04-05","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/OMA-SUP-DTD_pap-V2_1-20110405-A.txt","file":"OMA-SUP-DTD_pap-V2_1-20110405-A.txt","status":"Approved","version":"V2.1","date":"2011-04-05","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/OMA-WAP-TS-PAP-V2_1-20110405-A.pdf","file":"OMA-WAP-TS-PAP-V2_1-20110405-A.pdf","status":"Approved","version":"V2.1","date":"2011-04-05","contentMediaType":"application/pdf","description":"This  specification  defines  the  Push  Access  Protocol  (PAP).  The  PAP  is  intended  for  use  in  delivering  content  from  Push Initiators  to  push  proxy  gateways  for  subsequent  delivery  to  narrow  band  devices,  including  cellular  phones  and  pagers. Example messages include news, stock quotes, weather, traffic reports, and notification of events such as email arrival. With push functionality, users are able to get information without having to request that information. In many cases it is important for the user to get the information as soon as it is available.  The push access protocol is not intended for use over the air."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/OMA-WAP-TS-PPGService-V2_1-20110405-A.pdf","file":"OMA-WAP-TS-PPGService-V2_1-20110405-A.pdf","status":"Approved","version":"V2.1","date":"2011-04-05","contentMediaType":"application/pdf","description":"A part of the WAP effort is the specification of a push architecture, illustrated in figure 1, which allows content to be pushed from wired networks to push compliant mobile devices. The scope of this document is the specification of the Push Proxy Gateway, a gateway intended to provide push connectivity between wired and wireless networks. WAP ClientPush InitiatorPush Proxy GatewayPushAccessProtocolPushOver-the-AirProtocol Figure 1. Push Architecture"},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/OMA-WAP-TS-PushOTA-V2_1-20110405-A.pdf","file":"OMA-WAP-TS-PushOTA-V2_1-20110405-A.pdf","status":"Approved","version":"V2.1","date":"2011-04-05","contentMediaType":"application/pdf","description":"This specification defines the Over the Air protocol for delivery of content to a mobile terminal from a Push Proxy Gateway (PPG), referred to as Push OTA protocol. The protocol specified in this document is an application layer protocol that can run on top of the WSP protocol [WSP], or on top of HTTP 1.1 [RFC2616]. The Push OTA protocol specified in this document addresses the following considerations: • means for server initiated asynchronous push. • means for application addressing. • means for exchange of push control information over the air. • means for bearer selection and control. • means for authentication."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/WAP-167-ServiceInd-20010731-a.pdf","file":"WAP-167-ServiceInd-20010731-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAP]. This  specification  defines  the  Service  Indication  (SI)  content  type,  which  is  an  application  of  the  Extensible  Markup Language (XML) 1.0 [XML]. The content type provides a means to notify a client that an external asynchronous event has occurred and indicate a service that can be loaded in order to react to that event. This is accomplished by sending a message to the client that informs the end-user  about the  event,  and  a URI from where the  appropriate service can be loaded. For example, the message could read “You have new voice mails”, and the URI points to the voice mail service.  The  SI  content type  does  also  allow the level of  user-intrusiveness  to  be  controlled,  deletion  of  SIs stored  on  a  client (both manually and automatically by using the concept of expiration), and replacement of stored SIs. A mechanism to resolve  race  conditions  is  also  specified.  Finally,  WBXML  [WBXML]  tokens  are  defined  to  allow  for  efficient over-the-air transmission."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/WAP-167_103-ServiceInd-20010926-a.pdf","file":"WAP-167_103-ServiceInd-20010926-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document provides changes and corrections to the following document files: - WAP-167-ServiceInd-20010731-a It includes changes from the following change requests: - CR-WAP-167-20010907-ERICSSON-1 2.  Notation In the subsections describing the changes new text is underlined. Removed text has strikethrough marks. The presented text is copied from the specification. Text that is not presented is not affected at all. The change descriptions may also include editor’s notes similar to the one below. The notes are not part of the actual changes and must not be included in the changed text. Editor's note: Framed notes like these only clarify where and how the changes shall be applied."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/WAP-168-ServiceLoad-20010731-a.pdf","file":"WAP-168-ServiceLoad-20010731-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAP].  It is not always suitable to push content that is executed or rendered (the term “executed” is used throughout this document to refer either to “executed” or “rendered”) directly upon reception to a mobile device, especially if the client is busy with other activities such as executing another service. This is due to the fact that memory and/or processing constraints found in many mobile devices are such that neither storing nor processing content in such a situation is feasible.  Another disadvantage of pushing content directly to a mobile client is that this may interfere with an executing service that is utilising the bearer used for push, which will deteriorate the end-user experience of that service.   In order to circumvent these problems, the Service Loading (SL) content type has been defined. The content type provides a means to convey a URI to a user agent in a mobile client. The client itself automatically loads the content indicated by that URI and executes it in the addressed user agent without user intervention when appropriate. Thus, the end-user will experience the service indicated by the URI as if it was pushed to the client and executed. By basically conveying only the URI of the service to the client the over-the-air message will be small. Hence, very modest requirements are placed on the bearer and on the client’s ability to receive and store an SL if it is busy with other activities. The disadvantage of this approach is that the number of over-the-air messages and round-trips needed to deliver the service will increase.   Instead of executing the service, SL provides a means to instruct the client to pre-emptively cache the content indicated by the URI so it becomes readily available to the user agent(s) in the client. It is also possible to control whether the loading of the service may be carried out in a user-intrusive manner or not.   The SL content type is an application of the Extensible Markup Language (XML) 1.0 [XML]. WBXML [WBXML] tokens are defined to allow for efficient over-the-air transmission."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/WAP-168_103-ServiceLoad-20010816-a.pdf","file":"WAP-168_103-ServiceLoad-20010816-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document provides changes and corrections to the following document files: - WAP-168-ServiceLoad-20010731-a 2.  Notation In the subsections describing the changes new text is underlined. Removed text has strikethrough marks. The presented text is copied from the specification. Text that is not presented is not affected at all. The change descriptions may also include editor’s notes similar to the one below. The notes are not part of the actual changes and must not be included in the changed text. Editor's note: Framed notes like these only clarify where and how the changes shall be applied."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/WAP-175-CacheOp-20010731-a.pdf","file":"WAP-175-CacheOp-20010731-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. This  specification  defines  a  content  type,  the cache  operation,  which  allows  applications  to  invalidate  the  content cached in the user agent. It addresses the class of situations where the expiration time of the content to be cached cannot be predicted."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/WAP-175_102-CacheOp-20010816-a.pdf","file":"WAP-175_102-CacheOp-20010816-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document provides changes and corrections to the following document files: - WAP-175-CacheOp-20010731-a 2.  Notation In the subsections describing the changes new text is underlined. Removed text has strikethrough marks. The presented text is copied from the specification. Text that is not presented is not affected at all. The change descriptions may also include editor’s notes similar to the one below. The notes are not part of the actual changes and must not be included in the changed text. Editor's note: Framed notes like these only clarify where and how the changes shall be applied."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/WAP-250-PushArchOverview-20010703-a.pdf","file":"WAP-250-PushArchOverview-20010703-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAPArch]. This document outlines the WAP Push specifications, which together specify a service to push content to mobile devices via the WAP architecture."},{"url":"http://www.openmobilealliance.org/release/Push/V2_1-20110405-A/WAP-251-PushMessage-20010322-a.pdf","file":"WAP-251-PushMessage-20010322-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This section is informative. Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAP].  This specification defines the push message, which is used by a WAP push application to deliver the content to a WAP client. In particular, it defines the following: · General format of the push message · Headers of the push message · Body of the push message · Proxy rules for header handling   2. References 2.1. Normative references  [CREQ] “Specification of WAP Conformance Requirements”, WAP-221-CREQ-20010425-a, WAP Forum Ltd. URL: http://www.wapforum.org/ [HTTP] “Hypertext Transfer Protocol – HTTP/1.1”, R. Fielding, et al. June 1999 URL: http://www.ietf.org/rfc/rfc2616.txt/ [PushOTA] “Push OTA Specification”, WAP-235-PushOTA-20010308-a, WAP Forum.  URL: http://www.wapforum.org/ [PushPAP] “Push Access Protocol Specification”. WAP Forum. WAP-247-PAP-20010429-a. URL: http://www.wapforum.org/ [RFC822] “Standard for the Format of ARPA Internet Text Messages”,  D. Crocker, August 1982, URL: http://www.ietf.org/rfc/rfc822/ [RFC2234] “Augmented BNF for Syntax Specification: ABNF”, D. Crocker, et al., November 1997,  URL: http://www.ietf.org/rfc/rfc2234.txt/ [RFC2396] “Uniform Resource Identifiers (URI): Generic Syntax”, T. Berners-Lee et al., August 1998,  URL: http://www.ietf.org/rfc/rfc2396.txt/ [WAPCache] “WAP Caching Model”, WAP-120-WAPCachingMod-19990211-a, WAP Forum.  URL: http://www.wapforum.org/ [WINA] “WAP Interim Naming Authority”, WAP Forum, URL:http://www.wapforum.org/wina/"}]}}