{"input":{"cteatedAt":"2021-02-18T12:55:11.073Z","url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-AD-Push-V2_2-20090609-C.pdf","file":"OMA-AD-Push-V2_2-20090609-C.pdf","status":"Candidate","version":"V2.2","date":"2009-06-09","contentMediaType":"application/pdf","description":"The Open Mobile Alliance (OMA) continues the work of the WAP Forum in developing industry-wide specifications for developing enablers and services that operate over wireless communication networks. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, OMA defines a set of enablers in transport, session and application layers.  This document outlines the Push Architecture and related specifications, which together specify an enabler for a service to push content to mobile devices.  •Push Architectural Overview The purpose of this document is to serve as a starting point for anybody wanting to know more about the Push technology, before taking on the other specifications. •Push Access Protocol Specification This document specifies the protocol with which a Push Initiator communicates with the PPG. See section 6 for a brief description. •Push Proxy Gateway Service Specification This document specifies the Push Proxy Gateway functionality, and how it interacts with the Push Access Protocol and the Push Over-The-Air protocol. See section 5.3.1 for a brief description. •Push OTA Protocol Specification This document specifies the protocol with which a PPG communicates with a push-capable client. See section 7 for a brief description. •Push Client-Application Interface Specificiation This document specifies the optional interface between a Push Client and applications, via which the application can register for push services and receive push content. •Push Message Specification This document specifies end-to-end properties of a push message. •Service Indication Specification This document specifies a content type used for notifying users they have new information waiting on a server. See section 8 for a brief description.  •Service Loading Specification This document specifies a content type that instructs the client to automatically load a URI. See section 8 for a brief description. •Cache Operation Specification This document specifies a content type that instructs the client to invalidate cached resources. See section 8 for a brief description."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-ERELD-Push-V2_2-20090609-C.pdf","file":"OMA-ERELD-Push-V2_2-20090609-C.pdf","status":"Candidate","version":"V2.2","date":"2009-06-09","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Push according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The Push enabler release defines the application level protocols, syntax and behaviours of client and server for the fulfilment of push services. Push service is defined as communication of content toward a client without an explicit request."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-ERP-Push-V2_2-20090609-C.zip","file":"OMA-ERP-Push-V2_2-20090609-C.zip","status":"Candidate","version":"V2.2","date":"2009-06-09","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-RD-PushSecurity-V1_0-20050125-C.pdf","file":"OMA-RD-PushSecurity-V1_0-20050125-C.pdf","status":"Candidate","version":"V1.0","date":"2005-01-25","contentMediaType":"application/pdf","description":"The scope of this document is to identify the use cases pertinent to the security issues of WAP Push and then define the security requirements for the identified use cases."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-SUP-DTD_co-V1_0-20051122-C.txt","file":"OMA-SUP-DTD_co-V1_0-20051122-C.txt","status":"Candidate","version":"V1.0","date":"2005-11-22","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-SUP-DTD_pap-V2_2-20090609-C.txt","file":"OMA-SUP-DTD_pap-V2_2-20090609-C.txt","status":"Candidate","version":"V2.2","date":"2009-06-09","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-SUP-DTD_si-V1_0-20051122-C.txt","file":"OMA-SUP-DTD_si-V1_0-20051122-C.txt","status":"Candidate","version":"V1.0","date":"2005-11-22","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-SUP-DTD_sl-V1_0-20051122-C.txt","file":"OMA-SUP-DTD_sl-V1_0-20051122-C.txt","status":"Candidate","version":"V1.0","date":"2005-11-22","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-SUP-MO_Push_DDF-V1_0-20071002-C.txt","file":"OMA-SUP-MO_Push_DDF-V1_0-20071002-C.txt","status":"Candidate","version":"V1.0","date":"2007-10-02","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-TS-PAP-V2_2-20090609-C.pdf","file":"OMA-TS-PAP-V2_2-20090609-C.pdf","status":"Candidate","version":"V2.2","date":"2009-06-09","contentMediaType":"application/pdf","description":"This  specification  defines  the  Push  Access  Protocol  (PAP).  The  PAP  is  intended  for  use  in  delivering  content  from  Push  Initiators to push proxy gateways for subsequent delivery to devices, including laptops, cellular phones and pagers. Example messages  include  news,  stock  quotes,  weather,  traffic  reports,  and  notification  of  events  such  as  email  arrival.  With  push  functionality, users are able to get information without having to request that information. In many cases it is important for the user to get the information as soon as it is available.  The push access protocol is not intended for use over the air."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-TS-PPGService-V2_2-20090609-C.pdf","file":"OMA-TS-PPGService-V2_2-20090609-C.pdf","status":"Candidate","version":"V2.2","date":"2009-06-09","contentMediaType":"application/pdf","description":"A part of the WAP effort is the specification of a push architecture, illustrated in figure 1, which allows content to be pushed from wired networks to push compliant mobile devices. The scope of this document is the specification of the Push Proxy Gateway, a gateway intended to provide push connectivity between wired and wireless networks. WAP ClientPush InitiatorPush Proxy GatewayPushAccessProtocolPushOver-the-AirProtocolFigure 1 - Push Architecture"},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-TS-Push_Message-V2_2-20090609-C.pdf","file":"OMA-TS-Push_Message-V2_2-20090609-C.pdf","status":"Candidate","version":"V2.2","date":"2009-06-09","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAP].  This specification defines the push message, which is used by a WAP push application to deliver the content to a WAP client. In particular, it defines the following: ·General format of the push message ·Headers of the push message ·Body of the push message ·Proxy rules for header handling"},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-TS-Push_MO-V1_0-20071002-C.pdf","file":"OMA-TS-Push_MO-V1_0-20071002-C.pdf","status":"Candidate","version":"V1.0","date":"2007-10-02","contentMediaType":"application/pdf","description":"This document defines the OMA Push Management Object that manages the push whitelist."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-TS-PushCAI-V1_0-20090609-C.pdf","file":"OMA-TS-PushCAI-V1_0-20090609-C.pdf","status":"Candidate","version":"V1.0","date":"2009-06-09","contentMediaType":"application/pdf","description":"This  specification  defines  the  Push  Application  Interface  through  which  Push  Applications  can  access  OMA  Push  enabler  services. The interface specified in this document defines functions and data formats supporting: •registration of Push Applications with an OMA Push Client •the subsequent delivery of Push events to the Push Application"},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/OMA-TS-PushOTA-V2_2-2009609-C.pdf","file":"OMA-TS-PushOTA-V2_2-2009609-C.pdf","status":"Candidate","version":"V2.2","date":"","contentMediaType":"application/pdf","description":"This specification defines the Over the Air protocol for delivery of content to a terminal from a Push Proxy Gateway (PPG), referred to as Push OTA protocol. The protocol specified in this document is an application layer protocol that can run either: on top of the WSP protocol [WSP], on top of HTTP 1.1 [RFC2616], or on top of SIP [SIPPush]. The Push OTA protocol specified in this document addresses the following considerations: •means for server initiated asynchronous push. •means for application addressing. •means for exchange of push control information. •means for bearer selection and control. •means for authentication."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/WAP-167-ServiceInd-20010731-a.pdf","file":"WAP-167-ServiceInd-20010731-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAP]. This  specification  defines  the  Service  Indication  (SI)  content  type,  which  is  an  application  of  the  Extensible  Markup  Language (XML) 1.0 [XML]. The content type provides a means to notify a client that an external asynchronous event has occurred and indicate a service that can be loaded in order to react to that event. This is accomplished by sending a message to the client that informs the end-user about the event, and a URI from where the appropriate service can be loaded. For example, the message could read “You have new voice mails”, and the URI points to the voice mail service.  The  SI  content  type  does  also  allow  the  level  of  user-intrusiveness  to  be  controlled,  deletion  of  SIs  stored  on  a  client  (both manually and automatically by using the concept of expiration), and replacement of stored SIs. A mechanism to resolve  race  conditions  is  also  specified.  Finally,  WBXML  [WBXML]  tokens  are  defined  to  allow  for  efficient  over-the-air transmission."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/WAP-167_103-ServiceInd-20010926-a.pdf","file":"WAP-167_103-ServiceInd-20010926-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document provides changes and corrections to the following document files: -WAP-167-ServiceInd-20010731-a It includes changes from the following change requests: -CR-WAP-167-20010907-ERICSSON-1 2.  Notation  In the subsections describing the changes new text is underlined. Removed text has strikethroughmarks. The presented text is copied from the specification. Text that is not presented is not affected at all. The change descriptions may also include editor’s notes similar to the one below. The notes are not part of the actual changes and must not be included in the changed text. Editor's note: Framed notes like these only clarify where and how the changes shall be applied."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/WAP-168-ServiceLoad-20010731-a.pdf","file":"WAP-168-ServiceLoad-20010731-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAP].  It is not always suitable to push content that is executed or rendered (the term “executed” is used throughout this document to refer either to “executed” or “rendered”) directly upon reception to a mobile device, especially if the client is busy with other activities such as executing another service. This is due to the fact that memory and/or processing constraints found in many mobile devices are such that neither storing nor processing content in such a situation is feasible.  Another disadvantage of pushing content directly to a mobile client is that this may interfere with an executing service that is utilising the bearer used for push, which will deteriorate the end-user experience of that service.   In order to circumvent these problems, the Service Loading (SL) content type has been defined. The content type provides a means to convey a URI to a user agent in a mobile client. The client itself automatically loads the content indicated by that URI and executes it in the addressed user agent without user intervention when appropriate. Thus, the end-user will experience the service indicated by the URI as if it was pushed to the client and executed. By basically conveying only the URI of the service to the client the over-the-air message will be small. Hence, very modest requirements are placed on the bearer and on the client’s ability to receive and store an SL if it is busy with other activities. The disadvantage of this approach is that the number of over-the-air messages and round-trips needed to deliver the service will increase.   Instead of executing the service, SL provides a means to instruct the client to pre-emptively cache the content indicated by the URI so it becomes readily available to the user agent(s) in the client. It is also possible to control whether the loading of the service may be carried out in a user-intrusive manner or not.   The SL content type is an application of the Extensible Markup Language (XML) 1.0 [XML]. WBXML [WBXML] tokens are defined to allow for efficient over-the-air transmission."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/WAP-168_103-ServiceLoad-20010816-a.pdf","file":"WAP-168_103-ServiceLoad-20010816-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document provides changes and corrections to the following document files: -WAP-168-ServiceLoad-20010731-a 2.  Notation  In the subsections describing the changes new text is underlined. Removed text has strikethroughmarks. The presented text is copied from the specification. Text that is not presented is not affected at all. The change descriptions may also include editor’s notes similar to the one below. The notes are not part of the actual changes and must not be included in the changed text. Editor's note: Framed notes like these only clarify where and how the changes shall be applied."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/WAP-175-CacheOp-20010731-a.pdf","file":"WAP-175-CacheOp-20010731-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. This  specification  defines  a  content  type,  the  cache  operation,  which  allows  applications  to  invalidate  the  content  cached in the user agent. It addresses the class of situations where the expiration time of the content to be cached cannot be predicted."},{"url":"http://www.openmobilealliance.org/release/Push/V2_2-20090609-C/WAP-175_102-CacheOp-20010816-a.pdf","file":"WAP-175_102-CacheOp-20010816-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document provides changes and corrections to the following document files: -WAP-175-CacheOp-20010731-a 2.  Notation  In the subsections describing the changes new text is underlined. Removed text has strikethroughmarks. The presented text is copied from the specification. Text that is not presented is not affected at all. The change descriptions may also include editor’s notes similar to the one below. The notes are not part of the actual changes and must not be included in the changed text. Editor's note: Framed notes like these only clarify where and how the changes shall be applied."}]}}