{"input":{"cteatedAt":"2021-02-18T12:55:44.923Z","url":"http://www.openmobilealliance.org/release/Push/V2_3-20091013-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Push/V2_3-20091013-C/OMA-AD-Push-V2_3-20091013-C.pdf","file":"OMA-AD-Push-V2_3-20091013-C.pdf","status":"Candidate","version":"V2.3","date":"2009-10-13","contentMediaType":"application/pdf","description":"The Open Mobile Alliance (OMA) continues the work of the WAP Forum in developing industry-wide specifications for developing enablers and services that operate over wireless communication networks. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, OMA defines a set of enablers in transport, session and application layers.  This document outlines the Push Architecture and related specifications, which together specify an enabler for a service to push content to mobile devices.  •Push Architectural Overview The purpose of this document is to serve as a starting point for anybody wanting to know more about the Push technology, before taking on the other specifications. •Push Access Protocol Specification This document specifies the protocol with which a Push Initiator communicates with the PPG. See section 5.3.1.1 for a brief description. •Push Proxy Gateway Service Specification This document specifies the Push Proxy Gateway functionality, and how it interacts with the Push Access Protocol and the Push Over-The-Air protocol. See section 5.3.1 for a brief description. •Push OTA Protocol Specification This document specifies the protocol with which a PPG communicates with a push-capable client. See section 5.3.2.2 for a brief description. •Push Client-Application Interface Specificiation This document specifies the optional interface between a Push Client and applications, via which the application can register for push services and receive push content. See section 5.3.2.3 for a brief description. •Push Message Specification This document specifies end-to-end properties of a push message. •Service Indication Specification This document specifies a content type used for notifying users they have new information waiting on a server. See section 5.3.2.1.2.1 for a brief description.  •Service Loading Specification This document specifies a content type that instructs the client to automatically load a URI. See section 5.3.2.1.2.2 for a brief description. •Cache Operation Specification This document specifies a content type that instructs the client to invalidate cached resources. See section 5.3.2.1.2.3 for a brief description."},{"url":"http://www.openmobilealliance.org/release/Push/V2_3-20091013-C/OMA-ERELD-Push-V2_3-20091013-C.pdf","file":"OMA-ERELD-Push-V2_3-20091013-C.pdf","status":"Candidate","version":"V2.3","date":"2009-10-13","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Push according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The Push enabler release defines the application level protocols, syntax and behaviours of client and server for the fulfilment of push services. Push service is defined as communication of content toward a client without an explicit request."},{"url":"http://www.openmobilealliance.org/release/Push/V2_3-20091013-C/OMA-ERP-Push-V2_3-20091013-C.zip","file":"OMA-ERP-Push-V2_3-20091013-C.zip","status":"Candidate","version":"V2.3","date":"2009-10-13","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/Push/V2_3-20091013-C/OMA-RD-PTM_Push-V1_0-20090526-C.pdf","file":"OMA-RD-PTM_Push-V1_0-20090526-C.pdf","status":"Candidate","version":"V1.0","date":"2009-05-26","contentMediaType":"application/pdf","description":"This document defines the requirements for “Point-to-Multipoint Push” (referred to as PTM-Push or “Multipoint Push”).  The PTM-Push requirements scope includes the following enhancements to the OMA Push enabler: •additional network/bearer context support, including point-to-multipoint operation over broadcast and multicast bearers •Push targeting to multiple users with delivery via multipoint or point-to-point methods •enhancement of Push Security features and Push Service lifecycle for multipoint Push use cases"},{"url":"http://www.openmobilealliance.org/release/Push/V2_3-20091013-C/OMA-RD-PushSecurity-V1_0-20050125-C.pdf","file":"OMA-RD-PushSecurity-V1_0-20050125-C.pdf","status":"Candidate","version":"V1.0","date":"2005-01-25","contentMediaType":"application/pdf","description":"The scope of this document is to identify the use cases pertinent to the security issues of WAP Push and then define the security requirements for the identified use cases."}]}}