{"input":{"cteatedAt":"2021-02-18T13:21:16.698Z","url":"http://www.openmobilealliance.org/release/UAProf_BPG/V1_0-20080331-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/UAProf_BPG/V1_0-20080331-A/OMA-RRELD-UAProfBestPracticesGuide-V1_0-20080331-A.pdf","file":"OMA-RRELD-UAProfBestPracticesGuide-V1_0-20080331-A.pdf","status":"Approved","version":"V1.0","date":"2008-03-31","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of the UAProf Best Practices Guide according to OMA Release process and the Reference Release document baseline listed in section 6."},{"url":"http://www.openmobilealliance.org/release/UAProf_BPG/V1_0-20080331-A/OMA-RRP-UAProfBestPracticesGuide-V1_0-20080331-A.zip","file":"OMA-RRP-UAProfBestPracticesGuide-V1_0-20080331-A.zip","status":"Approved","version":"V1.0","date":"2008-03-31","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/UAProf_BPG/V1_0-20080331-A/OMA-WP-UAProf_Best_Practices_Guide-20080331-A.pdf","file":"OMA-WP-UAProf_Best_Practices_Guide-20080331-A.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"The User Agent Profile [UAPROF] is an XML document that describes the software and hardware capabilities of a mobile device, as well as information about the network to which the device is connected. This information is used by Content Providers for the purposes of formatting content to suit the capabilities of the target device. In general practice, a mobile device vendor will publish User Agent Profiles for all applicable devices in their product portfolio. When invoking a service, a UAProf enabled device will advise the location of its User Agent Profile document via mechanisms described in [UAPROF]. The Content Provider will then fetch the document and, based on the capabilities described therein, tailor content for that device accordingly. Due to the distributed nature and numerous sources of UAProf information, problems can arise with the accuracy, validity, and discoverability of User Agent Profiles in the marketplace. Accuracy refers to how closely a device’s User Agent Profile describes its actual hardware, software, and network characteristics. Validity refers to whether a User Agent Profile is syntactically and semantically correct and parseable. Discoverability refers to how easy it is to find the correct User Agent Profile for a given device. The UAProf best practices guide is an informative document that aims to address the above issues in two ways: •It provides a best practices guideline for authors of User Agent Profiles. These guidelines will help reduce common mistakes found in User Agent Profiles in the marketplace today, which in turn will help alleviate the problems of accuracy and validity.•It describes a set of tools implemented by the Open Mobile Alliance to assist in the validation, management and discovery of User Agent Profiles, which in turn will address the problems of discoverability."}]}}