{"input":{"cteatedAt":"2021-02-18T13:10:32.729Z","url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-AD-SIMPLE_IM-V1_0-20120807-A.pdf","file":"OMA-AD-SIMPLE_IM-V1_0-20120807-A.pdf","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"application/pdf","description":"The scope of this SIP/SIMPLE Instant Messaging Architecture Document (AD) is to define the architecture for the IM service enabler based on the IETF SIP/SIMPLE specifications.  This document fulfils the requirements for functional capabilities of the SIMPLE IM enabler and proposes a functional architecture to support this service enabler as described in the Instant Messaging Requirements document [IM-RD]. Within the context of the OMA Service Environment (OSE), this document defines all functional entities within and external to the SIMPLE IM enabler and all their reference points."},{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-ERELD-SIMPLE_IM-V1_0-20120807-A.pdf","file":"OMA-ERELD-SIMPLE_IM-V1_0-20120807-A.pdf","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of SIMPLE IM according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-ERP-SIMPLE_IM-V1_0-20120807-A.zip","file":"OMA-ERP-SIMPLE_IM-V1_0-20120807-A.zip","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-RD-IM-V1_0-20120807-A.pdf","file":"OMA-RD-IM-V1_0-20120807-A.pdf","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"application/pdf","description":"This document describes use cases of Instant Messaging (IM) in mobile and requirements for a wireless IM solution within OMA. The overall goal of this requirements document is to investigate IM service in mobile from service provider, technological and end-users’ demands. This document contributes the development of an IM Solution for OMA.  The overall goals of an OMA IM Solution can be stated as:  Low latency (i.e. as close to real time as possible for an IM message exchange )  Optimized and efficient use of available wireless resources  Interoperability & Interworking with other standardized IM solutions  Security  Mobility  Unrestricted by content type Although the technical realization is assumed to be based on SIP/SIMPLE technology, this Requirements Document describes requirements at a high level, in a technology agnostic way."},{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-SUP-AC_ap0008_SIMPLE_IM-V1_0-20120807-A.txt","file":"OMA-SUP-AC_ap0008_SIMPLE_IM-V1_0-20120807-A.txt","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-SUP-XSD_im_hist_def_metadata-V1_0-20120807-A.txt","file":"OMA-SUP-XSD_im_hist_def_metadata-V1_0-20120807-A.txt","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"text/plain"},{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-SUP-XSD_im_service_settings-V1_0-20120807-A.xml","file":"OMA-SUP-XSD_im_service_settings-V1_0-20120807-A.xml","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-TS-IM_XDM-V1_0-20120807-A.pdf","file":"OMA-TS-IM_XDM-V1_0-20120807-A.pdf","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"application/pdf","description":"The IM XDM specific data formats and Application Usages are described in this specification."},{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-TS-SIMPLE_IM-V1_0-20120807-A.pdf","file":"OMA-TS-SIMPLE_IM-V1_0-20120807-A.pdf","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"application/pdf","description":""},{"url":"http://www.openmobilealliance.org/release/SIMPLE_IM/V1_0-20120807-A/OMA-TS-SIMPLE_IM_Charging-V1_0-20120807-A.pdf","file":"OMA-TS-SIMPLE_IM_Charging-V1_0-20120807-A.pdf","status":"Approved","version":"V1.0","date":"2012-08-07","contentMediaType":"application/pdf","description":"This document specifies the use of OMA Charging Enabler to realise the offline and online charging requirements of OMA SIMPLE IM Enabler. The OMA Charging Enabler defines a set of interfaces that are utilised by the other Enablers to fulfil their charging requirements. The interfaces are specified in [OMA-AD-Charging-V1_0]. This document defines how, when and by which entities charging is triggered and which function invokes charging over the OMA Charging Enabler interfaces. This document also defines the data that will be exchanged during the process. This document specifies in detail:  The charging models for the OMA SIMPLE IM enabler,  The logical messages and message types used on CH-1 and CH-2 interfaces,   The flow of messages between the Charging Enabler User and the Charging Enabler with regard to the IM Service and applicable IM scenarios,  Mapping of the IM parameters to the OMA Charging Data Elements  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 7 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 2. References 2.1 Normative References [IM-AD] “Instant Messaging Architecture ”, Open Mobile Alliance™,  OMA-AD_SIMPLE_IM-V1_0, URL: http://www.openmobilealliance.org/  [IM-TS] “Instant Messaging using SIMPLE”, Open Mobile Alliance™,  OMA-TS_SIMPLE_IM-V1_0, URL: http://www.openmobilealliance.org/  [RFC2119] “Key words for use in RFCs to Indicate Requirement Levels”, S. Bradner, March 1997, URL:http://www.ietf.org/rfc/rfc2119.txt [SCRRULES] “SCR Rules and Procedures”, Open Mobile Alliance™, OMA-ORG-SCR_Rules_and_Procedures, URL:http://www.openmobilealliance.org/ 2.2 Informative References [OMA-DICT] “Dictionary for OMA Specifications”, Version x.y, Open Mobile Alliance™, OMA-ORG-Dictionary-Vx_y, URL:http://www.openmobilealliance.org/ OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 8 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 3. Terminology and Conventions 3.1 Conventions The key words “MUST”, “MUST NOT”, “REQUIRED”, “SHALL”, “SHALL NOT”, “SHOULD”, “SHOULD NOT”, “RECOMMENDED”, “MAY”, and “OPTIONAL” in this document are to be interpreted as described in [RFC2119]. All sections and appendixes, except “Scope” and “Introduction”, are normative, unless they are explicitly indicated to be informative. 3.2 Definitions  CH-1 EventRequest Refers to the EventRequest defined in OMA Offline charging TS CH-1 InterimRequest Refers to the InterimRequest defined in OMA Offline charging TS CH-1 Response Refers to the Charging Response Message defined in OMA Offline charging TS CH-1 StartRequest Refers to the StartRequest defined in OMA Offline charging TS CH-1 StopRequest Refers to the StopRequest defined in OMA Offline charging TS CH-2 Balance Check Request Refers to the Balance Check Request defined in OMA Online Charging TS CH-2 Initial Request Refers to the Initial Request defined in OMA Online Charging TS CH-2 Response Refers to the Charging Response Message defined in OMA Online charging TS CH-2 Termination Request Refers to the Termination Request defined in OMA Online Charging TS CH-2 Update Request Refers to the Update Request defined in OMA Online Charging TS IM Session Exchange of near real-time messages where the senders and receivers join together for a period of time (session). The session is established at some moment in time, continues for a finite duration and then is dissolved. Messages exchanged are associated together in the context of this session. 3.3 Abbreviations IM Instant Messaging OMA Open Mobile Alliance SIMPLE SIP for Instant Messaging and Presence Leveraging Extensions SIP Session Initiation Protocol OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 9 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 4. Introduction The OMA Charging Enabler  provides offline and online charging specifications for the other OMA enablers. This document is part of the SIMPLE IM enabler and specifies charging for the OMA IM service. 4.1 Version 1.0  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 10 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 5. SIMPLE IM Charging Architecture The OMA SIMPLE IM service architecture is described in [IM-AD]. Figure 1 depicts the high-level OMA SIMPLE IM charging architecture.  Figure 1: Charging architecture for IM charging In this figure:  CH-1 is Offline charging reference point between SIMPLE IM Server and the Offline Function of the Charging Enabler.  CH-2 is Online charging reference point between SIMPLE IM Server and the Online Function of the Charging Enabler. The OMA SIMPLE IM Server MAY comprise of the Charging Enabler User, an integrated function that monitors and generates the charging events, sends the charging requests to the Charging Enabler and receives the responses from the Charging Enabler, over the CH-1 or the CH-2 interface, or both. NOTE: No distinction is made between the individual IM functions such as the controlling and the participating functions, i.e. both functions are referred to as IM Server for the purposes. The OMA SIMPLE IM Server SHALL generate charging requests for all the users registered to that Server.  CH-1 OMA SIMPLE IM SERVER OFFLINE FUNCTION ONLINE FUNCTION OMA CHARGING ENABLER CH-2 OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 11 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6. IM charging principles and scenarios OMA SIMPLE IM charging is based on the concept of charging for the usage of the service. The criteria for charging for the service provided may vary, i.e. charging may be based on sessions, duration of the session, number of participants, numbers of messages, size of messages, etc. or a combination of such criteria.  OMA SIMPLE IM charging SHALL support both charging models, i.e. an Event-based charging model that charges for session unrelated events, and a Session-based charging model, that charges for the an OMA SIMPLE IM sessions. These models are applicable for both online and offline charging procedures. The IM Server may process a Large message or a message within an IM session which MAY be broken down into smaller chunks for the purposes of transmission. In such cases, the IM Server may receive multiple intermediate [MSRP 200 OK] messages; however, these [MSRP 200 OK] messages SHALL NOT trigger a charging request message. In this case, the IM Server MAY trigger a charging request message only after receiving the last [MSRP 200 OK], i.e. on determining that the transmission of the chunked messages is completed. 6.1 IM charging principles 6.1.1 Charging principles for IM Events The OMA Charging Enabler User SHALL use Event-based charging to enable charging for the following IM session unrelated procedures.  Sending or receiving of pager mode message(s) to a single user or to a predefined/ad-hoc group. Deferred messages shall be considered as successful. Unsuccessful pager mode messages sent to a single user or to a predefined/ad-hoc group SHALL be reported (related to charging scenarios 1.x, 2.x defined in [IM-TS]).  Sending or receiving of Large message to a single user or to a predefined/ad-hoc group. Unsuccessful Large message to a single user or to a predefined/ad-hoc group SHALL be reported (related to charging scenarios 3, 4 defined in [IM-TS]).  Retrieval of conversation history (related to charging scenario 9.4 defined in [IM-TS]).  Retrieval of one or all deferred messages (related to charging scenario 10.1 defined in [IM-TS]).   Having all deferred messages pushed (related to charging scenario 10.3 defined in [IM-TS]) 6.1.2 Charging principles for IM Sessions Charging requests for an OMA SIMPLE IM session SHALL be generated by the IM Server for the participants being served by it.  The charged parties may be any of the OMA SIMPLE IM participants, depending on the role of the participant. These roles are:  IM participant.  IM inviting user or group owner (in the case of OMA SIMPLE IM sessions) Information  about  the  OMA  SIMPLE  IM  session  SHALL  be  collected  by  the IM  Server.   Charging  SHALL  be  done according to the following types of OMA SIMPLE IM sessions [IM-AD], if such information is available:  1-1 IM session peer-to-peer,  1-1 IM session through different OMA SIMPLE IM servers,  IM group session,  Ad-hoc IM  group session, OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 12 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  Pre-defined IM group session. OMA SIMPLE IM session owner and/or participants MAY be charged based on, e.g.: 1. IM session duration, 2. Number of participants, 3. Volume of messages sent and/or received by the participant, 4. Number of messages sent and/or received by the participant,  or a combination of the above. In addition the following parameters MAY be considered for a final charge: a) Number of exploded messages, b) Identity of the network hosting the IM Server where messages are exploded. Online and offline specific charging details are given in the subsequent chapters. 6.2 IM Offline Charging Scenarios 6.2.1 Basic principles The charging models as given in chapter 6 SHALL be supported for offline charging.  These charging requests SHALL contain distinct service usage data for any of the described sub-services. IM usage data in the charging requests SHALL comprise the duration, volume and number of messages.  OMA SIMPLE IM sessions MAY be charged either using the Event-based messages (EventRequest) or the Session-based messages (StartRequest, InterimRequest (zero or more), and StopRequest). Event-based requests SHALL be generated for pager message and large message mode delivery. InterimRequest and StopRequest messages SHALL be generated for the IM sessions in accordance to the defined triggers for offline charging. The generation of InterimRequest(s) SHALL be governed in accordance to triggers defined for Session-based requests, or on the values received in the charging responses, or based on locally configured values. The charging request messages sent from a SIMPLE IM Server are described in the following table. The table summarises the SIP or MSRP messages which may trigger the charging messages.   OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 13 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] OMA Charging Message Triggering SIP Method /MSRP Message StartRequest SIP 200 OK to Initial SIP INVITE in one-to-one IM session Establishment  SIP 200 OK to Initial SIP INVITE in successful conference IM Session Establishment InterimRequest SIP 200 OK/SIP BYE indicating an arrival or departure of a conference participant SIP re-INVITE in Session modification The final MSRP 200 OK acknowledging a MSRP SEND in IM Session Message exchange MSRP error message in IM Session Message exchange StopRequest SIP BYE received by IM Server in IM Session End signifying the end of the session. SIP BYE generated by the IM Server to close the session. EventRequest  SIP 200 OK acknowledging a SIP MESSAGE is successfully accepted in Pager mode message transmission SIP BYE sent from IM Server in deferred message push. SIP BYE sent from IM Server in deferred message retrieval The final MSRP 200 OK acknowledging a MSRP SEND of a Large message. MSRP 200 OK acknowledging MSRP SEND in Conversation History Retrieval MSRP error message during the transmission of a Large message. Table 1: Charging Request Message Triggered by SIP Methods or MSRP Messages for SIMPLE IM Server  6.2.2 Offline Charging for IM Events 6.2.2.1 Pager mode message to a single user Figure 2 shows the charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the Pager mode message delivery. The charging principle is the same whether the receiving client belongs to the same network or not and is online or not (deferred message).  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 14 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  IM Client  Charging Enabler IM Server  1. SIP MESSAGE 5. CH-1 EventRequest 6. CH-1 Response 4. SIP 200 OK 3. SIP 200 OK 2. SIP MESSAGE  Figure 2: Offline Charging for Pager Mode Messaging 1. The IM Server receives a [SIP MESSAGE] from the IM Client. 2. The IM Server forwards the [SIP MESSAGE] to the recipient. 3. The IM Server receives a [SIP 200 OK] or any SIP error. 4. The IM Server forwards the [SIP 200 OK] or any SIP error to the IM Client. 5. In the case of an IM Server forwarding [SIP 200 OK], the Charging Enabler User SHALL trigger a CH-1 EventRequest message towards the Charging Enabler. 6. The Charging Enabler acknowledges with a CH-1 Response message. 6.2.2.2 Pager mode message to an ad hoc or pre-defined group Figure 3 shows the charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the Pager mode message delivery to an ad-hoc or pre-defined group. The charging principle is the same whether the receiving client belongs to the same network or not and is online or not (deferred message). OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 15 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  IM Client  Charging Enabler IM Server 1. SIP MESSAGE 7. CH-1 EventRequest  8. CH-1 Response 3. SIP 202 OK 4. SIP 200 OK * 2. SIP MESSAGE * 5. Notification [SIP MESSAGE] 6. SIP 200 OK  Figure 3: Offline Charging for Pager Mode Messaging to AdHoc or pre-defined group 1. The IM Server receives a [SIP MESSAGE] from the IM Client.  2. The IM Server forwards the [SIP MESSAGE] to each of the recipients in the ad-hoc or predefined group. 3. The IM Server sends a [SIP 202 OK] to the IM Client. 4. The IM Server receives a [SIP 200 OK] or any SIP error response from each of the recipients in the ad-hoc or predefined group. 5. At the timer expiration the IM Server sends the aggregated delivery notifications to the originating client in a [SIP MESSAGE]. 6. The IM Server receives a [SIP 200 OK] confirmation from the IM Client. 7. The Charging Enabler User in the IM Server, after receiving a [SIP 200 OK] from the IM client, SHALL trigger a CH-1 EventRequest message towards the Charging Enabler. 8. The Charging Enabler acknowledges with a CH-1 Response message. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 16 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6.2.2.3 Large message Figure 4 shows the charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the Large message delivery. The charging principle is the same whether the receiving client belongs to the same network or not and is online or not (deferred message).  IM Client  Charging Enabler IM Server 3. MSRP SEND 7. CH-1 EventRequest           (Debit Units)   8. CH-1 Response 6. MSRP 200 OK  5. MSRP 200 OK  1. SIP INVITE 2. SIP 200 OK 9. SIP BYE 10. SIP 200OK 4. MSRP SEND  Figure 4: Offline Charging for Large Mode Messaging 1. The IM Server receives a [SIP INVITE] from the IM Client. 2. The IM Server confirms with a [SIP 200 OK]. 3. The IM Client sends a large message over [MSRP SEND] to the IM Server  4. The IM Server forwards the [MSRP SEND] to the recipient. 5. The IM Server receives a [MSRP 200 OK] from the recipient.  6. The IM Server forwards the [MSRP 200 OK] to the IM Client. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 17 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 7. The Charging Enabler User in the IM Server SHALL trigger a CH-1 EventRequest (Debit Units) message towards the Charging Enabler. The charging message SHALL be triggered when one of the following has occurred: - [MSRP 200 OK] response indicating the receipt of the complete message by a recipient (i.e. all chunks within the MSRP ) - a MSRP error message is received - timeout has been reached. 8. The Charging Enabler acknowledges with a CH-1 Response message. 9. The IM Client triggers a [SIP BYE] towards the IM Server. 10. The IM Server responds with a [SIP 200 OK].  6.2.2.4 Large message to an ad-hoc or predefined group Figure 5 shows the Charging Request transactions between the Charging Enabler User in an IM Server and Charging Enabler for the Large mode message delivery to a predefined or ad hoc group. Each Large mode group message SHALL be treated independently.  IM Client A  Charging Enabler IM Server 1. MSRP SEND SIP SESSION SETUP IM Client B  IM Client C 3. MSRP SEND * 4. MSRP 200 OK * 5. CH-1 EventRequest  6. CH-1 Response 2. MSRP 200 OK  Figure 5: Offline Charging for Large mode message to an ad hoc or predefined group 1. The IM Server receives a [MSRP SEND] from the IM Client 2. The IM Server sends a [MSRP 200 OK] confirming the receipt of the message. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 18 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 3. The IM Server forwards the [MSRP SEND] to the recipients. 4. The IM Server receives the corresponding [MSRP 200 OK] messages. 5. The Charging Enabler User in  the IM Server SHALL trigger a CH-1 EventRequest message towards the Charging Enabler in the following cases: - all  responses have been received ([MSRP 200 OK] or MSRP error message)  - a timeout for the response message has been reached. 6. The Charging Enabler acknowledges with a CH-1 Response message.  6.2.2.5 Conversation History Retrieval Figure 6 shows the charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the conversation history retrieval.  IM Client  Charging Enabler IM Server 1. SIP INVITE 5. CH-1 EventRequest  6. CH-1 Response 3. MSRP SEND 2. SIP 200 OK 4. MSRP 200 OK 7. SIP BYE 8. SIP 200 OK  Figure 6: Offline Charging for Conversation History Retrieval 1. The IM Server receives a [SIP INVITE] from the IM Client. 2. The IM Server confirms with a [SIP 200 OK]. 3. The IM Server sends saved history over MSRP to the IM Client [MSRP SEND]. 4. The IM Client confirms with a [MSRP 200 OK]. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 19 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 5. The Charging Enabler User in the IM Server, after receiving a [MSRP 200 OK] from the IM client, SHALL trigger a CH-1 EventRequest message towards the Charging Enabler. 6. The Charging Enabler acknowledges with a CH-1 Response message. 7. The IM Client triggers a [SIP BYE] towards the IM Server. 8. The IM Server confirms with a [SIP 200 OK].  6.2.2.6 Deferred Message Retrieval  IM  Client  Charging Enabler  2.  SIP 200 OK IM  Server 1. SIP INVITE 3. MSRP SEND * 4. MSRP 200 OK * 5.  SIP BYE 6. CH-1 EventRequest 7. CH-1 Response  Figure 7: Offline charging for retrieval of deferred messages NOTE: The last [SIP 200 OK] response from the IM Client has been omitted from figure; however, can occur at any point after the [SIP BYE] is received from IM Client.  1. The IM Server receives a [SIP INVITE] from the IM Client.  2. The IM Server sends a confirmation [SIP 200 OK] to the IM Client. 3. The IM Server sends one or more [MSRP SEND] containing the deferred message(s). 4. The IM Server receives one or more [MSRP 200 OK] from the IM Client. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 20 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 5. The IM Server sends a [SIP BYE] to the IM Client.  6. The Charging Enabler User in the IM Server, after sending a [SIP BYE] to the IM client, SHALL trigger a CH-1 EventRequest message towards the Charging Enabler. 7. The Charging Enabler acknowledges with a CH-1 Response message.  6.2.2.7 Deferred Message Push  IM  Client  Charging Enabler  2.  SIP 200 OK IM  Server 1. SIP INVITE 3. MSRP SEND * 4. MSRP 200 OK * 5.  SIP BYE 6. CH-1 EventRequest 7. CH-1 Response  Figure 8: Offline charging for deferred message push    NOTE: The last [SIP 200 OK] response from the IM Client has been omitted from figure; however can occur at any point after the [SIP BYE] is sent to the IM Client. 1. The IM Server sends a [SIP INVITE] to the IM Client.  2. The IM Server receives a confirmation [SIP 200 OK] from the IM Client. 3. The IM Server sends one or more [MSRP SEND] containing the deferred message(s). 4. The IM Server receives one or more [MSRP 200 OK] from the Client. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 21 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 5. The IM Server sends a [SIP BYE] to the IM Client.  6. The Charging Enabler User in the IM Server, after sending a [SIP BYE] to the IM client, SHALL trigger a CH-1 EventRequest message towards the Charging Enabler. 7. The Charging Enabler acknowledges with a CH-1 Response message.  6.2.3 Offline Charging for IM sessions 6.2.3.1 Successful one-to-one IM session Establishment Figure 9 shows the charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for an IM session establishment originated by an IM Client.   IM  Client  Charging Enabler  3.  SIP 200 OK IM  Server 1. SIP INVITE 4. CH-1 StartRequest  5. CH-1 Response 2. SIP INVITE  Figure 9: Offline Charging for one-to-one IM Session Establishment NOTE: The forward of the [SIP 200 OK] response to the IM Client has been omitted from figure; however, can be sent at any point after the [SIP 200 OK] is received from the recipient. 1. The IM Server receives a [SIP INVITE] from the IM Client. 2. The IM Server forwards the [SIP INVITE] to the recipient. 3. The IM Server receives a confirmation [SIP 200 OK].  4. The Charging Enabler User in the IM Server receiving a [SIP 200 OK] SHALL trigger a CH-1 StartRequest message towards the Charging Enabler. 5. The Charging Enabler acknowledges with a CH-1 Response message.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 22 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6.2.3.2 Successful conference IM session Establishment Below figure shows the charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for a conference IM session establishment originated by an IM Client.   IM  Client  Charging Enabler  6.  SIP 200 OK * IM  Server 1. SIP INVITE 3. CH-1 StartRequest  4. CH-1 Response 5. SIP INVITE * 2.  SIP 200 OK   Figure 10: Offline Charging for conference IM Session Establishment 1. The IM Server receives a [SIP INVITE] from the IM Client. 2. The IM Server confirms with a [SIP 200 OK] to the recipient. 3. The Charging Enabler User in the IM Server sending a [SIP 200] SHALL trigger a CH-1 StartRequest message towards the Charging Enabler. 4. The Charging Enabler acknowledges with a CH-1 Response message. 5. The IM Server forwards the [SIP INVITE] to the recipients. 6. The IM Server receives confirmation [SIP 200 OK].  6.2.3.3 Joining or departure of a conference participant Figure 11 shows the offline charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for joining or departure of a conference participant, i.e when SIP INVITE or BYE requests are received at the IM Server during a session.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 23 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] More SIP signalling 2.CH-1 InterimRequest 1.  200 OK / BYE Charging Enabler  3. CH-1 Response  IM Client IM Server   Figure 11: Offline Charging for Arrival or departure of a conference participant 1. [SIP 200 OK] (in response to a Server [SIP INVITE] or [SIP BYE]) or [SIP BYE] request is sent to IM Server. 2. The Charging Enabler User in the IM Server receiving a [SIP 200OK] message or a [SIP BYE] message SHALL trigger a CH-1 InterimRequest message towards the Charging Enabler. 3. The Charging Enabler acknowledges with a CH-1 Response message. 6.2.3.4 Session Modification Figure 12 shows the offline Charging Request transactions between the Charging Enabler User in an IM Server and the Charging Enabler for session modification. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 24 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 2.CH-1 InterimRequest 4. SIP 200 OK Charging Enabler  3. CH-1 Response 1. SIP re-INVITE 6. SIP 200 OK* 5. SIP re-INVITE*  IM Client IM Server   Figure 12: Offline Charging for session modification 1. The IM Server receives a [SIP re-INVITE] message from an IM client. 2. The Charging Enabler User in the IM Server receiving a [SIP re-INVITE] SHALL trigger a CH-1 InterimRequest message towards the Charging Enabler. 3. The Charging Enabler acknowledges with a CH-1 Response message. 4. The IM Server confirms IM Client with a [SIP 200 OK]. 5. The IM Server forwards the [SIP re-INVITE] message to the recipients. 6. The IM Server receives the corresponding [SIP 200 OK] message from the recipients.  6.2.3.5 Message exchange during a chat session Figure 13 shows the charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for message exchange during an IM session. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 25 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  IM Client  Charging Enabler IM  Server 1. MSRP SEND 5. CH-1 InterimRequest  6. CH-1 Response 2. MSRP 200 OK  3. MSRP SEND 4. MSRP 200 OK   Figure 13: Offline Charging for IM Session message exchange 1. The IM Server receives a [MSRP SEND] from the IM Client.  2. The IM Server confirms with a [MSRP 200 OK]. 3. The IM Server forwards the [MSRP SEND] to the recipient. 4. The recipient confirms with a [MSRP 200 OK]. 5. The Charging Enabler User in the IM Server MAY trigger a CH-1 InterimRequest message towards the Charging Enabler in following cases :  - a [MSRP 200 OK] or a MSRP error message has been received - a timeout for the response message has been reached. 6. The Charging Enabler acknowledges with a CH-1 Response message.  Note that the trigger for sending CH-1 InterimRequest message depends on the interim interval received from the Charging Enabler. However, to prevent the generation of a heavy charging traffic, the trigger configuration should lead to a reasonable InterimRequest message sending frequency. 6.2.3.6 IM Session end The IM Session may be closed either by the IM Client or the IM Server. Figure 14 shows the charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler when the IM session is closed at the initiative of the IM Client. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 26 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  IM Client  Charging Enabler IM  Server 1. SIP BYE 2. CH-1 StopRequest  3. CH-1 Response  Figure 14: Offline Charging for IM Session end (client terminating) NOTE: The last [SIP 200 OK] response from the IM Server has been omitted from the figure; however; can occur at any point after the [SIP BYE] is received by the IM Server. 1. The IM Client triggers a [SIP BYE] towards the IM Server to terminate the IM Session. 2. The Charging Enabler User in the IM Server receiving a [SIP BYE] message SHALL trigger a CH-1 StopRequest message towards the Charging Enabler. 3. The Charging Enabler acknowledges with a CH-1 Response message.  Figure 15 shows the charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler when the IM Session is closed at the initiative of the IM Server. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 27 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  IM Client  Charging Enabler IM  Server 1. SIP BYE 2. CH-1 StopRequest  3. CH-1 Response  Figure 15: Offline charging for IM Session end (Server terminating) NOTE: The last [SIP 200 OK] response from the IM Client has been omitted from figure; however, can occur at any point after the [SIP BYE] is received by the IM Client. 1. The IM Server sends a [SIP BYE] towards the IM Client to terminate the IM Session. 2. The Charging Enabler User in the IM Server sending a [SIP BYE] message SHALL trigger a CH-1 StopRequest message towards the Charging Enabler. 3. The Charging Enabler acknowledges with a CH-1 Response message.  6.3 IM online charging scenarios 6.3.1 Basic principles The charging models as given in chapter 6 SHALL be supported for online charging.  These charging requests SHALL contain distinct service  usage  data  for any of the  described sub-services. IM  usage  data  in the charging requests SHALL comprise the duration, volume and number of messages.  OMA  SIMPLE  IM  sessions MAY be  charged  either  using  the  Event-based  messages for  online (EventRequest)  or  the Session-based messages for online (Initial Request, Update Request(s) (zero or more), and Termination Request).  Initial Request  and Termination  Request  message  SHALL  be  generated  for  the  IM  session  in  accordance  to the  defined triggers  for  online charging.  The  generation  of UpdateRequests  SHALL  be  governed  in  accordance  to  triggers  defined  for Session-based requests for online requests, or on the values received in the charging responses. Event-based  online  charging  requests  SHALL  be  generated  for  pager  and Large message mode  delivery and  MAY  be  also used for session mode messaging. Session-based charging requests SHALL be generated only for session mode messaging. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 28 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] In  IM  session  mode,  message  exchanges within  the  IM session SHALL be  charged  using  the Session-based Charging  with Reservation and may be metered by duration, volume or number of messages. The metering is done by the Charging Enabler User within the IM Server and governed as described by the Charging Enabler [OMA ONLINE CHG].  For  events unrelated  to  a  session  (e.g.  Pager  mode  message,  large mode  message,  history  retrieval),  the Charging  Enabler User within the IM Server SHALL use Event-based Charging with Unit Reservation. The Charging Request messages to be sent from a SIMPLE IM Server are described in the following table. Table 2: The Charging Request Messages Triggered by SIP Methods or MSRP Messages for SIMPLE IM Server.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 29 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  OMA Charging  Message Triggering SIP Method CH-2 Initial Request SIP MESSAGE in Page Mode message transmission(ECUR) MSRP SEND in Large message transmission(ECUR) SIP INVITE in  conversation history retrieval(ECUR) SIP INVITE in deferred message retrieval(ECUR) SIP PUBLISH in deferred message push(ECUR) SIP INVITE in successful one-to-one session establishment(SCUR) SIP INVITE in successful conference IM session establishment(SCUR) CH-2 Update Request MSRP SEND in Message exchange during a chat session(SCUR) SIP re-INVITE in Mid IM Session procedure(SCUR) SIP BYE acknowledging a party departing from an ongoing adhoc or pre-defined group session CH-2 Termination Request SIP 200 OK acknowledging a SIP MESSAGE in Page Mode message transmission(ECUR) SIP error message for a SiP MESSAGE in Page Mode message to a single user(ECUR) SIP BYE sent from IM Server in Message Exchange during a chat session(SCUR) SIP BYE sent from IM Client in Message Exchange during a chat session(SCUR) MSRP 200 OK for a MSRP SEND in Large message transmission (ECUR) MSRP 200 OK acknowledging MSRP SEND in deferred message retrieval(ECUR) MSRP 200 OK for a MSRP SEND in conversation history retrieval(ECUR) MSRP 200 OK for aMSRP SEND in deferred message push(ECUR) MSRP 200 OK for MSRP SEND in message exchange during a chat session(SCUR) MSRP error message for a MSRP SEND in Large message transmission(ECUR) MSRP error message for a MSRP SEND in conversation history retrieval(ECUR) MSRP error message for a MSRP SEND in deferred message retrieval(ECUR) MSRP error message for a MSRP SEND in deferred message push(ECUR) CH-2 Balance Check Request SIP INVITE in Large message transmission (Balance Check) Table 2: The Charging Request Messages Triggered by SIP Methods or MSRP Messages for SIMPLE IM Server  6.3.2 Online Charging for IM Events 6.3.2.1 Pager mode message to a single user Figure 16 shows  the online Charging  Request transactions  between the  Charging  Enabler  User  in the IM  Server  and the Charging Enabler for the Pager mode message delivery.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 30 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  IM Client  Charging Enabler IM Server 1. SIP MESSAGE 2. CH-2 Initial Request (reserve units)  3. CH-2 Response 4. SIP MESSAGE 5. SIP 200 OK 6. CH-2 Termination Request (debit units) 7. CH-2 Response   Figure 16: Online Charging for Pager Mode Messages to a Single User NOTE: The [SIP 200 OK] response to the IM Client has been omitted from figure; however can occur at any point after the [SIP 200 OK] is received from the user agent of the recipient. 1. The IM Server receives a [SIP MESSAGE] from the IM Client. 2. The Charging Enabler User in the IM Server receiving a [SIP MESSAGE] message SHALL trigger a CH-2 Initial Request (reserve units) message towards the Charging Enabler for credit reservation.  3. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit reservation. 4. The IM Server forwards the [SIP MESSAGE] to the recipient. 5. The IM Server receives a [SIP 200 OK] confirmation. 6. The Charging Enabler User in the IM Server SHALL trigger a CH-2 Termination Request (debit units) message towards the Charging Enabler for used units to be debited in the following cases: - a [SIP 200 OK] or a SIP error message has been received - a timeout for the response message has been reached. 7. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 31 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6.3.2.2 Pager mode message to an ad hoc or predefined group Figure 17 shows the online Charging Request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the Pager mode message delivery to an ad hoc or predefined group. Each Pager mode group message shall be treated independently.  IM Client A  Charging Enabler IM Server  1. SIP MESSAGE 2. CH-2 Initial Request (reserve units) 3.  CH-2 Response 4. SIP MESSAGE * 5. 200 OK * 6. CH-2 Termination Request (debit units) 7. CH-2 Response IM Client B  IM Client C   Figure 17: Online Charging for Pager Mode Message to an ad hoc or predefined group NOTE: The [SIP 200 OK] response to the IM Client A has been omitted fromfigure; however can occur at any point after all the [SIP 200 OK] are received from IM Client B and C.  1. The IM Server receives a [SIP MESSAGE] from the IM Client. 2. The Charging Enabler User in the IM Server receiving a [SIP MESSAGE] message SHALL trigger a CH-2 Initial Request (reserve units) message towards the Charging Enabler for credit reservation.  3. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit reservation. 4. The IM Server forwards the [SIP MESSAGE]s to the recipients. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 32 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 5. The IM Server receives corresponding [SIP 200OK]s or SIP error messages. 6. The Charging Enabler User in the IM Server SHALL trigger a CH-2 Termination Request (debit units) message towards the Charging Enabler for used units to be debited. The message SHALL be triggered when all  responses have been received ([SIP 200 OK] or SIP error message) or a timeout for responses has been reached. Note that the 'reserve units' validity timer SHALL be greater than the IM delivery notifications timer (Ts2) as defined in [IM-TS]. 7. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation. 6.3.2.3 Large message Figure 18 shows the online Charging Request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the Large message delivery. Each Large message shall be treated independently.  IM Client A  Charging Enabler IM Server  8. MSRP SEND 11. CH-2 Response IM Client B  3. CH-2 Response 1. SIP INVITE 2. CH-2 Balance Check Request 5. MSRP SEND 9. MSRP 200 OK 4. SIP 200 OK 10. CH-2 Termination Request (debit units) 7. CH-2 Response 6. CH-2 Initial Request (reserve units)  Figure 18: Online Charging for Large message NOTE: The [MSRP 200 OK] response to the IM Client A has been omitted fromfigure; however can occur at any point after the [MSRP 200 OK] is received from IM Client B.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 33 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 1. The IM Server receives a [SIP INVITE] from the IM Client. 2. The Charging Enabler User in the IM Server receiving a [SIP INVITE] message MAY trigger a CH-2 BalanceCheck Request message towards the Charging Enabler to ensure the IM Client has the minimum credit for sending a Large message.  3. The Charging Enabler acknowledges with a CH-2 Response message including the result of the balance check. 4. The IM Server confirms with a [SIP 200 OK]. 5. The IM Server receives a [MSRP SEND] from the IM Client. 6. The Charging Enabler User in the IM Server receiving a [MSRP SEND] message SHALL trigger a CH-2 Initial Request (reserve units) message towards the Charging Enabler for credit reservation. The amount of credit reserved MAY be based on message size described in [MSRP SEND].  7. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit reservation. 8. The IM Server forwards the [MSRP SEND] to the recipient. 9. The IM Server receives the corresponding [MSRP 200 OK]. 10. The Charging Enabler User in the IM Server SHALL trigger a CH-2 Termination Request (debit units) message towards the Charging Enabler for used units to be debited. The charging message SHALL be triggered when one of the following has occurred: - [MSRP 200 OK] response indicating the receipt of the complete message by a recipient (i.e. all chunks within the MSRP ) - an MSRP error message is received - timeout has been reached. NOTE: The IM Server MAY receive multiple [MSRP 200 OK] messages (e.g. when a large message has been broken down in to smaller chunks); however, these [MSRP 200 OK] messages SHALL NOT trigger a charging request message. In this case, the IM Server SHALL trigger a CH-2 Termination Request message only after receiving the last [MSRP 200 OK] and determining that the transmission of the chunked messages is completed. 11. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 34 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6.3.2.4 Large message to a predefined or ad hoc group Figure 19 shows the online Charging Request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the Large message delivery to a predefined or ad hoc group. Each Large mode group message shall be treated independently.   IM Client A  Charging Enabler IM Client A  Charging Enabler IM Server  10. CH-2 Termination Request (debit units)  11. CH-2 Response IM Client B  IM Client C 8. MSRP SEND *  2. CH-2 Balance Check Request 9. MSRP 200 OK *   3. CH-2 Response 5. MSRP SEND 1. SIP INVITE 4. SIP 200 OK  6. CH-2 Initial Request (reserve units)  7. CH-2 Response  Figure 19: Online Charging for Large message to an ad hoc or predefined group NOTE: The [MSRP 200 OK] response to the IM Client A has been omitted from figure; however can occur at any point after the [MSRP 200 OK] is received from IM Client B or C.  1. The IM Server receives a [SIP INVITE] from the IM Client. 2. The Charging Enabler User in the IM Server receiving a [SIP INVITE] message MAY trigger a CH-2 BalanceCheck Request message towards the Charging Enabler to ensure the IM Client has the minimum credit for sending a Large message.   OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 35 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 3. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit balance check. 4. The IM Server confirms with a [SIP 200 OK]. 5. The IM Server receives a [MSRP SEND] from the IM Client. 6. The Charging Enabler User in the IM Server receiving a [SIP INVITE] message SHALL trigger a CH-2 Initial Request (reserve units) message towards the Charging Enabler for credit reservation. The amount of credit reserved will be based on the message size described in the [MSRP SEND].  7. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit reservation. 8. The IM Server forwards the [MSRP SEND] to the recipients. 9. The IM Server receives the corresponding [MSRP 200 OK](s). 10. The Charging Enabler User in the IM Server SHALL trigger a CH-2 Termination Request (debit units) message towards the Charging Enabler for used units to be debited when, for each message, a all [MSRP 200 OK] message or a MSRP error response messages hasve been received or the timeout for response has been reached. 11. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 36 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6.3.2.5 Conversation History Retrieval Figure 20 shows the online Charging Request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the History retrieval. Each history retrieval request shall be treated independently.  IM Client Charging Enabler IM server History function 1. SIP INVITE 2. CH-2 Initial Request (reserve units) 3. CH-2 Response 7. CH-2 Termination Request (debit units) 8. CH-2 Response 5. MSRP SEND 4. SIP 200 OK 6. MSRP 200 OK  Figure 20: Online charging for Conversation History retrieval NOTE: The [SIP BYE] from the IM Client has been omitted from figure; however can occur at any point after the [MSRP 200 OK] is sent by the IM Client.  1. The IM Server receives a [SIP INVITE] from IM Client. 2. The Charging Enabler User in the IM Server receiving a [SIP INVITE] message SHALL trigger a CH-2 Initial Request (reserve units) message towards the Charging Enabler for credit reservation.  3. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit reservation. 4. The IM Server confirms with a [SIP 200 OK]. 5. The IM Server sends [MSRP SEND] to IM Client including the conversation history. 6. The IM Server receives a [MSRP 200 OK] from IM Client. 7. The Charging Enabler User in the IM Server SHALL trigger a CH-2 Termination Request (debit units) message towards the Charging Enabler for used units to be debited in the following cases: OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 37 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] - a [MSRP 200 OK] or a MSRP error message has been received - a timeout for the response message has been reached. 8. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation.  6.3.2.6 Deferred Message Retrieval Figure 21 shows the online Charging Request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the History retrieval. Each history retrieval request shall be treated independently.  IM Client Charging Enabler IM server History function 1. SIP INVITE 2. CH-2 Initial Request (reserve units) 3. CH-2 Response 8. CH-2 Termination Request (debit units) 9. CH-2 Response 5. MSRP SEND * 4. SIP 200 OK 6. MSRP 200 OK * 7.  SIP BYE  Figure 21: Online charging for retrieving deferred messages NOTE: The last [SIP 200 OK] from the IM Client has been omitted from the figure; however it can occur at any point after the [SIP BYE] is received from IM Server.  1. The IM Server receives a [SIP INVITE] from IM Client. 2. The Charging Enabler User in the IM Server receiving a [SIP INVITE] message SHALL trigger a CH-2 Initial Request (reserve units) message towards the Charging Enabler for credit reservation.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 38 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 3. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit reservation. 4. The IM Server confirms with a [SIP 200 OK]. 5. The IM Server sends one or more [MSRP SEND] containing the deferred messages to the IM Client. 6. The IM Client responds with one or more [MSRP 200 OK]. 7. The IM Server sends a [SIP BYE] to the IM Client. 8. The Charging Enabler User in the IM Server SHALL trigger a CH-2 Termination Request (debit units) message towards the Charging Enabler for used units to be debited in the following cases: - a [MSRP 200 OK] or an MSRP error message has been received - a timeout for the response message has been reached. 9. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation.  6.3.2.7 Deferred Message Push  IM  Client  Charging Enabler  8.  SIP 200 OK IM  Server 7. SIP INVITE 9. MSRP SEND * 10. MSRP 200 OK * 11.  SIP BYE 12. CH-2 Termination Request (debit units) 13. CH-2 Response 1.  SIP REGISTER 2.  SIP 200 OK 3.  SIP PUBLISH 4.  SIP 200 OK 5. CH-2 Initial Request (reserve units) 6. CH-2 Response  Figure 22: online charging for pushing deffered messages OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 39 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] NOTE: The last [SIP 200 OK] response from the IM Client has been omitted from figure; however can occur at any point after the [SIP BYE] is sent to the IM Client. 1. The IM Server receives a [SIP REGISTER] from the IM Client, this third-party register  is optional but very common. 2. The IM Server acknowledges with a [SIP 200 OK]. 3. THE IM Server receives a [SIP PUBLISH] of IM Service settings from the IM Client. 4. The IM Server acknowledges with a [SIP 200 OK]. 5. The Charging Enabler User receiving [SIP PUBLISH] message SHALL trigger a CH-2 Initial Request (reserve units) message towards the Charging Enabler for credit reservation.  6. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit reservation. 7. The IM Server sends a [SIP INVITE] to the IM Client.  8. The IM Server receives a confirmation [SIP 200 OK] from the IM Client. 9. The IM Server sends one or more [MSRP SEND] containing the deferred message(s). 10. The IM Server receives one or more [MSRP 200 OK] from the IMClient. 11. The IM Server sends a [SIP BYE] to the IM Client.  12. The Charging Enabler User in the IM Server SHALL trigger a CH-2 Termination Request (debit units) message towards the Charging Enabler for used units to be debited in the following cases: - all  responses have been received ([MSRP 200 OK] or MSRP error message) - a timeout for the response message has been reached. 13. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 40 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6.3.3 Online Charging for IM sessions 6.3.3.1 Successful one-to-one IM session Establishment Figure 23 shows the Charging Request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for IM session establishment originated by an IM Client.  IM  Client  Charging Enabler IM Server 1. SIP INVITE 2. CH-2 Initial Request (reserve units) 3. CH-2 Response 6. SIP 200 OK 4. SIP INVITE 5. SIP 200 OK  Figure 23: Online Charging for IM Session Establishment 1. The IM Server receives a [SIP INVITE] from the IM Client. 2. The Charging Enabler User in the IM Server receiving a [SIP 200 OK] SHALL trigger a CH-2 Initial Request (reserve units) message towards the Charging Enabler to reserve the units and start the charging session. 3. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit reservation. 4. The IM Server forwards the [SIP INVITE] to the recipient. 5. The IM Server receives a confirmation [SIP 200 OK].  6. The IM Server forwards the [SIP 200 Ok] to the IM Client. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 41 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6.3.3.2 Successful conference IM session Establishment Figure 24 shows the Charging Request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for IM session establishment originated by an IM Client.  IM  Client  Charging Enabler IM server 1. SIP INVITE 2. CH-2 Initial Request (reserve units) 3. CH-2 Response 5. SIP INVITE * 6. SIP 200 OK * 4. SIP 200 OK   Figure 24: Online Charging for Conference IM Session Establishment 1. The IM Server receives a [SIP INVITE] from the IM Client. 2. The Charging Enabler User in the IM Server receiving a [SIP INVITE] SHALL trigger a CH-2 Initial Request (reserve units) message towards the Charging Enabler to reserve the units and start the charging session. 3. The Charging Enabler acknowledges with a CH-2 Response message including the result of the credit reservation. 4. The IM Server acknowledges the [SIP INVITE] with a [SIP 200 OK] to the IM Client. 5. The IM Server forwards the [SIP INVITE] to the recipients. 6. The IM Server receives confirmation [SIP 200 OK]. 6.3.3.3 Joining or departure of a conference participant Figure 25 shows the online charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for the joining or departure of a conference participant.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 42 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] More SIP signalling 2. CH-2 Update Request   1.  200 OK / BYE Charging Enabler  3. CH-2 Response   IM Client IM server   Figure 25: Online Charging for joining or departure of a conference participant 1. SIP 200 OK (in response to a Server SIP INVITE or SIP BYE) or BYE request are sent to the IM Server. 2. The Charging Enabler User in the IM Server receiving a [SIP 200OK] message or a [SIP BYE] message SHALL trigger a CH-2 Update Request message towards the Charging Enabler to debit the used units and reserve new units. 3. The Charging Enabler acknowledges with a CH-2 Response message. 6.3.3.4 Session modification Figure 26 shows the online Charging Request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for session modification. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 43 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 2.CH-2 Update Request 4. SIP 200 OK Charging Enabler  3. CH-2 Response 1. SIP re-INVITE 6. SIP 200 OK* 5. SIP re-INVITE*  IM Client IM server   Figure 26: Online Charging for session modification 1. The IM Server receives a [SIP re-INVITE] from IM client.  2. The Charging Enabler User in the IM Server receiving a [SIP re-INVITE] SHALL trigger a CH-2 Update Request message towards the Charging Enabler to debit the used units and reserve new units.  3. The Charging Enabler acknowledges with a CH-2 Response.  4. The IM Server confirms with a [SIP 200 OK].  5. The IM Server forwards the [SIP re-INVITE] to the recipients. 6. The IM Server receives the corresponding [SIP 200 OK] from the recipients.   OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 44 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6.3.3.5 Message exchange during a chat session Figure 27 shows the online Charging Request transactions between the Charging Enabler User in the IM Server and the Charging Enabler for message exchange during an IM session.  IM Client  Charging Enabler IM  server 1. MSRP SEND 5. CH-2 Update Request  6. CH-2 Response 2. MSRP 200 OK  3. MSRP SEND 4. MSRP 200 OK   Figure 27: Online Charging for message exchange during IM session 1. The IM Server receives a [MSRP SEND] from the IM Client. 2. The IM Server acknowledges with a [MSRP 200 OK]. 3. The IM Server forwards the [MSRP SEND] to the recipient. 4. The recipient confirms with a [MSRP 200 OK]. 5. The Charging Enabler User in the IM Server MAY trigger a CH-2 Update Request message towards the Charging Enabler to debit the used units and reserve new units in the following cases :  - a [MSRP 200 OK] or a MSRP error message has been received - a timeout for the response message has been reached. 6. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation.  Note that the trigger for sending CH-2 Update Request message depends on the interim interval received from the Charging Enabler. However, to prevent the generation of a heavy charging traffic, the trigger configuration should lead to a reasonable sending frequency.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 45 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 6.3.3.6 IM Session end The closing of a session can either be at the initiative of the IM Server or the IM Client. Figure 28 shows the online charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler when the IM session is closed at the initiative of the IM Client.  IM Client  Charging Enabler IM  server 1. SIP BYE 2. CH-2 Termination Request (debit units)  3. CH-2 Response  Figure 28: Online Charging for IM Session end (client terminating) NOTE: The last [SIP 200 OK] response from the IM Server has been omitted from figure; however can occur at any point after the [SIP BYE] is received by the IM Server. 1. The IM Server receives a [SIP BYE] from the IM Client. 2. The Charging Enabler User in the IM Server receiving the [SIP BYE] message SHALL trigger a CH-2 Termination Request (debit units) message towards the Charging Enabler to debit the used units and close the charging session. 3. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation.  Figure 29 shows the online charging request transactions between the Charging Enabler User in the IM Server and the Charging Enabler when the IM session is closed at the initiative of the IM Server. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 46 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  IM Client  Charging Enabler IM  server 1. SIP BYE 2. CH-2 Termination Request (debit units)  3. CH-2 Response  Figure 29: Online Charging for IM Session end (Server terminating) NOTE: The last [SIP 200 OK] response from the IM Client has been omitted from figure; however can occur at any point after the [SIP BYE] is received by the IM Client. 1. The IM Server sends a [SIP BYE] to the IM Client. 2. The Charging Enabler User in the IM Server sending the [SIP BYE] message SHALL trigger a CH-2 Termination Request (debit units) message towards the Charging Enabler to debit the used units and close the charging session. 3. The Charging Enabler acknowledges with a CH-2 Response including the result of the debit operation. 6.3.3.7 Participant number based online charging for session owner Figure 30 shows the charging request transactions between IM Server and Charging Enabler in Participant number based charging for session owner. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 47 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I]  IM Client  Charging Enabler IM  server 1. SIP INVITE 2. CH-2 Initial Request (Reserve units)  3. CH-2 Response 4. SIP INVITE 5. SIP 200 OK/BYE 6. CH-2 Update Request  7. CH-2 Response  Figure 30: Participant number based Online Charging for session owner 1. IM Client sends [SIP INVITE] message to IM Server to create a multi-participants session. 2. IM Server sends initial CH-2 Initial Request to the Charging Enabler with pre-defined group participant number for quota reservation. In case of Ad-hoc session, IM Server sends initial CH-2 Initial Request for quota reservation with initially invited participant number. 3. The Charging Enabler acknowledges with a CH-2 Response message to IM Server with trigger type as CHANGE_IN_PARTICIPANTS_NMB or CHANGE_IN_ THRSHLD_OF_PARTICIPANTS_NMB. 4.  IM Server forwards the [SIP INVITE] request. OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 48 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 5. During the session ongoing, participant can send [SIP 200 OK] or [SIP BYE] to IM Server when joining or leaving the session. 6. In case the trigger type is CHANGE_IN_PARTICIPANTS_NMB, the IM Server SHALL trigger a CH-2 Update Request toward the Charging Enabler with the changed number of participants each time a participant is joining or leaving the conference.  In case the trigger type is CHANGE_IN_ THRSHLD_OF_PARTICIPANTS_NMB the IM Server SHALL trigger a CH-2 Update Request toward the Charging Enabler with the changed number of participants only when the threshold is reached. 7. The Charging Enabler acknowledges with a CH-2 Response message to IM Server.  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 49 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] 7. Definition of charging information 7.1 Mapping of IM parameters to OMA charging data elements IM specific charging information is provided within the IM Information. The detailed structure of the IM-Information can be found in Error! Reference source not found..  IM Field Name Category Type Description OMA Charging Data Element Value: SIMPLE_IM@openmobilealliance.org  OM String Fixed value to identify the service specification in the context of which the charging events must be interpreted. Service Context Id IM Server Role OM Enumerated  Identifies the IM Server function as participating function (0), controlling function (1). Role of node IM User Role OC Enumerated  Identifies if the IM user is the owner of the session (0) or the normal participant (1) Role of User IM Messaging Service OM Enumerated Identifies the type of the IM session as: Pager mode (0), Large message mode (1), Session mode (2), conversation history (3),  Service Identifier IM Message Service Type OC Enumerated Identifies the type of the service as  Sending (0), Receiving (1), Retrieval (2), Inviting (3), Leaving (4), Joining (5). Application Service Type Number of Participants OC Integer Indicates the number of invited parties of the IM session when included in the initial charging request message. When included in interim / update charging messages, it indicates the number of parties currently who are attached to the session at the time the interim / update charging messages are sent. Number Of Participants List Of Participants OC String Holds the information for participants, e.g., the addresses. Participant Group Called Party Address OC String The address of the participants can be of the following type: - SIP URI - TEL URI Called Party Address IM Server Identity OC String   Identifies the IM Server  Application Server Id IM Group Name OC String   Identifies a pre-defined group  Group Name IM Session Id OC Integer Uniquely identifies an IM session.  Application Session Id  Served Party OM String  Holds the identity of the party that the charging information relates to.  Subscription Id OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 50 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] IM Field Name Category Type Description OMA Charging Data Element Inter Operator Identifier OC Integer The IOI identifies both originating and terminating networks involved in a session/transaction. The IOI may be generated from each side of session/transaction to identify the home networks associated with each side. The orig-ioi and term-ioi parameters of P-Charging-Vector represent the originating and terminating operator identifiers. For further information regarding the composition and usage of the orig-ioi and term-ioi parameters refer to RFC 3455 Inter Operator Identifier Access Network Identifier OC String This identifies the access network and may be populated if available. Access Network Charging Identifier Value MSRP info OC Group Identifies the information of MSRP message Message Body      Content Type OC String Identifies the content type of the message  Content Type      Message Size OC Integer Identifies the content summary delivered in MSRP  Content Length Delivery status OC String Identifies if the message is successfully or unsuccessfully sent Delivery Status Total Number of messages sent OC Integer Identifies the total Number of messages (incremental) sent during a specified time interval within an IM session by a single user. It also applies to number of messages sent when not within an IM session. (see Appendix B for examples) Total number of messages sent Total Number of messages exploded OC Integer Number of exploded message is number of messages sent multiplied by number of recipients. Identifies the total Number of messages (incremental) exploded during a specified time interval within an IM session on behalf of a single sender. It also applies to number of messages exploded when not within an IM session. (see Appendix B for examples) Total number of messages exploded Number of messages successfully sent  OC Integer Identifies the total Number of messages successfully sent by a user during a portion of an IM session. (see Appendix B for examples) Number of messages successfully sent OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 51 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] IM Field Name Category Type Description OMA Charging Data Element Number of messages successfully exploded  OC Integer Identifies the total Number of messages successfully exploded on behalf of a user during a portion of an IM session. (see Appendix B for examples) Number of messages successfully exploded Charging Correlation Identifier OC Integer Identifies the correlation information to correlate with bearer network. It can be populated from 'icid-value', a mandatory part of the P-Charging-Vector and coded as a text-based UTF-8 charset (as are all SIP messages). For further information regarding the composition and usage of the P-Charging-Vector refer RFC 3455 [reference code xxx] Application Charging Identifier SIP Method OC  Specifies the SIP-method for which the CDR is generated. Only available in session unrelated cases.  SIP Method Expires Information OC  This field indicates the validity time of either the SIP message or its content, depending on the SIP method. Expires Service Request Time Stamp OM  This field contains the time stamp which indicates the time at which the service was requested. This parameter corresponds to SIP Request Timestamp. Present with Charging Data Request [Start] and Charging Data Request [Event]. Event Timestamp Service Delivery Start Time Stamp OM  This field holds the time stamp reflecting either: successful session set-up, a delivery unrelated service, an unsuccessful session set-up and an unsuccessful session unrelated request. This parameter corresponds to SIP Response Timestamp. Present with Charging Data Request [Start] and Charging Data Request [Event]. SIP Request Timestamp Service Delivery End Time Stamp OC  This field records the time at which the service delivery was terminated. It is Present only in SIP session related case. This parameter corresponds to SIP Request Timestamp.  Present with Charging Data Request [Stop]. SIP Response Timestamp Service Reason Return Code OM  This parameter provides the returned SIP status code for the service request for the successful and failure case, Cause Code Table 3: Structure of the IM_Information  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 52 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] Appendix A. Change History (Informative) A.1 Approved Version 1.0 History Reference Date Description OMA-TS-SIMPLE_IM_Charging-V1_0-20120807-A 07 Aug 2012 Status changed to Approved by TP:   OMA-TP-2012-0298-INP_SIMPLE_IM_V1_0_ERP_for_Final_Approval  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 53 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] Appendix B.  These examples clarify the meaning of the following parameters : Total Number of messages sent,  Total Number of messages exploded, Number of messages successfully sent, Number of messages successfully exploded. These charging parameters were defined for performance reasons e.g. to avoid having to send a charging record for every single message sent. For IM sessions, these charging parameters are incremental e.g. they contain the addition of all messages sent during a certain period of time. When the charging record is sent to the charging enabler, the counter is reset to 0.  B.1 Example 1 A participant to an IM session containing 11 participants (including himself) sends 5 messages in an IM session. Of the 10 receivers, 8 participants receive the messages successfully. 2 participants don’t receive any messages.  After the first message Total Number of messages sent 1 Total Number of messages exploded 10 Number of messages successfully sent  1 Number of messages successfully exploded  8  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 54 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] After 5 messages  Total Number of messages sent 5 Total Number of messages exploded 50 Number of messages successfully sent  5 Number of messages successfully exploded  40  After this, a charging record may be sent to the charging enabler, containing the above charging parameters. The charging parameters mentioned above are reset to 0. The accumulation (grand total of messages) is made by the charging enabler.   B.2 Example 2 A participant to an IM session containing 11 participants (including himself) sends 5 messages in an IM session. 4 of the 5 messages succeed, e.g. they are received successfully by at least one receiver, e.g. 8 participants receive the message successfully, 2 participants don’t receive the message. 1 of the 5 messages fails, e.g. the message is not received by any of the participants.  After 5 messages Total Number of messages sent 5 Total Number of messages exploded 50 Number of messages successfully sent  4 Number of messages successfully exploded  32  B.3 Example 3 A participant to an IM session sends 5 messages in an IM session. Some participants are joining later. e.g.  When sending the first 2 messages, there are 6 participants in the session. When sending the next 3 messages, there are 11 participants in the session.  After 5 messages Total Number of messages sent 5 Total Number of messages exploded 5+5+10+10+10 = 40 Number of messages successfully sent  5 OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 55 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] Number of messages successfully exploded  5+5+10+10+10 = 40   B.4 Example 4 A user sends a pager mode message to a uri-list containing 10 people. 8 of them receive the message successfully. Result Total Number of messages sent 1 Total Number of messages exploded 10 Number of messages successfully sent  1 Number of messages successfully exploded  8  B.5 Example 5 A user sends a pager mode message to a uri-list containing 10 people. None of them receive the message successfully. Result Total Number of messages sent 1 Total Number of messages exploded 10 Number of messages successfully sent  0 Number of messages successfully exploded  0  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 56 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] Appendix C. Static Conformance Requirements (Normative) C.1 SCR for IM Charging Item Function Reference Status Requirement CRG-S-001 The IM Server SHALL support the generation of charging information as defined in section 7.1  7.1 M  CRG-S-002 The IM Server SHOULD support Offline charging. 5, 6.2 O  CRG-S-003 The IM Server SHOULD support Online charging. 5, 6.3 O  CRG-S-004 The IM Sever SHOULD support generation of charging information for Pager mode message 6.2.2.1, 6.3.2.1 O  CRG-S-005 The IM Server SHOULD support generation of charging information for Pager mode to an adhoc or pre-defined group 6.2.2.2, 6.3.2.2 O  CRG-S-006 The IM Server SHOULD support generation of charging information for large message mode. 6.2.2.3, 6.3.2.3 O  CRG-S-007 The IM Server SHOULD support generation of charging information for large message to an ad-hoc or predefined group.  6.2.2.4, 6.3.2.4 O  CRG-S-008 The IM Server SHOULD support generation of charging information for conversation History Retrival. 6.2.2.5, 6.3.2.5 O  CRG-S-009 The IM Server SHOULD support generation of charging information for Deferred Message Retrieval. 6.2.2.6, 6.3.2.6  O  CRG-S-010 The IM Server SHOULD support generation of charging information for Deferred message push 6.2.2.7, 6.3.2.7 O  CRG-S-011 The IM Server SHOULD support 6.2.3.1, 6.3.3.1 O  OMA-TS-SIMPLE_IM_Charging-V1_0-20080903-C  Page 57 (57)  2012 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document.                     [OMA-Template-Spec-20120101-I] Item Function Reference Status Requirement generation of charging information for successful one-to-one IM Session Establishment CRG-S-012 The IM Server SHOULD support  generation of charging information for successful IM Session Establishment. 6.2.3.2, 6.3.3.2 O  CRG-S-013 The IM Server SHOULD support the generation of charging information for joining or departure of a conference participant. 6.2.3.3, 6.3.3.3 O  CRG-S-014 The IM Server SHOULD support generation of charging information IM Session modification. 6.2.3.4, 6.3.3.4 O  CRG-S-015 The IM Server SHOULD support generation of charging information for IM Session message exchange. 6.2.3.5, 6.3.3.5 O  CRG-S-016 The IM Server SHOULD support generation of charging information for IM Session END. 6.2.3.6, 6.3.3.6 O  CRG-S-017 The IM Server SHOULD support generation of charging information based on the number of participant in an IM Session 6.3.3.7 O  C.2 SCR for IM Charging Interconnection Item Function Reference Status Requirement CRG-I-001 The IM Server SHOULD support relevant information for the purpose of clearing, charging and payment of service between operators and service providers. 7.1 O"}]}}