{"input":{"cteatedAt":"2021-02-17T21:27:50.056Z","url":"http://www.openmobilealliance.org/release/BCAST/V1_1-20090324-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/BCAST/V1_1-20090324-C/OMA-ERELD-BCAST-V1_1-20090324-C.pdf","file":"OMA-ERELD-BCAST-V1_1-20090324-C.pdf","status":"Candidate","version":"V1.1","date":"2009-03-24","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Mobile Broadcast Services (BCAST)  according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/BCAST/V1_1-20090324-C/OMA-ERP-BCAST-V1_1-20090324-C.zip","file":"OMA-ERP-BCAST-V1_1-20090324-C.zip","status":"Candidate","version":"V1.1","date":"2009-03-24","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/BCAST/V1_1-20090324-C/OMA-RD-BCAST-V1_1-20090324-C.pdf","file":"OMA-RD-BCAST-V1_1-20090324-C.pdf","status":"Candidate","version":"V1.1","date":"2009-03-24","contentMediaType":"application/pdf","description":"The overall goal of the Mobile Broadcast Service is to define an end-to-end framework. This document covers requirements on both existing and new enablers. For existing enablers, this may involve enhancements or extensions to make them broadcast capable. The use cases contained in chapter 5 of this document provide examples of Mobile Broadcast Services that should be enabled. The requirements contained in chapter 6 of this document address the whole end-to-end framework for Mobile Broadcast, and are structured along the following functions of the Mobile Broadcast Services Enabler: service discovery, service guide, provisioning, content and service protection, real-time streaming distribution, file distribution, and charging. The enablers must be bearer independent in order to be useful for a diverse and heterogeneous infrastructure. The development of an enabler for Mobile Broadcast Services will consider a broad set of stakeholders from various industries, the varied business links between them, and may take into account any existing infrastructure."}]}}