{"input":{"cteatedAt":"2021-02-18T15:24:34.573Z","url":"http://www.openmobilealliance.org/release/XDM_PRS_IMPL/V1_0-20080627-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/XDM_PRS_IMPL/V1_0-20080627-C/OMA-RRELD-XDM_PRS_IMPL-V1_0-20080627-C.pdf","file":"OMA-RRELD-XDM_PRS_IMPL-V1_0-20080627-C.pdf","status":"Candidate","version":"V1.0","date":"2008-06-27","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of the XDM 1. 1 and Presence SIMPLE 1.1 Implementation Guidelines version 1.0 according to OMA Release process and the Reference Release document baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/XDM_PRS_IMPL/V1_0-20080627-C/OMA-RRP-XDM_PRS_IMPL-V1_0-20080627-C.zip","file":"OMA-RRP-XDM_PRS_IMPL-V1_0-20080627-C.zip","status":"Candidate","version":"V1.0","date":"2008-06-27","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/XDM_PRS_IMPL/V1_0-20080627-C/OMA-WP-PRS_1_1_Implementation_Guidelines-20080627-C.pdf","file":"OMA-WP-PRS_1_1_Implementation_Guidelines-20080627-C.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"The goal of this document is to provide guidelines to designers for the implementation of the Presence SIMPLE Version 1.1 enabler [PRS_ERELD]. The intention is not to replace or extend the Presence SIMPLE Version 1.1 specifications but rather to describe good practices or valuable design choices in order to help interoperability and migration between different implementations.  This document does not contain any new requirements in addition to [PRS_ERELD]. The guidelines consist of a number of recommendations on how to solve design issues in certain situations or real life examples for particular Presence SIMPLE Version 1.1 features."},{"url":"http://www.openmobilealliance.org/release/XDM_PRS_IMPL/V1_0-20080627-C/OMA-WP-XDM_1_1_Implementation_Guidelines-20080627-C.pdf","file":"OMA-WP-XDM_1_1_Implementation_Guidelines-20080627-C.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"The goal of this document is to provide guidelines to designers for the implementation of the XDM Version 1.1 enabler [XDM_ERELD]. The intention is not to replace or extend the XDM Version 1.1 specifications but rather to describe good practices or valuable design choices in order to help interoperability and migration between different implementations. This document does not contain any new requirements in addition to [XDM_ERELD]. The guidelines consist of a number of recommendations on how to solve design issues in certain situations or real life examples for particular XDM Version 1.1 features."}]}}