{"input":{"cteatedAt":"2021-02-17T21:33:31.219Z","url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/OMA-ERELD-Browser_Protocol_Stack-V2_1-20110315-A.pdf","file":"OMA-ERELD-Browser_Protocol_Stack-V2_1-20110315-A.pdf","status":"Approved","version":"V2.1","date":"2011-03-15","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of the Browser Protocol Stack according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/OMA-ERP-Browser_Protocol_Stack-V2_1-20110315-A.zip","file":"OMA-ERP-Browser_Protocol_Stack-V2_1-20110315-A.zip","status":"Approved","version":"V2.1","date":"2011-03-15","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/OMA-WAP-TS-WSP-V1_0-20110315-A.pdf","file":"OMA-WAP-TS-WSP-V1_0-20110315-A.pdf","status":"Approved","version":"V1.0","date":"2011-03-15","contentMediaType":"application/pdf","description":""},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/WAP-159-WDPWCMPAdapt-20010713-a.pdf","file":"WAP-159-WDPWCMPAdapt-20010713-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document specifies the WDP and WCMP adaptation over the underlying access protocol between a WAP Proxy Server and a Wireless Data Gateway (such as an SMSC or a USSD server). The tunnel protocol in the WAP architecture is based on a subset of the Short Message Peer-to-Peer Protocol (SMPP), version 3.4. SMPP includes support for the SMS bearer service (across the various network types) and the USSD bearer service (GSM network only). This document details the elements of the SMPP protocol that are required and sufficient for carrying WDP and WCMP data units between a WAP Proxy Server and a Wireless Data Gateway. The Wireless Data Gateway is responsible for relaying the WDP and WCMP data units to and from the WAP capable wireless device (such as a mobile station). Figure 1.1 shows a general model of the WAP protocol architecture and how SMPP fits into that architecture. SMS -TLWDP/WCMPAdaptationWTPWSPWAESMS - TLSubnetworkSMPPSubnetworkSMPPWSPWAEApps onother serversWireless Data GatewayWAPProxy ServerMobileWDP/WCMPAdaptationWTPIWFWTLSAdaptWTLSAdapt Figure 1.1 SMPP Tunnel in the WAP Architecture"},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/WAP-187-TransportE2ESec-20011009-a.pdf","file":"WAP-187-TransportE2ESec-20011009-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAPTM) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAP]. A need to provide end-to-end secure applications for e-commerce, corporate access, etc has emerged in WAP. It is generally recognised that the end-to-end problem as defined in section 5 below can be solved either at the transport layer or at the application layer. This specification is only concerned with the transport layer end-to-end security solution."},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/WAP-196-ClientID-20010409-a.pdf","file":"WAP-196-ClientID-20010409-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAP]. This specification defines identifiers for WAP clients, the Client ID, which provide a means for a WAP client to identify itself to the WAP proxy. The goal of this specification is to define the format for the Client ID. This specification does not define a means for authentication, but it simply defines an identifier format for a device."},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/WAP-202-WCMP-20010624-a.pdf","file":"WAP-202-WCMP-20010624-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"The Transport layer protocol in the WAP architecture consists of the Wireless Transaction Protocol (WTP) and the Wireless Datagram Protocol (WDP). The WDP layer operates above the data capable bearer services supported by the various network types. As a general datagram service, WDP offers a consistent service to the upper layer protocols (Security, Transaction and Session) of WAP and communicates transparently over one of the available bearer services. This document specifies the error reporting mechanism for WDP datagrams, the Wireless Control Message Protocol (WCMP). WCMP contains control messages that resemble the Internet Control Message Protocol (ICMP) [RFC792] [RFC2463] messages. WCMP can also be used for diagnostics and informational purposes."},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/WAP-204-WAPOverGSMUSSD-20010813-a.pdf","file":"WAP-204-WAPOverGSMUSSD-20010813-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document describes the mapping of WAP onto GSM Unstructured Supplementary Service Data (USSD) phase 2. The document includes a brief description of GSM USSD. For a complete description refer to [GSM0290], [GSM0390] and [GSM0490].  The GSM USSD service lack some fundamental services needed in order to use it as a bearer of the WAP protocols, and other applications with similar communication need. For example, the GSM USSD service is half-duplex and does not carry a destination address (only the MSISDN of the mobile phone). The USSD Dialogue Control Protocol (UDCP) has been defined in order to overcome these limitations. UDCP is specified in this document. The UDCP protocol is not part of the GSM Specifications from ETSI."},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/WAP-224-WTP-20020827-a.pdf","file":"WAP-224-WTP-20020827-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"A transaction protocol is defined to provide the services necessary for interactive \"browsing\" (request/response) applications. During a browsing session, the client requests information from a server, which MAY be fixed or mobile, and the server responds with the information. The request/response duo is referred to as a \"transaction\" in this document. The objective of the protocol is to reliably deliver the transaction while balancing the amount of reliability required for the application with the cost of delivering the reliability. WTP runs on top a datagram service and optionally a security service. WTP has been defined as a light weight transaction oriented protocol that is suitable for implementation in \"thin\" clients (mobile stations) and operates efficiently over wireless datagram networks. The benefits of using WTP include: • Improved reliability over datagram services. WTP relieves the upper layer from re-transmissions and acknowledgements which are necessary if datagram services are used. • Improved efficiency over connection oriented services. WTP has no explicit connection set up or teardown phases. • WTP is message oriented and designed for services oriented towards transactions, such as “browsing”."},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/WAP-225-TCP-20010331-a.pdf","file":"WAP-225-TCP-20010331-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"Wireless Application Protocol (WAPTM) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of open, extensible protocols and content formats as a basis for interoperable implementations. The WAP Architecture Specification [ARCH] defines a Transport Services Layer that provides datagram and connection-oriented services to the upper layer protocols; Wireless Profiled TCP (WP-TCP) provides the connection-oriented services. The inclusion of TCP has been motivated by the emergence of high-speed wireless networks (e.g. 2.5G and 3G). Some of the benefits provided by TCP include Large Data Transfer, End-to-End Security (using TLS) and convergence with IETF protocols. Wireless Profiled TCP is optimised for wireless environments and can interoperate with standard TCP [RFC0793] [RFC1122] implementations in the Internet. The Wireless Profiled TCP Specification is independent of the IP version supported by the underlying bearers."},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/WAP-229-HTTP-20011031-a.pdf","file":"WAP-229-HTTP-20011031-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"The Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the WAP Forum is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of open, extensible protocols and content formats as a basis for interoperable implementations. The objectives of the WAP Forum are: • To bring Internet content and advanced data services to digital cellular phones and other wireless terminals. • To create a global wireless protocol specification that will work across differing wireless network technologies. • To  enable  the  creation  of  content  and  applications that  scale  across  a  very  wide  range  of  bearer  networks  and  device types. • To embrace and extend existing standards and technology wherever appropriate. As part of the evolution of the WAP Specifications, WPG has decided to converge the WAP stack with key internet protocols defined by the IETF. This involves the inclusion of the following protocols to the WAP stack • HTTP [RFC2616] • TLS Profile and Tunnelling [WAPTLS] • Wireless Profiled-TCP [WTCP] The scope of this document is the Transfer Services Layer which provides for the structured transfer of rich information between network elements [WAPARCH].   The scope of this document is to define a protocol independent service access point to the Transfer Services layer, specifically Hypermedia Transfer, for use by the upper-level application layer of WAP and to define the profile of HTTP 1.1 [RFC2616], i.e. the features and functionality, to be provided by the layer. It is not the intention of this document to define support for other transfer layer services such as Streaming and Messaging."},{"url":"http://www.openmobilealliance.org/release/Browser_Protocol_Stack/V2_1-20110315-A/WAP-259-WDP-20010614-a.pdf","file":"WAP-259-WDP-20010614-a.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"The Transport layer protocol in the WAP architecture consists of the Wireless Transaction Protocol (WTP) and the Wireless Datagram Protocol (WDP). The WDP layer operates above the data capable bearer services supported by the various network types. As a general datagram service, WDP offers a consistent service to the upper layer protocol (Security, Transaction and Session) of WAP and communicate transparently over one of the available bearer services. The protocols in the WAP family are designed for use over narrowband bearers in wireless telecommunications networks. Since the WDP protocols provide a common interface to the upper layer protocols (Security, Transaction and Session layers) , they are able to function independently of the underlying wireless network. This is accomplished by adapting the transport layer to specific features of the underlying bearer."}]}}