{"input":{"cteatedAt":"2021-02-18T12:38:44.676Z","url":"http://www.openmobilealliance.org/release/PAL/V1_0-20090728-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/PAL/V1_0-20090728-C/OMA-ERELD-PAL-V1_0-20090728-C.pdf","file":"OMA-ERELD-PAL-V1_0-20090728-C.pdf","status":"Candidate","version":"V1.0","date":"2009-07-28","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Presence Access Layer Version 1.0 according to OMA Release process and the Enabler Release specification baseline listed in section 5.  OMA-ERELD-PAL-V1_0-20090709-D  2009 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20090101-I] 2.  References 2.1     Normative References [PAL_RD] “Presence Access Layer Requirements” Version 1.0, Open Mobile Alliance,  OMA-RD-PAL-V1_0,                                                                                                                                   URL:http://www.openmobilealliance.org/ [RFC2119] “Key words for use in RFCs to Indicate Requirement Levels”, S. Bradner, March 1997, URL:http://www.ietf.org/rfc/rfc2119.txt [SCRRULES] “SCR Rules and Procedures”, Open Mobile Alliance™, OMA-ORG-SCR_Rules_and_Procedures, URL:http://www.openmobilealliance.org/ 2.2     Informative References  [OMADICT] “Dictionary for OMA Specifications”, Version 2.8, Open Mobile Alliance™, OMA-ORG-Dictionary-V2_8, URL:http://www.openmobilealliance.org/ OMA-ERELD-PAL-V1_0-20090709-D  2009 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20090101-I] 3.  Terminology and Conventions 3.1     Conventions The key words “MUST”, “MUST NOT”, “REQUIRED”, “SHALL”, “SHALL NOT”, “SHOULD”, “SHOULD NOT”, “RECOMMENDED”, “MAY”, and “OPTIONAL” in this document are to be interpreted as described in [RFC2119]. All sections and appendixes, except “Scope”, \"Release Version Overview\" and “Conformance Requirements Notation Details”, are normative, unless they are explicitly indicated to be informative. The formal notation convention used in sections 8 and 9 to formally express the structure and internal dependencies between specifications in the Enabler Release specification baseline is detailed in [SCRRULES]. 3.2     Definitions Enabler Release Collection of specifications that combined together form an enabler for a service area, e.g. a download enabler, a browsing enabler, a messaging enabler, a location enabler, etc.  The specifications that are forming an enabler should combined fulfil a number of related market requirements. Minimum Functionality Description Description of the guaranteed features and functionality that will be enabled by implementing the minimum mandatory part of the Enabler Release. PAL Client Use definition from [PAL_RD]. PAL Profile Use definition from [PAL_RD]. PAL Service Use definition from [PAL_RD]. Presence Aspects Use definition from [PAL_RD]. Presence Context Use definition from [PAL_RD]. Presence Triggers Use definition from [PAL_RD]. 3.3     Abbreviations ERDEF Enabler Requirement Definition ERELD Enabler Release Definition OMA Open Mobile Alliance OMNA Open Mobile Naming Authority PAL Presence Access Layer OMA-ERELD-PAL-V1_0-20090709-D  2009 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20090101-I] 4.  Release Version Overview 4.1     Version 1.0 Functionality The Presence Access Layer (PAL) Enabler complements OMA Presence SIMPLE.  PAL specifies logically interoperable abstractions known as Presence Aspects.  Presence Aspects consolidate presence information based on one or more Presence Information Elements.  PAL Presence Aspects are based on underlying rules that fully align with OMA Presence SIMPLE and Implementation Guidelines for OMA Presence SIMPLE.  Further, Presence Triggers provide a mechanism for a presence aware service to execute a specified action (also specified by rules) when a change is detected for a corresponding Presence Aspect. PAL Presence Context associates applicable presence aspects required to fulfill service function points with a presence aware service.  This provides PAL Client’s with a consolidated and determinate view of presence information.  That is, a PAL Client need only interact with a specific subset of interoperable Presence Aspects and/or Presence Triggers as specified by the resolved Presence Context, for a given presence aware service or class of service. The PAL Enabler includes the following features: • PAL Client interraction including common interoperable Presence Aspects, and Presence Triggers based on consolidated presence information; • Establish and resolve Presence Context associated with a presence aware service; • Interworking with information owning enablers (e.g. OMA Presence SIMPLE); • Privacy and security of information sources, and clients; AND • Configuration and administration based on PAL Profiles. OMA-ERELD-PAL-V1_0-20090709-D  2009 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20090101-I] 5.  Document Listing for Presence Access Layer This section is normative. Doc Ref Permanent Document Reference Description Requirement Document [PAL_RD] OMA-RD-PAL-V1_0-20090728-C Requirement Document for PAL Enabler Architecture Document    Technical Specifications    Supporting Files    Table 1: Listing of Documents in PAL Enabler  OMA-ERELD-PAL-V1_0-20090709-D  2009 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20090101-I] 6.  OMNA Considerations OMA-ERELD-PAL-V1_0-20090709-D  2009 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20090101-I] 7.  Conformance Requirements Notation Details This section is informative   The tables in following chapters use the following notation: Item: Entry in this column MUST be a valid ScrItem according to [SCRRULES]. Feature/Application: Entry in this column SHOULD be a short descriptive label to the Item in question. Requirement: Expression in the column MUST be a valid TerminalExpression according to [SCRRULES] and it MUST accurately reflect the architectural requirement of the Item in question.  OMA-ERELD-PAL-V1_0-20090709-D  2009 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20090101-I] 8.  ERDEF for PAL - Client Requirements This section is normative. Item Feature / Application Requirement    Table 2: ERDEF for PAL Client-side Requirements  OMA-ERELD-PAL-V1_0-20090709-D  2009 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20090101-I] 9.  ERDEF for PAL - Server Requirements This section is normative. Item Feature / Application Requirement     Table 3: ERDEF for PAL Server-side Requirements  OMA-ERELD-PAL-V1_0-20090709-D  2009 Open Mobile Alliance Ltd.  All Rights Reserved. Used with the permission of the Open Mobile Alliance Ltd. under the terms as stated in this document. [OMA-Template-ERELD-20090101-I] Appendix A. Change History (Informative) A.1    Approved Version History Reference Date Description n/a n/a No prior version  A.2    Draft/Candidate Version 1.0 History Document Identifier Date Sections Description Draft Versions OMA-ERELD-PAL-V1_0 05 May 2009 n/a Baseline document (OMA-PAG-PAL-2009-0030R02-INP_PAL1_0_ERELD_Intro) Replaces OMA-ERELD-PAL-V1_0-20090504-D Documents listing updated 30 Jun 2009 5 Changes to OMA-RD-PAL-V1_0 Section 5 updated to reflect this. 01 Jul 2009 5, 6, App A Changes to OMA-RD-PAL-V1_0 Section 5 updated to reflect this. Editorial clean-up. 09 Jul 2009 5 Changes to OMA-RD-PAL-V1_0 Section 5 updated to reflect this. Candidate Version OMA-ERELD-PAL-V1_0 28 Jul 2009 n/a Status changed to Candidate by TP:   TP ref# OMA-TP-2009-0328-INP_PAL_V1_0_RD_for_Candidate_Approval"},{"url":"http://www.openmobilealliance.org/release/PAL/V1_0-20090728-C/OMA-ERP-PAL-V1_0-20090728-C.zip","file":"OMA-ERP-PAL-V1_0-20090728-C.zip","status":"Candidate","version":"V1.0","date":"2009-07-28","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/PAL/V1_0-20090728-C/OMA-RD-PAL-V1_0-20090728-C.pdf","file":"OMA-RD-PAL-V1_0-20090728-C.pdf","status":"Candidate","version":"V1.0","date":"2009-07-28","contentMediaType":"application/pdf","description":"This document contains use cases and requirements for the OMA Presence Access Layer Enabler, taking into consideration the demands of end-users, service providers and system implementers."}]}}