{"input":{"cteatedAt":"2021-02-17T22:07:40.262Z","url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/OMA-ER-Device_WebAPIs-V1_0-20180724-A.pdf","file":"OMA-ER-Device_WebAPIs-V1_0-20180724-A.pdf","status":"Approved","version":"V1.0","date":"2018-07-24","contentMediaType":"application/pdf","description":"This Enabler Release (ER) document is a combined document that includes requirements, architecture and technical specification of the Device WebAPIs Enabler. The scope of OMA Device WebAPI enabler will include:  Requirements, architecture and specifications for web-based APIs to expose services available from external devices and internal enablers through Extension Plug-Ins to applications.  The web-based APIs that will work in the framework that GotAPI (Generic Open Terminal API Framework) defines, where the web-based APIs are implemented in the Extension Plug-Ins and exposing the services from the external devices or internal enablers that are connected with the Extension Plug-Ins.  The framework provided by the combination of GotAPI and Device WebAPI to enable applications to work through standardized APIs with external devices or internal enablers, as GotAPI itself does not standardize the APIs to be implemented in the Extension Plug-Ins.  Web-based APIs that will initially address such areas as healthcare devices, DWAPI-PCH (Personal Connected Healthcare) and other areas where standardization will help solving application interoperability problems. OMA will continue expanding the coverage of the standaridized Device WebAPIs in areas where standardization helps the markets to expand and innovate."},{"url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/OMA-ERELD-DWAPI-V1_0-20180724-A.pdf","file":"OMA-ERELD-DWAPI-V1_0-20180724-A.pdf","status":"Approved","version":"V1.0","date":"2018-07-24","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Device WebAPI, DWAPI 1.0, according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/OMA-ERP-DWAPI-V1_0-20180724-A.zip","file":"OMA-ERP-DWAPI-V1_0-20180724-A.zip","status":"Approved","version":"V1.0","date":"2018-07-24","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/OMA-TS-Blood_Pressure_Monitor_APIs-V1_0-20180724-A.pdf","file":"OMA-TS-Blood_Pressure_Monitor_APIs-V1_0-20180724-A.pdf","status":"Approved","version":"V1.0","date":"2018-07-24","contentMediaType":"application/pdf","description":"Body blood pressure is one of the essential vital signs of health measurements. The GotAPI provides a multi-purpose web-based framework to enable interwork of applications and external devices such as Blood Pressure Monitors. The GotAPI consists of the GotAPI Server and the Extension Plug-Ins. A smartphone application communicates with a specified Extension Plug-In through the GotAPI Server using Web technologies In the GotAPI framework, Extension Plug-Ins interact with Blood Pressure Monitors, and expose interfaces to the GotAPI Server. Thanks to the Extension Plug-Ins, smartphone applications can interact with many kinds of Blood Pressure Monitors using the consistent APIs specified in this specification. This is the technical specification part of the Blood Pressure Monitor Device WebAPIs whose requirements and architecture are defined in a separate document [DWAPI-PCH]."},{"url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/OMA-TS-Glucometer_APIs-V1_0-20180724-A.pdf","file":"OMA-TS-Glucometer_APIs-V1_0-20180724-A.pdf","status":"Approved","version":"V1.0","date":"2018-07-24","contentMediaType":"application/pdf","description":"Glucose concentration is one of the essential vital signs of health measurements. Glucose concentration measurements are critical for those patients dealing with diabetes or pre-diabetes. The GotAPI provides a multi-purpose web-based framework to enable interwork of applications and external devices such as Glucometers (glucose meter). The GotAPI consists of the GotAPI Server and the Extension Plug-Ins. A smartphone application communicates with a specified Extension Plug-In through the GotAPI Server using Web technologies In the GotAPI framework, Extension Plug-Ins interact with Glucometer, and expose interfaces to the GotAPI Server. Thanks to the Extension Plug-Ins, smartphone applications can interact with many kinds of Glucometers using the consistent APIs specified in this specification. This is the technical specification part of the Glucometer Device WebAPIs whose requirements and architecture are defined in a separate document [DWAPI-PCH]."},{"url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/OMA-TS-Heart_Rate_Monitor_APIs-V1_0-20180724-A.pdf","file":"OMA-TS-Heart_Rate_Monitor_APIs-V1_0-20180724-A.pdf","status":"Approved","version":"V1.0","date":"2018-07-24","contentMediaType":"application/pdf","description":"Heart rate is one of the essential vital signs of health measurements. The GotAPI provides a multi-purpose web-based framework to enable interwork applications and external devices such as Heart Rate Monitors. The GotAPI consists of the GotAPI Server and the Extension Plug-Ins. A smartphone application communicates with a specified Extension Plug-In through the GotAPI Server using Web technologies. In the GotAPI framework, an Extension Plug-In interacts with Heart Rate Monitors and exposes interfaces to the GotAPI Server. Thanks to Extension Plug-Ins, smartphone applications can interact with many kinds of Heart Rate Monitors using consistent APIs specified in this specification. This is the technical specification part of the Heart Rate Monitor Device Web APIs whose requirements and architecture are defined in a separate document [DWAPI-PCH]."},{"url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/OMA-TS-Pulse_Oximeter_APIs-V1_0-20180724-A.pdf","file":"OMA-TS-Pulse_Oximeter_APIs-V1_0-20180724-A.pdf","status":"Approved","version":"V1.0","date":"2018-07-24","contentMediaType":"application/pdf","description":"Pulse Oximeters provide two vital signs measurements, oxygen saturation and pulse rate. The GotAPI provides a multi-purpose web-based framework to enable interwork applications and external devices such as pulse oximeters. The GotAPI consists of the GotAPI Server and the Extension Plug-Ins. A smartphone application communicates with a specific Extension Plug-In through the GotAPI Server using Web technologies. In the GotAPI framework, an Extension Plug-In interacts with the Pulse Oximeters and exposes interfaces to the GotAPI Server. Thanks to Extension Plug-Ins, smartphone applications can interact with many kinds of Pulse Oximeters using consistent APIs specified in this specification. This is the technical specification part of the Plus Oximeter Device Web APIs whose requirements and architecture are defined in a separate document [DWAPI-PCH]."},{"url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/OMA-TS-Thermometer_APIs-V1_0-20180724-A.pdf","file":"OMA-TS-Thermometer_APIs-V1_0-20180724-A.pdf","status":"Approved","version":"V1.0","date":"2018-07-24","contentMediaType":"application/pdf","description":"Body temperature is one of the essential vital signs of health measurements. This specification defines Thermometer Device Web base APIs, “Thermometer APIs” in short in what follows. Thermometer APIs expose data collected from external thermometers to web base applications throught the interworking of Extension Plug-In with GotAPI.  Thermometer APIs expose interfaces to the applications in the GotAPI 1.1 [GotAPI1.1] framework through the GotAPI Server. With Extension Plug-Ins, smartphone applications can interact with various kinds of thermometers using the consistent APIs specified in this specification.  The APIs offer the standardization of interface and data. This is the technical specification part of the thermometer Device Web APIs whose requirements and architecture are defined in a separate document [DWAPI-PCH]."},{"url":"http://www.openmobilealliance.org/release/DWAPI/V1_0-20180724-A/OMA-TS-Weight_Scale_Body_Composition_Analyzer_APIs-V1_0-20180724-A.pdf","file":"OMA-TS-Weight_Scale_Body_Composition_Analyzer_APIs-V1_0-20180724-A.pdf","status":"Approved","version":"V1.0","date":"2018-07-24","contentMediaType":"application/pdf","description":"Body weight is one of the essential vital signs health measurements. Body composition is also important in assessing health. The GotAPI provides a multi-purpose web-based framework to enable interwork of applications and external devices such as weight scales. The GotAPI consist of the GotAPI Server and the Extension Plug-Ins. A smartphone application communicates with a specified Extension Plug-In through the GotAPI Server using Web technologies. In the GotAPI framework, Extension Plug-Ins interact with Weight Scales and/or Body Composition Analyzers, and expose interfaces to the GotAPI Server. Thanks to the Extension Plug-Ins, smartphone applications can interact with many kinds of Weight Scales and/or Body Composition Analyzers using the consistent APIs specified in this specification. This is the technical specification part of the Weight Scale and/or Body Composition Analyzer Device WebAPIs whose requirements and architecture are defined in a separate document [DWAPI-PCH]."}]}}