{"input":{"cteatedAt":"2021-02-18T13:19:19.973Z","url":"http://www.openmobilealliance.org/release/SpamRep/V1_0-20101123-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SpamRep/V1_0-20101123-C/OMA-AD-SpamRep-V1_0-20101123-C.pdf","file":"OMA-AD-SpamRep-V1_0-20101123-C.pdf","status":"Candidate","version":"V1.0","date":"2010-11-23","contentMediaType":"application/pdf","description":"This document defines the architecture for the Spam Reporting (SpamRep) enabler.  This architecture is based on the requirements and use cases described in the SpamRep Requirements Document [SpamRep-RD].  This document describes the functional entities that comprise the enabler, the interfaces between those entities, and the information flow between them."},{"url":"http://www.openmobilealliance.org/release/SpamRep/V1_0-20101123-C/OMA-ERELD-SpamRep-V1_0-20101123-C.pdf","file":"OMA-ERELD-SpamRep-V1_0-20101123-C.pdf","status":"Candidate","version":"V1.0","date":"2010-11-23","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Mobile Spam Reporting (SpamRep) enabler according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The Mobile Spam Reporting enabler allows Users to designate received Content as Spam, and send a report to an external entity containing information about that Content that may be used by the external entity to prevent further instances of unwanted Content from reaching Users. The scope of this enabler covers only the SpamRep message format and interface between User Device and the external recipient entity.  The User interface is out of scope, as is any functionality of the external entity beyond the SpamRep/Device interface."},{"url":"http://www.openmobilealliance.org/release/SpamRep/V1_0-20101123-C/OMA-ERP-SpamRep-V1_0-20101123-C.zip","file":"OMA-ERP-SpamRep-V1_0-20101123-C.zip","status":"Candidate","version":"V1.0","date":"2010-11-23","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SpamRep/V1_0-20101123-C/OMA-RD-SpamRep-V1_0-20101123-C.pdf","file":"OMA-RD-SpamRep-V1_0-20101123-C.pdf","status":"Candidate","version":"V1.0","date":"2010-11-23","contentMediaType":"application/pdf","description":"This document defines the requirements for Spam Reporting (SpamRep) functionality. A set of functional requirements is described for an enabler that allows Users to designate received Content as Spam, and send a report to an external entity containing information about that Content that may be used by the external entity to prevent further instances of unwanted Content from reaching Users. The scope of this enabler and this document covers only the SpamRep message format and interface between User Device and the external recipient entity. The User interface is out of scope, as is any functionality of the external entity beyond the SpamRep/Device interface."},{"url":"http://www.openmobilealliance.org/release/SpamRep/V1_0-20101123-C/OMA-SUP-XSD_spam_rep-V1_0-20101123-C.xsd","file":"OMA-SUP-XSD_spam_rep-V1_0-20101123-C.xsd","status":"Candidate","version":"V1.0","date":"2010-11-23","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SpamRep/V1_0-20101123-C/OMA-TS-SpamRep-V1_0-20101123-C.pdf","file":"OMA-TS-SpamRep-V1_0-20101123-C.pdf","status":"Candidate","version":"V1.0","date":"2010-11-23","contentMediaType":"application/pdf","description":"The scope of this document is to define the technical details of the SpamRep Enabler, including: •SpamRep message format and characteristics •SpamRep Client-Server protocol •Client procedures •Server procedures relevant to the SpamRep Client-Server interface  This document does not address technical areas that are outside the scope of the SpamRep 1.0 Enabler, such as server-to-server message forwarding, processing the SpamRep message, or server interaction with any external spam-mitigation infrastructure."}]}}