{"input":{"cteatedAt":"2021-02-17T22:11:22.517Z","url":"http://www.openmobilealliance.org/release/EmailNot/V1_0-20021031-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/EmailNot/V1_0-20021031-C/OMA-EMN-V1_0-20021031-C.zip","file":"OMA-EMN-V1_0-20021031-C.zip","status":"Candidate","version":"V1.0","date":"2002-10-31","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/EmailNot/V1_0-20021031-C/OMA-ERELD-EMN-V1_0-20021031-C.pdf","file":"OMA-ERELD-EMN-V1_0-20021031-C.pdf","status":"Candidate","version":"V1.0","date":"2002-10-31","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of E-Mail Notification according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The scope of OMA EMN includes only the format for the e-mail notification itself.  The EMN specification adds value to existing e-mail does not affect existing Internet e-mail transport protocols.  Behaviour of the e-mail client and e-mail server are beyond the scope of the EMN specification."},{"url":"http://www.openmobilealliance.org/release/EmailNot/V1_0-20021031-C/OMA-Push-EMN-V1_0-20020830-C.pdf","file":"OMA-Push-EMN-V1_0-20020830-C.pdf","status":"Candidate","version":"V1.0","date":"2002-08-30","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) Wireless Application Protocol (WAP) is a result of continuous work to define an industry wide specification for developing applications that operate over wireless communication networks. The scope for the Open Mobile Alliance is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAP]. This specification defines a content type that can be used to notify e-mail clients that new e-mail is available for retrieval on an e-mail server. The e-mail notification (EMN) content can be sent using the WAP Push [PUSH] framework to a device with an EMN User Agent. This specification defines the EMN User Agent to be the client-side application that handles the EMN and triggers the e-mail client for further action. This specification does not define any normative behaviour for e-mail clients nor e-mail servers, as both fall out of the scope of the WAP Forum. Furthermore, this specification is independent of e-mail protocols such as POP3 or IMAP4. Nevertheless, use cases are presented to identify possible usage of the e-mail notification. The EMN content type is an application of the Extensible Markup Language (XML) 1.0 [XML]. WBXML [WBXML] tokens are defined to allow for efficient over-the-air transmission."}]}}