{"input":{"cteatedAt":"2021-02-18T13:21:01.730Z","url":"http://www.openmobilealliance.org/release/UAProf/V2_0-20060206-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/UAProf/V2_0-20060206-A/OMA-ERELD-UAProf-V2_0-20060206-A.pdf","file":"OMA-ERELD-UAProf-V2_0-20060206-A.pdf","status":"Approved","version":"V2.0","date":"2006-02-06","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of User Agent Profile (UAProf) according to OMA Release process and the Enabler Release specification baseline listed in section 5.  OMA’s User Agent Profile specification is concerned with capturing classes of device capabilities and preference information. These classes include (but are not restricted to) the hardware and software characteristics of the device as well as information about the network to which the device is connected. The user agent profile contains information used for content formatting purposes. A user agent profile is distinct from a user preference profile that would contain application-specific information about the user for content selection purposes."},{"url":"http://www.openmobilealliance.org/release/UAProf/V2_0-20060206-A/OMA-ERP-UAProf-V2_0-20060206-A.zip","file":"OMA-ERP-UAProf-V2_0-20060206-A.zip","status":"Approved","version":"V2.0","date":"2006-02-06","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/UAProf/V2_0-20060206-A/OMA-TS-UAProf-V2_0-20060206-A.pdf","file":"OMA-TS-UAProf-V2_0-20060206-A.pdf","status":"Approved","version":"V2.0","date":"2006-02-06","contentMediaType":"application/pdf","description":"The User Agent Profile specification is concerned with capturing classes of device capabilities and preference information. These classes include (but are not restricted to) the hardware and software characteristics of the device as well as information about the network to which the device is connected.  The user agent profile contains information used for content formatting purposes.  A user agent profile is distinct from a user preference profile that would contain application-specific information about the user for content selection purposes.  For example, a user preference profile might designate whether the user is interested in receiving sports scores and, if so, the particular teams.  The specification of user preference profiles is beyond the scope of this document. In accordance with Composite Capability/Preference Profiles (CC/PP) [CCPP], the user agent profile schema is defined using an RDF schema and vocabulary [RDF-Schema].  This document defines the structure of this schema in terms of the class definitions and semantics of attributes for devices adhering to the WAP standard.  Extensibility guidelines are also offered to assist in extending the schema with new components. Regarding the user agent profile, this document assumes that: •The  information  contained  within  the  profile  is  provided  on  behalf  of  the  user  who  will  be  receiving  the  content  contained in the associated WSP or HTTP response. Profiles may also be used by the Push Proxy Gateway (PPG). •The  CC/PP  repository  storing  the  profile  is  secure,  meaning  that  it  does  not  permit  unauthorized  modification  to  stored profile information. The functionality associated with this repository may be implemented in a WAP gateway or intermediate proxy or as a separate standalone element in the network.  •WSP/HTTP  headers  are  generally  not  encrypted.    Because  this  specification  does  not  define  any  security  mechanisms,  care  must  be  taken  when  including  user-confidential  information1in  the  profile  unless  the  profile  is  transmitted over an end-to-end secure channel (e.g. TLS/WTLS to the origin server). •An  implicit  chain  of  trust  exists  between  the  client  and  origin  server.  The  integrity  of  the  profile  is  maintained  (in  other  words,  not  compromised)  as  it  is  transmitted  through  or  cached  within  the  network.  It  is  assumed  that  the  network  elements  that  contribute  property  descriptions  to  the  profile  are  trusted.    Network  elements  will  not  assemble a “history” about users by tracking the deltas in their profile over time.  •To ensure the integrity of the profile, lower-level mechanisms, such as TLS or WTLS, must be used. Use of the profile by the origin server is intended to optomize the content to the characteristics of the device, and the users’ preferences. If the profile were discarded, corrupted, or otherwise inaccessible, the origin server should still provide content to the client. It should be noted that user agent profiles are not statements of conformance but rather, a content negotiation tool to be used to adapt content between a client and content provider.  1The definition of “confidential” varies among different users, cultures, and service providers.  It is therefore impossible to define a profile schema that meets the security needs of all users while still conveying any useful information."}]}}