{"input":{"cteatedAt":"2021-02-18T13:05:48.119Z","url":"http://www.openmobilealliance.org/release/SCIDM/V1_0-20100209-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/SCIDM/V1_0-20100209-C/OMA-AD-SCIDM-V1_0-20090728-C.pdf","file":"OMA-AD-SCIDM-V1_0-20090728-C.pdf","status":"Candidate","version":"V1.0","date":"2009-07-28","contentMediaType":"application/pdf","description":"This document describes the architecture of the SCIDM Enabler. The architecture is based on the requirements and the use cases included in SCIDM Requirements document [SCIDM-RD] and described at high level as believed to be significant from the architectural point of view. The objective of the SCIDM Enabler is to leverage available identification mechanisms to identify all kinds of content including both premier and user generated content for various applications. Among the available identification mechanisms, Content Fingerprint based identification is mandatory to be supported in this Enabler. The architecture shown in this document is intended to facilitate the development of specifications for content registration, query and identification. The description of the architecture comprises the definition of functional components and the interfaces used or exposed by these functional components. Note that this Enabler does not specify application-specified mechanisms, such as the content management schemes and rules. Definition of metadata for specific applications is also out of scope."},{"url":"http://www.openmobilealliance.org/release/SCIDM/V1_0-20100209-C/OMA-ERELD-SCIDM-V1_0-20100209-C.pdf","file":"OMA-ERELD-SCIDM-V1_0-20100209-C.pdf","status":"Candidate","version":"V1.0","date":"2010-02-09","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of SCIDM according to OMA Release process and the Enabler Release specification baseline listed in section 5."},{"url":"http://www.openmobilealliance.org/release/SCIDM/V1_0-20100209-C/OMA-ERP-SCIDM-V1_0-20100209-C.zip","file":"OMA-ERP-SCIDM-V1_0-20100209-C.zip","status":"Candidate","version":"V1.0","date":"2010-02-09","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/SCIDM/V1_0-20100209-C/OMA-RD-SCIDM-V1_0-20081216-C.pdf","file":"OMA-RD-SCIDM-V1_0-20081216-C.pdf","status":"Candidate","version":"V1.0","date":"2008-12-16","contentMediaType":"application/pdf","description":"This Requirement Document (RD) contains use cases and defines the requirements for the Secure Content Identification Mechanism enabler to identify all kinds of content including both premier and user generated content, for various applications such as copyright verification, software authentication, and content filtering, etc. The following areas will be covered in this RD: \u0001 Content identity registration/query/verification/certification/error reporting \u0001 Content ID assignment \u0001 Secure content identification/authentication mechanisms Secure Content Identification Mechanism enabler will reuse as much as possible existing technologies. Some requirements may be shared between multiple OMA WGs, where extensions to other enablers may be needed."},{"url":"http://www.openmobilealliance.org/release/SCIDM/V1_0-20100209-C/OMA-SUP-XSD_scidm_messages-V1_0-20100209-C.xsd","file":"OMA-SUP-XSD_scidm_messages-V1_0-20100209-C.xsd","status":"Candidate","version":"V1.0","date":"2010-02-09","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/SCIDM/V1_0-20100209-C/OMA-TS-SCIDM-V1_0-20100209-C.pdf","file":"OMA-TS-SCIDM-V1_0-20100209-C.pdf","status":"Candidate","version":"V1.0","date":"2010-02-09","contentMediaType":"application/pdf","description":"This document presents the complete Technical Specification of Secure Content Identification Mechanism (SCIDM) Version 1.0, including the transactions, message types and their information elements, status and error codes, and other details. The following items are within the scope of this Technical Specification of the SCIDM 1.0 Enabler: •Transactions •Definition of the transaction message types and their information elements, status and error codes. •Definition of the formats of the content identity, and content ID certificates •Guidelines for the use of metadata in SCIDM •Guidelines for the use of content fingerprinting algorithms in SCIDM •Guidelines for the deployment of SCIDM (i.e., Deployment Model),  including whether SCIDM Server (CIM) is deployed as a platform for identification or embedded in a specific application and is dedicated to that application, the deployment location of SCIDM Client and its interoperation with the application that uses the SCIDM for content identification. •Guidelines on the performance issues, including some guidelines about how to address the limitations of identification of real-time, large-scale content, and how to reduce the delay experienced by the User during content access. •The adaptation of SCIDM messages to some commonly used transport protocols The following items fall outside the scope of this Technical Specification of the SCIDM v1.0 Enabler: •The definition of Content Metadata •The formal specification of content fingerprinting algorithms •The formal specification of interoperation between CIM/SCIDM Client and the application."}]}}