{"input":{"cteatedAt":"2021-02-18T12:19:38.168Z","url":"http://www.openmobilealliance.org/release/MIW/V1_0-20050726-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MIW/V1_0-20050726-C/OMA-RD_MsgInterworking-V1_0-20050726-C.pdf","file":"OMA-RD_MsgInterworking-V1_0-20050726-C.pdf","status":"Candidate","version":"V1.0","date":"2005-07-26","contentMediaType":"application/pdf","description":"This document presents use cases and requirements for interworking of different messaging services and messaging systems in the mobile environment.  The purpose of the use-cases is to highlight, from the user experience point of view, how the messaging services would interact in a seamless manner giving the user the feeling of total messaging. The use-cases lead to a set of requirements for definition of what is needed for the messaging services to interwork seamlessly. This may lead to several different outcomes: •A particular requirement is already fulfilled by existing specifications, e.g. the MM3 interface of MMS. •There is a need for specification of additional messaging enablers to fulfil (a) requirement(s). •A requirement is left for implementation and may not need standards. The main purpose of use cases is to identify what pertinent functionality is possible with currently available standards, to identify areas where current standards are lacking, and based on that, make a prioritization of what should be standardized. The scope of interworking is not limited to messaging systems deployed by a single network operator.  Interworking between messaging systems involving two different wireless network operators or between a wireless network operator and another type of service provider is considered so as to evaluate commonalities that could be extracted from different messaging services.  Each use case is separately studied, since call flows may be unique, and new messaging service elements (e.g. a new interface, protocol, or database) may be necessary.  Some services that are currently not under study elsewhere within OMA, such as Videotelephony Mailbox and Voicemail are considered in order to cover the entire messaging landscape, and extract commonalities, and evaluate opportunities for interworking with considerable market potential."}]}}