{"input":{"cteatedAt":"2021-02-18T12:19:40.160Z","url":"http://www.openmobilealliance.org/release/MIW/V1_0-20061010-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/MIW/V1_0-20061010-C/OMA-RD-MsgInterworking-V1_0-20060913-C.pdf","file":"OMA-RD-MsgInterworking-V1_0-20060913-C.pdf","status":"Candidate","version":"V1.0","date":"2006-09-13","contentMediaType":"application/pdf","description":"This document presents use cases and requirements for interworking of different messaging services and messaging systems in the mobile environment.  The purpose of the use-cases is to highlight, from the user experience point of view, how the messaging services would interact in a seamless manner giving the user the feeling of total messaging. The use-cases lead to a set of requirements for definition of what is needed for the messaging services to interwork seamlessly. This may lead to several different outcomes: •A particular requirement is already fulfilled by existing specifications, e.g. the MM3 interface of MMS. •There is a need for specification of additional messaging enablers to fulfil (a) requirement(s). •A requirement is left for implementation and may not need standards. The main purpose of use cases is to identify what pertinent functionality is possible with currently available standards, to identify areas where current standards are lacking, and based on that, make a prioritization of what should be standardized. The scope of interworking is not limited to messaging systems deployed by a single network operator.  Interworking between messaging systems involving two different wireless network operators or between a wireless network operator and another type of service provider is considered so as to evaluate commonalities that could be extracted from different messaging services.  Each use case is separately studied, since call flows may be unique, and new messaging service elements (e.g. a new interface, protocol, or database) may be necessary.  Some services that are currently not under study elsewhere within OMA, such as Videotelephony Mailbox and Voicemail are considered in order to cover the entire messaging landscape, and extract commonalities, and evaluate opportunities for interworking with considerable market potential."},{"url":"http://www.openmobilealliance.org/release/MIW/V1_0-20061010-C/OMA-RRELD-MIW-V1_0-20061010-C.pdf","file":"OMA-RRELD-MIW-V1_0-20061010-C.pdf","status":"Candidate","version":"V1.0","date":"2006-10-10","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Reference Release Definition of MIW – Messaging Services Interworking - according to OMA Release process and the Reference Release document baseline listed in section 6."},{"url":"http://www.openmobilealliance.org/release/MIW/V1_0-20061010-C/OMA-RRP-MIW-V1_0-20061010-C.zip","file":"OMA-RRP-MIW-V1_0-20061010-C.zip","status":"Candidate","version":"V1.0","date":"2006-10-10","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/MIW/V1_0-20061010-C/OMA-WP-MsgSvc_Intw_Arch-20061010-C.pdf","file":"OMA-WP-MsgSvc_Intw_Arch-20061010-C.pdf","status":"","version":"","date":"","contentMediaType":"application/pdf","description":"This document presents an architecture that could be used to facilitate the interworking between different mobile messaging services.  This architecture is based on the analysis of the use-cases presented in the corresponding Requirements Document. The basic assumptions of this architecture include: -The interworking between messaging services occurs only within a single messaging service provider at the receiving end of a message. -The interworking between messaging services should provide support for the messaging options used by the originator (i.e. if the message sender requests notification of delivery, and the destination messaging service supports delivery notifications, then the interworking function should facilitate this), unless the destination messaging service is unable to provide the requested messaging options. -The User Profile should indicate what messaging services the user is subscribed to, and the preferred messaging service to use to receive different types of messages, e.g. prefers to receive “voice” messages in his voicemail-box. -The Presence status should indicate what messaging services the user is currently available on. -Existence of unique identifier that provides ability to access recipient’s user profile and obtain the recipient address. -There is a need for the architecture to be interoperable with the industry-accepted IMS/MMD architecture. The proposed architecture is intended to identify additional enablers that may need specification by OMA, however, these should be covered by additional work-items that are accepted by the OMA-TP. The architecture proposed in this document is intended to be input for the Converged IP Messaging work-item, and any subsequent technical work on interworking of messaging services will be performed in the scope of that work-item."}]}}