{"input":{"cteatedAt":"2021-02-17T22:13:06.648Z","url":"http://www.openmobilealliance.org/release/GS-CSI/V1_0-20110329-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/GS-CSI/V1_0-20110329-A/OMA-AD-Game-Services-Architecture-V1_0-20110329-A.pdf","file":"OMA-AD-Game-Services-Architecture-V1_0-20110329-A.pdf","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/pdf","description":"This document describes the base concepts and high-level architecture of the OMA Gaming Service. Technical details of the server framework are covered in the specifications for Gaming Platform 1.0 [GP10] and the technical details for the client and server are covered in Client/Server Interface [ClientServerInterface].   Starting from business drivers, the document describes the key features of the OMA gaming platform in enabler release 1.0 and enabler release 2.0 and sets them into perspective."},{"url":"http://www.openmobilealliance.org/release/GS-CSI/V1_0-20110329-A/OMA-ERELD-GS-CSI-V1_0-20110329-A.pdf","file":"OMA-ERELD-GS-CSI-V1_0-20110329-A.pdf","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Game Services CSI V1.0 according to OMA Release process and the Enabler Release specification baseline listed in section 6."},{"url":"http://www.openmobilealliance.org/release/GS-CSI/V1_0-20110329-A/OMA-ERP-GS-CSI-V1_0-20110329-A.zip","file":"OMA-ERP-GS-CSI-V1_0-20110329-A.zip","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/GS-CSI/V1_0-20110329-A/OMA-RD-Game-Services-V1_0-20110329-A.pdf","file":"OMA-RD-Game-Services-V1_0-20110329-A.pdf","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/pdf","description":"This document presents the Requirements for the OMA Game Service 2.0, and the Use Cases from which they are derived.  The Requirements herein should be understood as those minimally necessary to implement a service that supports connect and multiplayer gaming over mobile networks and devices; a more comprehensive Game Service RD is planned.  The document notes when Requirements overlap with, or can be satisfied by, other OMA working groups or other standards external to OMA.  The Requirements fall in to five distinct phases of the User’s interaction with the Game Service: obtaining the game over the the air from the Game Service; activating the game in connected, or multiplayer, mode and subsequent accounting, access, authentication and authorization; creating a new, or enterring an existing game session; game play and User experience despite network lapses; and finally statistics, usage capture, and personalization.  It should be noted that portions of these five phases may be implemented by different business entities."},{"url":"http://www.openmobilealliance.org/release/GS-CSI/V1_0-20110329-A/OMA-TS-Game-Services-Client-Server-Interface-V1_0-20110329-A.pdf","file":"OMA-TS-Game-Services-Client-Server-Interface-V1_0-20110329-A.pdf","status":"Approved","version":"V1.0","date":"2011-03-29","contentMediaType":"application/pdf","description":"The Open Mobile Alliance (OMA) Game Services (GS) Client-Server Interface (CSI) is a result of continuous work to define an industry-wide specification for developing game applications that operate over wireless communication networks.  The scope for the Open Mobile Alliance is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and providing new services. To enable operators, service providers and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, the OMA-GS CSI enabler defines a set of interfaces in (transport, session and) application layers. For additional information on the OMA-GS CSI architecture, refer to “Game Services Architecture” [GSAD].  The scope of OMA-GS “Client Server Interface” is to enable the controlled usability of wireless games, e.g. the ability to execute games and have a standardized interaction with the game server. The defined technology is an initial Game Service System that can be extended into a more comprehensive Game Service System in the future."}]}}