{"input":{"cteatedAt":"2021-02-17T22:01:09.766Z","url":"http://www.openmobilealliance.org/release/DRM/V1_0-20040625-A/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/DRM/V1_0-20040625-A/OMA-Download-ARCH-V1_0-20040625-A.pdf","file":"OMA-Download-ARCH-V1_0-20040625-A.pdf","status":"Approved","version":"V1.0","date":"2004-06-25","contentMediaType":"application/pdf","description":"The scope of OMA Download is procedures for making the downloading of media objects from the Web easy and reliable, and possible to charge for. Also in the scope of OMA Download is the ability to preview media objects and to prevent downloaded content from being forwarded (copied) to other users. Preview and copy protection are part of Digital Rights Management (DRM). A complete DRM technology is, however, not in scope of OMA Download. These basic DRM features - preview and copy protection - are included because of the urgency to deploy a standardised solution."},{"url":"http://www.openmobilealliance.org/release/DRM/V1_0-20040625-A/OMA-Download-DRM-V1_0-20040615-A.pdf","file":"OMA-Download-DRM-V1_0-20040615-A.pdf","status":"Approved","version":"V1.0","date":"2004-06-15","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the Open Mobile Alliance is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. The scope of OMA “Digital Rights Management” is to enable the controlled consumption of digital media objects by allowing content providers to express usage rights, e.g., the ability to preview DRM content, to prevent downloaded DRM content from being illegally forwarded (copied) to other users, and to enable superdistribution of DRM content. The defined technology is an initial DRM system that can be extended into a more comprehensive and secure DRM system."},{"url":"http://www.openmobilealliance.org/release/DRM/V1_0-20040625-A/OMA-Download-DRMCF-V1_0-20040615-A.pdf","file":"OMA-Download-DRMCF-V1_0-20040615-A.pdf","status":"Approved","version":"V1.0","date":"2004-06-15","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the Open Mobile Alliance is to define a set of specifications to be used by service applications. The wireless market is growing very quickly, and reaching new customers and providing new services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session and application layers. For additional information on the WAP architecture, refer to “Wireless Application Protocol Architecture Specification” [WAPARCH]. The scope of OMA “Digital Rights Management” is to enable the controlled consumption of digital media objects by allowing content providers to express usage rights, e.g., the ability to preview DRM content, to prevent downloaded DRM content from being illegally forwarded (copied) to other users, and to enable superdistribution of DRM content. The defined technology is an initial DRM system that can be extended into a more comprehensive and secure DRM system. The scope for this specification is to define the content format for DRM protected encrypted media objects and associated metadata.  The content format is intended to be used in the separate delivery DRM method defined in the OMA “Digital Rights Management” specification."},{"url":"http://www.openmobilealliance.org/release/DRM/V1_0-20040625-A/OMA-Download-DRMREL-V1_0-20040615-A.pdf","file":"OMA-Download-DRMREL-V1_0-20040615-A.pdf","status":"Approved","version":"V1.0","date":"2004-06-15","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) Wireless Application Protocol (WAP) is a result of continuous work to define an industry-wide specification for developing applications that operate over wireless communication networks. The scope for the Open Mobile Alliance is to define a set of specifications to be used by service applications. The wireless market is growing very quickly and reaching new customers and services. To enable operators and manufacturers to meet the challenges in advanced services, differentiation, and fast/flexible service creation, WAP defines a set of protocols in transport, session, and application layers. For additional information on the WAP architecture, refer to [WAPARCH]. The scope of OMA “Digital Rights Management” [DRM] is to enable the controlled consumption of digital media objects by allowing content providers to express usage rights, e.g., the ability to preview DRM content, to prevent downloaded DRM content from being illegally forwarded (copied) to other users, and to enable super distribution of DRM content. The defined technology is an initial DRM system that can be extended into a more comprehensive and secure DRM system. The scope for this specification is to define the rights expression language used to describe the rights governing the usage of DRM content. It addresses requirements such as enabling preview, i.e., test-driving, of content, possibly prior to purchasing, expressing a range of different permissions and constraints, and optimisation of rights objects delivered over constrained bearers. It provides a concise mechanism for expressing rights over DRM content. It is independent of the content being distributed, the mechanism used for distributing the content, and the billing mechanism used to handle the payments. The OMA “Digital Rights Management” specification defines the context in which the DRM Rights Expression Language is used."},{"url":"http://www.openmobilealliance.org/release/DRM/V1_0-20040625-A/OMA-DRM-V1_0-20040625-A.zip","file":"OMA-DRM-V1_0-20040625-A.zip","status":"Approved","version":"V1.0","date":"2004-06-25","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DRM/V1_0-20040625-A/OMA-ERELD-DRM-V1_0-20040625-A.pdf","file":"OMA-ERELD-DRM-V1_0-20040625-A.pdf","status":"Approved","version":"V1.0","date":"2004-06-25","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Digital Rights Management (DRM) according to OMA Release process and the Enabler Release specification baseline listed in section 5.  The scope of OMA DRM includes the ability to preview media objects and to prevent downloaded content from being forwarded (copied) to other users. Preview and copy protection are part of DRM. A complete DRM technology is, however, not in scope of OMA DRM. These basic DRM features – preview and copy protection – are included because of the urgency to deploy a standardised solution."}]}}