{"input":{"cteatedAt":"2021-02-17T22:03:09.743Z","url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/","host":"www.openmobilealliance.org"},"result":{"data":[{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-AD-DRM-V2_1-20070724-C.pdf","file":"OMA-AD-DRM-V2_1-20070724-C.pdf","status":"Candidate","version":"V2.1","date":"2007-07-24","contentMediaType":"application/pdf","description":"The scope of OMA “Digital Rights Management” is to enable the controlled consumption of digital media objects by allowing content providers the ability, for example, to manage previews of DRM Content, to enable superdistribution of DRM Content, and to enable transfer of content between DRM Agents. The OMA DRM specifications provide mechanisms for secure authentication of trusted DRM Agents, and for secure packaging and transfer of usage rights and DRM Content to trusted DRM Agents."},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-ERELD-DRM-V2_1-20070724-C.pdf","file":"OMA-ERELD-DRM-V2_1-20070724-C.pdf","status":"Candidate","version":"V2.1","date":"2007-07-24","contentMediaType":"application/pdf","description":"The scope of this document is limited to the Enabler Release Definition of Digital Rights Management 2.1 according to OMA Release process and the Enabler Release specification baseline listed in section  5."},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-ERP-DRM-V2_1-20070724-C.zip","file":"OMA-ERP-DRM-V2_1-20070724-C.zip","status":"Candidate","version":"V2.1","date":"2007-07-24","contentMediaType":"application/zip"},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-RD-DRM-V2_1-20061010-C.pdf","file":"OMA-RD-DRM-V2_1-20061010-C.pdf","status":"Candidate","version":"V2.1","date":"2006-10-10","contentMediaType":"application/pdf","description":"This document defines the requirements for the 2.1release of DRM specification within OMA. Whereas the aim for DRM v2.0 was to improve the level of security of OMA DRM Version 1, due to the lack of a key management infrastructure, DRM v2.1 will focus on introducing new features based on market feedback: -A metering capability -Improvements of (P)DCF file formats linked to user experience (additional Metadata boxes) -A possibility to identify a device from servers other than those of Rights Issuers -A binary format for ROAP triggers -A capability to distinguish between different content categories (ring-tones vs music tracks, ...), & a clarified support for CD burning The 2.1 version will also clarify or correct some inconsistencies of the 2.0 version. Requirements in this document are requirements for Versions 1.0, 2.0 & 2.1 implementations. Requirements are backward compatible, i.e. requirements applying for a given version of the DRM apply to the higher versions, unless stated otherwise."},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-SUP-XSD_DRM_REL-V2_1-20070724-C.xsd","file":"OMA-SUP-XSD_DRM_REL-V2_1-20070724-C.xsd","status":"Candidate","version":"V2.1","date":"2007-07-24","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-SUP-XSD_DRM_RELDD-V2_1-20070724-C.xsd","file":"OMA-SUP-XSD_DRM_RELDD-V2_1-20070724-C.xsd","status":"Candidate","version":"V2.1","date":"2007-07-24","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-SUP-XSD_DRM_RELODD-V2_1-20070724-C.xsd","file":"OMA-SUP-XSD_DRM_RELODD-V2_1-20070724-C.xsd","status":"Candidate","version":"V2.1","date":"2007-07-24","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-SUP-XSD_DRM_ROAP-V1_1-20070724-C.xsd","file":"OMA-SUP-XSD_DRM_ROAP-V1_1-20070724-C.xsd","status":"Candidate","version":"V1.1","date":"2007-07-24","contentMediaType":"application/xml"},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-TS-DRM_DCF-V2_1-20070724-C.pdf","file":"OMA-TS-DRM_DCF-V2_1-20070724-C.pdf","status":"Candidate","version":"V2.1","date":"2007-07-24","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks. The scope of OMA “Digital Rights Management” (DRM) is to enable the distribution and consumption of digital content in a controlled manner. The content is distributed and consumed on authenticated devices per the usage rights expressed by the content owners. OMA DRM work addresses the various technical aspects of this system by providing appropriate specifications for content formats, protocols, and rights expression languages. A number of DRM specifications have already been defined within the OMA. See [DRM-v1], [DRMCF-v1] and [DRMREL-v1] for more information.   The scope for this specification is to define the content format for DRM protected encrypted media objects and associated metadata. This specification addresses the specific format mechanisms defined in the Release 2.1 “Digital Rights Management” specification [DRM-v2.1]."},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-TS-DRM_DRM-V2_1-20070724-C.pdf","file":"OMA-TS-DRM_DRM-V2_1-20070724-C.pdf","status":"Candidate","version":"V2.1","date":"2007-07-24","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks. The scope of OMA “Digital Rights Management” (DRM) is to enable the distribution and consumption of digital content in a controlled manner. The content is distributed and consumed on authenticated Devices per the usage rights expressed by the content owners. OMA DRM work addresses the various technical aspects of this system by providing appropriate specifications for content formats, protocols, and a rights expression language. A number of DRM specifications have already been defined within the OMA.  See [Error! Reference source not found.], [DRMDCF] and [Error! Reference source not found.].  These existing specifications are referred to within this document as “release 1”. This specification defines the mechanisms and protocols necessary to implement the OMA DRM release 2.1 system. The specification addresses specific requirements enumerated in the Release 2.1 Requirements document Error! Reference source not found..Note: This specification relies on the existence of a Public Key Infrastructure (PKI) facilitating certain security services. With a few exceptions, it is however out of scope for this specification to define the specifics of such a PKI."},{"url":"http://www.openmobilealliance.org/release/DRM/V2_1-20070724-C/OMA-TS-DRM_REL-V2_1-20070724-C.pdf","file":"OMA-TS-DRM_REL-V2_1-20070724-C.pdf","status":"Candidate","version":"V2.1","date":"2007-07-24","contentMediaType":"application/pdf","description":"Open Mobile Alliance (OMA) specifications are the result of continuous work to define industry-wide interoperable mechanisms for developing applications and services that are deployed over wireless communication networks. The scope of OMA “Digital Rights Management” Error! Reference source not found. is to enable the consumption of digital content in a controlled manner. The content is consumed on authenticated devices per the usage rights expressed by the content owners. The OMA DRM work addresses the various technical aspects of this system by providing appropriate specifications for content formats, protocols, and the rights expression language. The scope for this specification is to define the rights expression language used to describe the rights over DRM Content. It addresses requirements such as enabling preview, i.e., test-driving, of Content, possibly prior to purchasing, expressing a range of different permissions and constraints. It provides a concise mechanism for expressing rights over DRM Content. It is independent of the Content being distributed, the mechanism used for distributing the Content, and the billing mechanism used to handle the payments."}]}}